{
    "AlertDetailOverrideAlertDescriptionFormat":  null,
    "AlertDetailOverrideAlertDisplayNameFormat":  null,
    "AlertDetailOverrideAlertSeverityColumnName":  null,
    "AlertDetailOverrideAlertTacticsColumnName":  null,
    "AlertRuleTemplateName":  null,
    "CustomDetail":  {

                     },
    "Description":  "Detects created files on an external mounted device.",
    "DisplayName":  "[Elfawair] USB Data Exfiltration",
    "Enabled":  true,
    "EntityMapping":  [
                          {
                              "EntityType":  {

                                             },
                              "FieldMapping":  [
                                                   {
                                                       "ColumnName":  "DeviceName",
                                                       "Identifier":  "HostName"
                                                   }
                                               ]
                          },
                          {
                              "EntityType":  {

                                             },
                              "FieldMapping":  [
                                                   {
                                                       "ColumnName":  "InitiatingProcessAccountName",
                                                       "Identifier":  "AadUserId"
                                                   }
                                               ]
                          }
                      ],
    "Etag":  "\"a6007840-0000-1100-0000-67dbb2bc0000\"",
    "EventGroupingSettingAggregationKind":  {

                                            },
    "GroupingConfigurationEnabled":  false,
    "GroupingConfigurationGroupByAlertDetail":  [

                                                ],
    "GroupingConfigurationGroupByCustomDetail":  [

                                                 ],
    "GroupingConfigurationGroupByEntity":  [

                                           ],
    "GroupingConfigurationLookbackDuration":  {
                                                  "Ticks":  180000000000,
                                                  "Days":  0,
                                                  "Hours":  5,
                                                  "Milliseconds":  0,
                                                  "Minutes":  0,
                                                  "Seconds":  0,
                                                  "TotalDays":  0.20833333333333331,
                                                  "TotalHours":  5,
                                                  "TotalMilliseconds":  18000000,
                                                  "TotalMinutes":  300,
                                                  "TotalSeconds":  18000
                                              },
    "GroupingConfigurationMatchingMethod":  {

                                            },
    "GroupingConfigurationReopenClosedIncident":  false,
    "Id":  "/subscriptions/5cfeafdb-fc6b-4d09-971d-3320c5ec14a0/resourceGroups/training_jordan/providers/Microsoft.OperationalInsights/workspaces/acmesentinel/providers/Microsoft.SecurityInsights/alertRules/6bbf260b-25c1-4815-b344-dc7d23740a3b",
    "IncidentConfigurationCreateIncident":  true,
    "Kind":  {

             },
    "LastModifiedUtc":  "\/Date(1742451387275)\/",
    "Name":  "6bbf260b-25c1-4815-b344-dc7d23740a3b",
    "Query":  "let TestData = DeviceFileEvents\r\n| where ActionType in (\"FileRenamed\", \"FileModified\", \"FileDeleted\", \"FileCreated\")\r\n| where FileName startswith \"ElfawairTest\"\r\n| summarize\r\n    Files = make_set(FolderPath),\r\n    FilesCount = dcount(FolderPath),\r\n    Starttime = min(TimeGenerated),\r\n    EndTime = max(TimeGenerated),\r\n    Actions = make_set(ActionType)\r\n    by\r\n    InitiatingProcessAccountName,\r\n    DeviceName,\r\n    DeviceId,\r\n    InitiatingProcessAccountUpn\r\n| mv-expand Files;\r\nlet DeviceNameToSearch = \u0027\u0027; // DeviceName to search for. Leave blank to search all devices.\r\nlet TimespanInSeconds = 3600; // Period of time between device insertion and file copy\r\nlet DriveLetter = DeviceEvents\r\n    | where ActionType has \"UsbDriveMounted\"\r\n    | extend USBDriveLetter = tostring(AdditionalFields.DriveLetter)\r\n    | project DeviceId, DeviceName, USBDriveLetter\r\n    | where isnotempty( USBDriveLetter);\r\nlet Connections =\r\n    DeviceEvents\r\n    | where (isempty(DeviceNameToSearch) or DeviceName =~ DeviceNameToSearch) and ActionType == \"PnpDeviceConnected\"\r\n    | extend parsed = parse_json(AdditionalFields)\r\n    | project\r\n        DeviceId,\r\n        DeviceName,\r\n        ConnectionTime = Timestamp,\r\n        DriveClass = tostring(parsed.ClassName),\r\n        UsbDeviceId = tostring(parsed.DeviceId),\r\n        ClassId = tostring(parsed.DeviceId),\r\n        DeviceDescription = tostring(parsed.DeviceDescription),\r\n        VendorIds = tostring(parsed.VendorIds)\r\n    | where DriveClass == \u0027USB\u0027 and DeviceDescription == \u0027USB Mass Storage Device\u0027\r\n    | join kind=inner DriveLetter on DeviceId, DeviceName\r\n    | project-away DeviceId1, DeviceName1;\r\nDeviceFileEvents\r\n| where ActionType in (\"FileRenamed\", \"FileModified\", \"FileDeleted\", \"FileCreated\")\r\n| where (isempty(DeviceNameToSearch) or DeviceName =~ DeviceNameToSearch)\r\n| join kind=inner Connections on DeviceId, DeviceName\r\n| project-away DeviceId1, DeviceName1\r\n| where FolderPath startswith USBDriveLetter\r\n| summarize\r\n    Files = make_set(FolderPath),\r\n    FilesCount = dcount(FolderPath),\r\n    Starttime = min(TimeGenerated),\r\n    EndTime = max(TimeGenerated),\r\n    Actions = make_set(ActionType),\r\n    USBIDs = make_set(UsbDeviceId)\r\n    by\r\n    InitiatingProcessAccountName,\r\n    USBDriveLetter,\r\n    DriveClass,\r\n    DeviceName,\r\n    DeviceId,\r\n    InitiatingProcessAccountUpn\r\n| mv-expand Files\r\n| union TestData;",
    "QueryFrequency":  {
                           "Ticks":  180000000000,
                           "Days":  0,
                           "Hours":  5,
                           "Milliseconds":  0,
                           "Minutes":  0,
                           "Seconds":  0,
                           "TotalDays":  0.20833333333333331,
                           "TotalHours":  5,
                           "TotalMilliseconds":  18000000,
                           "TotalMinutes":  300,
                           "TotalSeconds":  18000
                       },
    "QueryPeriod":  {
                        "Ticks":  180000000000,
                        "Days":  0,
                        "Hours":  5,
                        "Milliseconds":  0,
                        "Minutes":  0,
                        "Seconds":  0,
                        "TotalDays":  0.20833333333333331,
                        "TotalHours":  5,
                        "TotalMilliseconds":  18000000,
                        "TotalMinutes":  300,
                        "TotalSeconds":  18000
                    },
    "Severity":  {

                 },
    "SuppressionDuration":  {
                                "Ticks":  180000000000,
                                "Days":  0,
                                "Hours":  5,
                                "Milliseconds":  0,
                                "Minutes":  0,
                                "Seconds":  0,
                                "TotalDays":  0.20833333333333331,
                                "TotalHours":  5,
                                "TotalMilliseconds":  18000000,
                                "TotalMinutes":  300,
                                "TotalSeconds":  18000
                            },
    "SuppressionEnabled":  false,
    "SystemData":  {
                       "CreatedAt":  null,
                       "CreatedBy":  null,
                       "CreatedByType":  null,
                       "LastModifiedAt":  null,
                       "LastModifiedBy":  null,
                       "LastModifiedByType":  null
                   },
    "SystemDataCreatedAt":  null,
    "SystemDataCreatedBy":  null,
    "SystemDataCreatedByType":  null,
    "SystemDataLastModifiedAt":  null,
    "SystemDataLastModifiedBy":  null,
    "SystemDataLastModifiedByType":  null,
    "Tactic":  [

               ],
    "TemplateVersion":  null,
    "TriggerOperator":  {

                        },
    "TriggerThreshold":  0,
    "Type":  "Microsoft.SecurityInsights/alertRules"
}