{
    "AlertDetailOverrideAlertDescriptionFormat":  null,
    "AlertDetailOverrideAlertDisplayNameFormat":  null,
    "AlertDetailOverrideAlertSeverityColumnName":  null,
    "AlertDetailOverrideAlertTacticsColumnName":  null,
    "AlertRuleTemplateName":  null,
    "CustomDetail":  {

                     },
    "Description":  "Detects a new authentication method followed by a password reset",
    "DisplayName":  "Authentication Methods Changed for an Account Followed by a Password Reset",
    "Enabled":  true,
    "EntityMapping":  [
                          {
                              "EntityType":  {

                                             },
                              "FieldMapping":  [
                                                   {
                                                       "ColumnName":  "userUPN",
                                                       "Identifier":  "FullName"
                                                   }
                                               ]
                          }
                      ],
    "Etag":  "\"9d04300d-0000-1100-0000-66caed5e0000\"",
    "EventGroupingSettingAggregationKind":  {

                                            },
    "GroupingConfigurationEnabled":  true,
    "GroupingConfigurationGroupByAlertDetail":  [

                                                ],
    "GroupingConfigurationGroupByCustomDetail":  [

                                                 ],
    "GroupingConfigurationGroupByEntity":  [

                                           ],
    "GroupingConfigurationLookbackDuration":  {
                                                  "Ticks":  180000000000,
                                                  "Days":  0,
                                                  "Hours":  5,
                                                  "Milliseconds":  0,
                                                  "Minutes":  0,
                                                  "Seconds":  0,
                                                  "TotalDays":  0.20833333333333331,
                                                  "TotalHours":  5,
                                                  "TotalMilliseconds":  18000000,
                                                  "TotalMinutes":  300,
                                                  "TotalSeconds":  18000
                                              },
    "GroupingConfigurationMatchingMethod":  {

                                            },
    "GroupingConfigurationReopenClosedIncident":  false,
    "Id":  "/subscriptions/5cfeafdb-fc6b-4d09-971d-3320c5ec14a0/resourceGroups/training_jordan/providers/Microsoft.OperationalInsights/workspaces/acmesentinel/providers/Microsoft.SecurityInsights/alertRules/cf0472dc-f3ca-47bc-87ae-0f0ee8301da5",
    "IncidentConfigurationCreateIncident":  true,
    "Kind":  {

             },
    "LastModifiedUtc":  "\/Date(1724575069805)\/",
    "Name":  "cf0472dc-f3ca-47bc-87ae-0f0ee8301da5",
    "Query":  "let registernewmethod = AuditLogs\r\n| where ActivityDisplayName contains \"User registered\"\r\n| where ResultReason in (\"User registered Outlook mobile with Code\",\"User registered Mobile Phone SMS\",\"User registered Authenticator App with Code\")\r\n| extend userUPN = tostring(TargetResources[0].userPrincipalName)\r\n| extend registermethodtime = TimeGenerated;\r\nlet passwordreset = AuditLogs\r\n| where ActivityDisplayName contains \"Change user password\"\r\n| extend userUPN = tostring(TargetResources[0].userPrincipalName)\r\n| extend pswdchangetime = TimeGenerated;\r\nregisternewmethod\r\n| join kind=inner passwordreset on userUPN\r\n| where pswdchangetime \u003e registermethodtime\r\n| project TimeGenerated,userUPN,registermethodtime,pswdchangetime,OperationName,ResultReason,InitiatedBy,Result,OperationName1,InitiatedBy1,Result1\r\n",
    "QueryFrequency":  {
                           "Ticks":  108000000000,
                           "Days":  0,
                           "Hours":  3,
                           "Milliseconds":  0,
                           "Minutes":  0,
                           "Seconds":  0,
                           "TotalDays":  0.125,
                           "TotalHours":  3,
                           "TotalMilliseconds":  10800000,
                           "TotalMinutes":  180,
                           "TotalSeconds":  10800
                       },
    "QueryPeriod":  {
                        "Ticks":  108000000000,
                        "Days":  0,
                        "Hours":  3,
                        "Milliseconds":  0,
                        "Minutes":  0,
                        "Seconds":  0,
                        "TotalDays":  0.125,
                        "TotalHours":  3,
                        "TotalMilliseconds":  10800000,
                        "TotalMinutes":  180,
                        "TotalSeconds":  10800
                    },
    "Severity":  {

                 },
    "SuppressionDuration":  {
                                "Ticks":  180000000000,
                                "Days":  0,
                                "Hours":  5,
                                "Milliseconds":  0,
                                "Minutes":  0,
                                "Seconds":  0,
                                "TotalDays":  0.20833333333333331,
                                "TotalHours":  5,
                                "TotalMilliseconds":  18000000,
                                "TotalMinutes":  300,
                                "TotalSeconds":  18000
                            },
    "SuppressionEnabled":  false,
    "SystemData":  {
                       "CreatedAt":  null,
                       "CreatedBy":  null,
                       "CreatedByType":  null,
                       "LastModifiedAt":  null,
                       "LastModifiedBy":  null,
                       "LastModifiedByType":  null
                   },
    "SystemDataCreatedAt":  null,
    "SystemDataCreatedBy":  null,
    "SystemDataCreatedByType":  null,
    "SystemDataLastModifiedAt":  null,
    "SystemDataLastModifiedBy":  null,
    "SystemDataLastModifiedByType":  null,
    "Tactic":  [
                   {

                   }
               ],
    "TemplateVersion":  null,
    "TriggerOperator":  {

                        },
    "TriggerThreshold":  0,
    "Type":  "Microsoft.SecurityInsights/alertRules"
}