{
    "AlertDetailOverrideAlertDescriptionFormat":  null,
    "AlertDetailOverrideAlertDisplayNameFormat":  null,
    "AlertDetailOverrideAlertSeverityColumnName":  null,
    "AlertDetailOverrideAlertTacticsColumnName":  null,
    "AlertRuleTemplateName":  null,
    "CustomDetail":  {

                     },
    "Description":  "Identify when a user has received a phishing email, clicked on a URL within it, and subsequently performed a successful sign-in from a location that hasn\u0027t been seen before for the user in the last 5 days.",
    "DisplayName":  "Correlation: Phish Delivered Followed by an Anomalous Sign-In",
    "Enabled":  true,
    "EntityMapping":  [
                          {
                              "EntityType":  {

                                             },
                              "FieldMapping":  [
                                                   {
                                                       "ColumnName":  "UserPrincipalName",
                                                       "Identifier":  "Name"
                                                   }
                                               ]
                          },
                          {
                              "EntityType":  {

                                             },
                              "FieldMapping":  [
                                                   {
                                                       "ColumnName":  "AnomalousIP",
                                                       "Identifier":  "Address"
                                                   }
                                               ]
                          },
                          {
                              "EntityType":  {

                                             },
                              "FieldMapping":  [
                                                   {
                                                       "ColumnName":  "AnomalousLocationDetail",
                                                       "Identifier":  "Name"
                                                   }
                                               ]
                          }
                      ],
    "Etag":  "\"9c04d4f6-0000-1100-0000-66caed0e0000\"",
    "EventGroupingSettingAggregationKind":  {

                                            },
    "GroupingConfigurationEnabled":  true,
    "GroupingConfigurationGroupByAlertDetail":  [

                                                ],
    "GroupingConfigurationGroupByCustomDetail":  [

                                                 ],
    "GroupingConfigurationGroupByEntity":  [

                                           ],
    "GroupingConfigurationLookbackDuration":  {
                                                  "Ticks":  2592000000000,
                                                  "Days":  3,
                                                  "Hours":  0,
                                                  "Milliseconds":  0,
                                                  "Minutes":  0,
                                                  "Seconds":  0,
                                                  "TotalDays":  3,
                                                  "TotalHours":  72,
                                                  "TotalMilliseconds":  259200000,
                                                  "TotalMinutes":  4320,
                                                  "TotalSeconds":  259200
                                              },
    "GroupingConfigurationMatchingMethod":  {

                                            },
    "GroupingConfigurationReopenClosedIncident":  false,
    "Id":  "/subscriptions/5cfeafdb-fc6b-4d09-971d-3320c5ec14a0/resourceGroups/training_jordan/providers/Microsoft.OperationalInsights/workspaces/acmesentinel/providers/Microsoft.SecurityInsights/alertRules/c0c89a84-fdff-4ed4-a443-405ad0af56ef",
    "IncidentConfigurationCreateIncident":  true,
    "Kind":  {

             },
    "LastModifiedUtc":  "\/Date(1724574986844)\/",
    "Name":  "c0c89a84-fdff-4ed4-a443-405ad0af56ef",
    "Query":  "let ZappedEmail = EmailPostDeliveryEvents\r\n    | where TimeGenerated \u003e ago(14d)\r\n    | where ActionType == \"Spam ZAP\" or ActionType == \"Phish ZAP\"\r\n    | distinct NetworkMessageId;\r\nlet PhishEmail = EmailEvents\r\n    | where TimeGenerated \u003e ago(14d)\r\n    | where ThreatTypes == \"Phish\"\r\n    | distinct NetworkMessageId;\r\nlet PhishEntity = PhishEmail\r\n    | union ZappedEmail;\r\nlet PhishEmailURLClick = UrlClickEvents\r\n    | where TimeGenerated \u003e ago(14d)\r\n    | join kind=inner PhishEntity on NetworkMessageId\r\n    | project ClickedURL= Url, PhishEmailNID=NetworkMessageId;\r\nlet PhishEmailDetails = EmailEvents\r\n    | where TimeGenerated \u003e ago(14d)\r\n    | join kind=inner PhishEmailURLClick on $left.NetworkMessageId == $right.PhishEmailNID\r\n    | project-away NetworkMessageId\r\n    | where not(OrgLevelPolicy contains \"Phishing Simulation\")\r\n    | where not(OrgLevelPolicy contains \"Sender address list (Safe sender / Blocked sender)\")\r\n    | where not(UserLevelPolicy contains \"Sender address list (Safe sender / Blocked sender)\")\r\n    | where not(SenderFromAddress contains \"knowbe4\")\r\n    | where not(SenderFromDomain contains \"knowbe4\")\r\n    | where not(InternetMessageId contains \"knowbe4\")\r\n    | where SenderFromAddress !in (\"dse@eumail.docusign.net\",\"dse_na2@docusign.net\",\"dse_na3@docusign.net\")\r\n    | extend EmailDeliveryTime = TimeGenerated\r\n    | join kind=leftouter EmailAttachmentInfo on $left.PhishEmailNID == $right.NetworkMessageId\r\n    | join kind=leftouter EmailPostDeliveryEvents on $left.PhishEmailNID == $right.NetworkMessageId\r\n    | summarize Attachments = make_set(FileName), ClickedURLs = make_set(ClickedURL)\r\n        by\r\n        EmailDeliveryTime,\r\n        SenderFromAddress,\r\n        RecipientEmailAddress,\r\n        PhishEmailNID,\r\n        Subject,\r\n        UrlCount,\r\n        SenderIPv4,\r\n        ConfidenceLevel,\r\n        ThreatTypes,\r\n        ActionType\r\n    | extend PhishingEmailDetails = strcat(\r\n                                    \"Email received: \",\r\n                                    tostring(EmailDeliveryTime), \r\n                                    \"\\n Email subject: \",\r\n                                    tostring(Subject), \r\n                                    \"\\n Email Network Message ID: \",\r\n                                    tostring(PhishEmailNID),\r\n                                    \"\\n Email Recipient: \",\r\n                                    tostring(RecipientEmailAddress), \r\n                                    \"\\n Email sender: \",\r\n                                    tostring(SenderFromAddress),\r\n                                    \"\\n Sender\u0027s IP: \",\r\n                                    tostring(SenderIPv4),\r\n                                    \"\\n URLs count: \",\r\n                                    tostring(UrlCount),\r\n                                    \"\\n Clicked URLs: \",\r\n                                    tostring(ClickedURLs),\r\n                                    \"\\n Attachments: \",\r\n                                    tostring(Attachments),\r\n                                    \"\\n Confidence level: \",\r\n                                    tostring(ConfidenceLevel),\r\n                                    \"\\n Threat Type: \",\r\n                                    tostring(ThreatTypes),\r\n                                    \"\\n ZAP Type: \",\r\n                                    tostring(ActionType)\r\n                                );\r\nlet KnownLocations = SigninLogs\r\n    | where TimeGenerated between(ago(14d) .. ago(1h)) // ADJUST SECOND PARAMETER DEPENEDING ON RULE FREQUENCY\r\n    | where ResultType == 0\r\n    | extend LocationDetail = strcat(Location, \"-\", LocationDetails.state)\r\n    | summarize UserKnownLocation = make_set(LocationDetail) by UserPrincipalName;\r\nlet IPManagedAttempts = SigninLogs\r\n    | union AADNonInteractiveUserSignInLogs\r\n    | where TimeGenerated \u003e ago(14d)\r\n    | where (tostring(parse_json(DeviceDetail_dynamic).trustType) != \"\" or tostring(parse_json(DeviceDetail_string).trustType) != \"\") or (DeviceDetail_dynamic or DeviceDetail_string contains \"PII Removed\")\r\n    | distinct IPAddress;\r\nlet AnomalousSignIn = SigninLogs\r\n    | join kind=leftouter KnownLocations on UserPrincipalName\r\n    | join kind=inner PhishEmailDetails on $left.UserPrincipalName == $right.RecipientEmailAddress\r\n    | where ResultType == 0\r\n    | where TimeGenerated \u003e ago(1h) // CHANGE IT DEPENDING ON RULE FREQUENCY\r\n    | where tostring(parse_json(DeviceDetail).trustType) == \"\"\r\n    | extend AnomalousLocationDetail = strcat(Location, \"-\", LocationDetails.state)\r\n    | where not(UserKnownLocation has (AnomalousLocationDetail))\r\n    | extend AnomalousSignInTime = TimeGenerated;\r\nAnomalousSignIn\r\n| extend AnomalousSignInTime = format_datetime(AnomalousSignInTime, \u0027yyyy-MM-dd HH\u0027)\r\n| project\r\n    AnomalousSignInTime,\r\n    UserPrincipalName,\r\n    AnomalousLocationDetail,\r\n    UserKnownLocation,\r\n    DeviceDetail,\r\n    AppDisplayName,\r\n    Status,\r\n    AuthenticationRequirement,\r\n    IPAddress,\r\n    PhishingEmailDetails,\r\n    RiskEventTypes,\r\n    RiskEventTypes_V2\r\n| summarize\r\n    AnomalousLocationLatestSignin = arg_max(AnomalousSignInTime, *),\r\n    UserKnownLocations = make_set(UserKnownLocation), \r\n    UsedDevices = make_set(DeviceDetail),\r\n    UsedApps = make_set(AppDisplayName),\r\n    SigninStatuses = make_set(Status),\r\n    AuthRequirements = make_set(AuthenticationRequirement),\r\n    PhishEmailsCustomEntity = make_set(PhishingEmailDetails),\r\n    RiskEventV1 = make_set(RiskEventTypes),\r\n    RiskEventV2= make_set(RiskEventTypes_V2)\r\n    by UserPrincipalName, AnomalousLocationDetail, AnomalousIP = IPAddress\r\n| project-away\r\n    AuthenticationRequirement,\r\n    Status,\r\n    AppDisplayName,\r\n    DeviceDetail,\r\n    UserKnownLocation,\r\n    PhishingEmailDetails\r\n| join kind=leftanti IPManagedAttempts on $left.AnomalousIP == $right.IPAddress",
    "QueryFrequency":  {
                           "Ticks":  36000000000,
                           "Days":  0,
                           "Hours":  1,
                           "Milliseconds":  0,
                           "Minutes":  0,
                           "Seconds":  0,
                           "TotalDays":  0.041666666666666664,
                           "TotalHours":  1,
                           "TotalMilliseconds":  3600000,
                           "TotalMinutes":  60,
                           "TotalSeconds":  3600
                       },
    "QueryPeriod":  {
                        "Ticks":  12096000000000,
                        "Days":  14,
                        "Hours":  0,
                        "Milliseconds":  0,
                        "Minutes":  0,
                        "Seconds":  0,
                        "TotalDays":  14,
                        "TotalHours":  336,
                        "TotalMilliseconds":  1209600000,
                        "TotalMinutes":  20160,
                        "TotalSeconds":  1209600
                    },
    "Severity":  {

                 },
    "SuppressionDuration":  {
                                "Ticks":  180000000000,
                                "Days":  0,
                                "Hours":  5,
                                "Milliseconds":  0,
                                "Minutes":  0,
                                "Seconds":  0,
                                "TotalDays":  0.20833333333333331,
                                "TotalHours":  5,
                                "TotalMilliseconds":  18000000,
                                "TotalMinutes":  300,
                                "TotalSeconds":  18000
                            },
    "SuppressionEnabled":  false,
    "SystemData":  {
                       "CreatedAt":  null,
                       "CreatedBy":  null,
                       "CreatedByType":  null,
                       "LastModifiedAt":  null,
                       "LastModifiedBy":  null,
                       "LastModifiedByType":  null
                   },
    "SystemDataCreatedAt":  null,
    "SystemDataCreatedBy":  null,
    "SystemDataCreatedByType":  null,
    "SystemDataLastModifiedAt":  null,
    "SystemDataLastModifiedBy":  null,
    "SystemDataLastModifiedByType":  null,
    "Tactic":  [
                   {

                   },
                   {

                   }
               ],
    "TemplateVersion":  null,
    "TriggerOperator":  {

                        },
    "TriggerThreshold":  0,
    "Type":  "Microsoft.SecurityInsights/alertRules"
}