{
    "AlertDetailOverrideAlertDescriptionFormat":  null,
    "AlertDetailOverrideAlertDisplayNameFormat":  null,
    "AlertDetailOverrideAlertSeverityColumnName":  null,
    "AlertDetailOverrideAlertTacticsColumnName":  null,
    "AlertRuleTemplateName":  null,
    "CustomDetail":  {

                     },
    "Description":  "",
    "DisplayName":  "DNS exfiltration - OmarY",
    "Enabled":  false,
    "EntityMapping":  null,
    "Etag":  "\"82003498-0000-1100-0000-686654cf0000\"",
    "EventGroupingSettingAggregationKind":  {

                                            },
    "GroupingConfigurationEnabled":  false,
    "GroupingConfigurationGroupByAlertDetail":  [

                                                ],
    "GroupingConfigurationGroupByCustomDetail":  [

                                                 ],
    "GroupingConfigurationGroupByEntity":  [

                                           ],
    "GroupingConfigurationLookbackDuration":  {
                                                  "Ticks":  180000000000,
                                                  "Days":  0,
                                                  "Hours":  5,
                                                  "Milliseconds":  0,
                                                  "Minutes":  0,
                                                  "Seconds":  0,
                                                  "TotalDays":  0.20833333333333331,
                                                  "TotalHours":  5,
                                                  "TotalMilliseconds":  18000000,
                                                  "TotalMinutes":  300,
                                                  "TotalSeconds":  18000
                                              },
    "GroupingConfigurationMatchingMethod":  {

                                            },
    "GroupingConfigurationReopenClosedIncident":  false,
    "Id":  "/subscriptions/5cfeafdb-fc6b-4d09-971d-3320c5ec14a0/resourceGroups/training_jordan/providers/Microsoft.OperationalInsights/workspaces/acmesentinel/providers/Microsoft.SecurityInsights/alertRules/2313d623-6b79-4b44-8ff9-06aa026d323c",
    "IncidentConfigurationCreateIncident":  true,
    "Kind":  {

             },
    "LastModifiedUtc":  "\/Date(1751536847597)\/",
    "Name":  "2313d623-6b79-4b44-8ff9-06aa026d323c",
    "Query":  "let suspiciousDomains = DeviceNetworkEvents\r\n| where ActionType contains \"dns\"\r\n| extend QueryName = tostring(parse_json(AdditionalFields).query)\r\n| extend QueryType = tostring(parse_json(AdditionalFields).qtype_name)\r\n| where QueryType has_any (\"TXT\", \"A\")\r\n| extend Subdomains = split(QueryName, \".\")\r\n| where array_length(Subdomains) \u003e 3\r\n| extend ChildDomain = Subdomains[0]\r\n| extend ParentDomain = extract(@\"([^.]+\\.[^.]+)$\", 1, QueryName)\r\n| where strlen(ChildDomain) \u003e 25  \r\n| where ChildDomain matches regex @\"^[0-9a-fA-F]+$\" or ChildDomain matches regex @\"^[A-Za-z0-9+/=]+$\"\r\n| extend Decoded = base64_decode_tostring(tostring(ChildDomain))\r\n| project DeviceName, QueryName, ParentDomain, Subdomains, AdditionalFields, TimeGenerated, QueryType, ChildDomain, Decoded;\r\n\r\nlet parentSeenBefore = DeviceNetworkEvents\r\n| where TimeGenerated \u003e ago(30d) and TimeGenerated \u003c= ago(1d)\r\n| extend QueryName = tostring(parse_json(AdditionalFields).query)\r\n| extend ParentDomain = extract(@\"([^.]+\\.[^.]+)$\", 1, QueryName)\r\n| summarize LastSeen = max(TimeGenerated) by ParentDomain;\r\n\r\nlet fullDomainSeenLast1Day = DeviceNetworkEvents\r\n| where TimeGenerated \u003e ago(1d)\r\n| extend QueryName = tostring(parse_json(AdditionalFields).query)\r\n| summarize LastSeen = max(TimeGenerated) by QueryName;\r\n\r\nsuspiciousDomains\r\n| join kind=inner fullDomainSeenLast1Day on QueryName\r\n| join kind=leftanti parentSeenBefore on ParentDomain    // exclude parent domains seen before\r\n| project DeviceName, QueryName, ParentDomain, Subdomains, AdditionalFields, TimeGenerated, QueryType, ChildDomain, Decoded\r\n| order by TimeGenerated desc",
    "QueryFrequency":  {
                           "Ticks":  18000000000,
                           "Days":  0,
                           "Hours":  0,
                           "Milliseconds":  0,
                           "Minutes":  30,
                           "Seconds":  0,
                           "TotalDays":  0.020833333333333332,
                           "TotalHours":  0.5,
                           "TotalMilliseconds":  1800000,
                           "TotalMinutes":  30,
                           "TotalSeconds":  1800
                       },
    "QueryPeriod":  {
                        "Ticks":  180000000000,
                        "Days":  0,
                        "Hours":  5,
                        "Milliseconds":  0,
                        "Minutes":  0,
                        "Seconds":  0,
                        "TotalDays":  0.20833333333333331,
                        "TotalHours":  5,
                        "TotalMilliseconds":  18000000,
                        "TotalMinutes":  300,
                        "TotalSeconds":  18000
                    },
    "Severity":  {

                 },
    "SuppressionDuration":  {
                                "Ticks":  180000000000,
                                "Days":  0,
                                "Hours":  5,
                                "Milliseconds":  0,
                                "Minutes":  0,
                                "Seconds":  0,
                                "TotalDays":  0.20833333333333331,
                                "TotalHours":  5,
                                "TotalMilliseconds":  18000000,
                                "TotalMinutes":  300,
                                "TotalSeconds":  18000
                            },
    "SuppressionEnabled":  false,
    "SystemData":  {
                       "CreatedAt":  null,
                       "CreatedBy":  null,
                       "CreatedByType":  null,
                       "LastModifiedAt":  null,
                       "LastModifiedBy":  null,
                       "LastModifiedByType":  null
                   },
    "SystemDataCreatedAt":  null,
    "SystemDataCreatedBy":  null,
    "SystemDataCreatedByType":  null,
    "SystemDataLastModifiedAt":  null,
    "SystemDataLastModifiedBy":  null,
    "SystemDataLastModifiedByType":  null,
    "Tactic":  [
                   {

                   }
               ],
    "TemplateVersion":  null,
    "TriggerOperator":  {

                        },
    "TriggerThreshold":  0,
    "Type":  "Microsoft.SecurityInsights/alertRules"
}