{
    "AlertDetailOverrideAlertDescriptionFormat":  null,
    "AlertDetailOverrideAlertDisplayNameFormat":  null,
    "AlertDetailOverrideAlertSeverityColumnName":  null,
    "AlertDetailOverrideAlertTacticsColumnName":  null,
    "AlertRuleTemplateName":  null,
    "CustomDetail":  {

                     },
    "Description":  "Detects suspicious process injection attempts where an executable injects code into another process, indicating potential malicious activity.",
    "DisplayName":  "Process Injection Detection",
    "Enabled":  true,
    "EntityMapping":  null,
    "Etag":  "\"8300c721-0000-1100-0000-68665cd00000\"",
    "EventGroupingSettingAggregationKind":  {

                                            },
    "GroupingConfigurationEnabled":  false,
    "GroupingConfigurationGroupByAlertDetail":  [

                                                ],
    "GroupingConfigurationGroupByCustomDetail":  [

                                                 ],
    "GroupingConfigurationGroupByEntity":  [

                                           ],
    "GroupingConfigurationLookbackDuration":  {
                                                  "Ticks":  180000000000,
                                                  "Days":  0,
                                                  "Hours":  5,
                                                  "Milliseconds":  0,
                                                  "Minutes":  0,
                                                  "Seconds":  0,
                                                  "TotalDays":  0.20833333333333331,
                                                  "TotalHours":  5,
                                                  "TotalMilliseconds":  18000000,
                                                  "TotalMinutes":  300,
                                                  "TotalSeconds":  18000
                                              },
    "GroupingConfigurationMatchingMethod":  {

                                            },
    "GroupingConfigurationReopenClosedIncident":  false,
    "Id":  "/subscriptions/5cfeafdb-fc6b-4d09-971d-3320c5ec14a0/resourceGroups/training_jordan/providers/Microsoft.OperationalInsights/workspaces/acmesentinel/providers/Microsoft.SecurityInsights/alertRules/7039f53f-0e96-476e-bdbd-d8d97c619386",
    "IncidentConfigurationCreateIncident":  true,
    "Kind":  {

             },
    "LastModifiedUtc":  "\/Date(1751538894929)\/",
    "Name":  "7039f53f-0e96-476e-bdbd-d8d97c619386",
    "Query":  "let CreateRemoteThreadInjections = DeviceEvents\r\n    | where ActionType == \"CreateRemoteThreadApiCall\"\r\n    | extend Method = \"CreateRemoteThread\";\r\nlet MapViewInjections = DeviceEvents\r\n    | where ActionType in (\"MapViewOfFileApiCall\", \"NtMapViewOfSectionApiCall\")\r\n    | extend Method = \"MapViewOfFile/NtMapViewOfSection\";\r\nlet DirectDLLLoadInjections = DeviceEvents\r\n    | where ActionType in (\"LdrLoadDllApiCall\", \"LoadLibraryWApiCall\", \"LoadLibraryExApiCall\", \"CreateRemoteThreadApiCall\")\r\n    | extend Method = ActionType;\r\nlet Regsvr32Rundll32Injections = DeviceProcessEvents\r\n    | where FileName in (\"regsvr32.exe\", \"rundll32.exe\")\r\n    | extend Method = \"Regsvr32/Rundll32 Execution\",\r\n             InjectedPayload = extract(@\"(?i)(\\S+\\.dll)\", 1, ProcessCommandLine);\r\nlet AllInjectionIndicators = union\r\n    CreateRemoteThreadInjections,\r\n    MapViewInjections,\r\n    DirectDLLLoadInjections,\r\n    Regsvr32Rundll32Injections;\r\nlet InjectorID = AlertEvidence\r\n    | where AttackTechniques contains \"T1055.002\"\r\n    | extend InjectorProcessId = tolong(parse_json(AdditionalFields).ProcessId)\r\n    | where isnotnull(InjectorProcessId)\r\n    | project InjectorProcessId;\r\nlet FilteredInjections = AllInjectionIndicators\r\n    | extend InitiatingProcess = coalesce(InitiatingProcessFileName, FileName),\r\n             TargetProcess = coalesce(FileName, InjectedPayload),\r\n             TargetProcessId = coalesce(ProcessId, 0)\r\n    | where InitiatingProcess != TargetProcess;\r\nFilteredInjections\r\n| join kind=inner (InjectorID) on $left.InitiatingProcessId == $right.InjectorProcessId\r\n| distinct InitiatingProcessId, Method,\r\n         TimeGenerated,\r\n         DeviceId,\r\n         DeviceName,\r\n         InitiatingProcess,\r\n         InitiatingProcessCommandLine,\r\n         TargetProcess,\r\n         TargetProcessId,\r\n         ProcessCommandLine,\r\n         InjectedPayload\r\n| project\r\n    TimeGenerated,\r\n    DeviceId,\r\n    DeviceName,\r\n    Method,\r\n    InitiatingProcess,\r\n    InitiatingProcessId,\r\n    InitiatingProcessCommandLine,\r\n    TargetProcess,\r\n    TargetProcessId,\r\n    ProcessCommandLine,\r\n    InjectedPayload = iff(isnotempty(InjectedPayload), InjectedPayload, \"\")",
    "QueryFrequency":  {
                           "Ticks":  3000000000,
                           "Days":  0,
                           "Hours":  0,
                           "Milliseconds":  0,
                           "Minutes":  5,
                           "Seconds":  0,
                           "TotalDays":  0.003472222222222222,
                           "TotalHours":  0.083333333333333329,
                           "TotalMilliseconds":  300000,
                           "TotalMinutes":  5,
                           "TotalSeconds":  300
                       },
    "QueryPeriod":  {
                        "Ticks":  3000000000,
                        "Days":  0,
                        "Hours":  0,
                        "Milliseconds":  0,
                        "Minutes":  5,
                        "Seconds":  0,
                        "TotalDays":  0.003472222222222222,
                        "TotalHours":  0.083333333333333329,
                        "TotalMilliseconds":  300000,
                        "TotalMinutes":  5,
                        "TotalSeconds":  300
                    },
    "Severity":  {

                 },
    "SuppressionDuration":  {
                                "Ticks":  180000000000,
                                "Days":  0,
                                "Hours":  5,
                                "Milliseconds":  0,
                                "Minutes":  0,
                                "Seconds":  0,
                                "TotalDays":  0.20833333333333331,
                                "TotalHours":  5,
                                "TotalMilliseconds":  18000000,
                                "TotalMinutes":  300,
                                "TotalSeconds":  18000
                            },
    "SuppressionEnabled":  false,
    "SystemData":  {
                       "CreatedAt":  null,
                       "CreatedBy":  null,
                       "CreatedByType":  null,
                       "LastModifiedAt":  null,
                       "LastModifiedBy":  null,
                       "LastModifiedByType":  null
                   },
    "SystemDataCreatedAt":  null,
    "SystemDataCreatedBy":  null,
    "SystemDataCreatedByType":  null,
    "SystemDataLastModifiedAt":  null,
    "SystemDataLastModifiedBy":  null,
    "SystemDataLastModifiedByType":  null,
    "Tactic":  [
                   {

                   }
               ],
    "TemplateVersion":  null,
    "TriggerOperator":  {

                        },
    "TriggerThreshold":  1,
    "Type":  "Microsoft.SecurityInsights/alertRules"
}