{
    "contentVersion":  "1.0.0.0",
    "$schema":  "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "resources":  [
                      {
                          "id":  "[concat(resourceId(\u0027Microsoft.OperationalInsights/workspaces/providers\u0027, parameters(\u0027workspace\u0027), \u0027Microsoft.SecurityInsights\u0027),\u0027/alertRules/e21b4778-67f0-4b04-91a9-1e96e8f9d049\u0027)]",
                          "name":  "[concat(parameters(\u0027workspace\u0027),\u0027/Microsoft.SecurityInsights/e21b4778-67f0-4b04-91a9-1e96e8f9d049\u0027)]",
                          "type":  "Microsoft.OperationalInsights/workspaces/providers/alertRules",
                          "kind":  "Scheduled",
                          "apiVersion":  "2023-12-01-preview",
                          "properties":  {
                                             "displayName":  "T1115 - Dina",
                                             "description":  "",
                                             "severity":  "Medium",
                                             "enabled":  true,
                                             "query":  "DeviceProcessEvents\r\n| where (\r\n    FileName in (\"clip.exe\", \"clipboard.exe\", \"ClipboardUserService.exe\") \r\n    or ProcessCommandLine has \"clipboard\"\r\n    or FileName in (\"winword.exe\")  // Microsoft Word process\r\n)\r\n| where (\r\n    // Filter for suspicious macro-like command line flags or parent process names\r\n    ProcessCommandLine has_any (\"-m\", \"/m\", \"/macro\", \"/macro1\", \"autoexec\", \"vba\") \r\n    or InitiatingProcessFileName in (\"wscript.exe\", \"cscript.exe\", \"powershell.exe\", \"cmd.exe\") // script hosts often used to launch macros\r\n    or InitiatingProcessCommandLine has_any (\"macro\", \"vba\", \"autoexec\")\r\n)\r\n| where InitiatingProcessFileName !in (\"explorer.exe\", \"taskmgr.exe\", \"cmd.exe\") // exclude common legit parents\r\n| where AccountName  !in (\"LocalSystem\", \"NetworkService\", \"LocalService\")\r\n| project TimeGenerated, DeviceName, InitiatingProcessFileName, FileName, ProcessCommandLine, InitiatingProcessCommandLine, InitiatingProcessParentFileName, AccountName, AccountSid\r\n| order by TimeGenerated asc ",
                                             "queryFrequency":  "PT5H",
                                             "queryPeriod":  "PT5H",
                                             "triggerOperator":  "GreaterThan",
                                             "triggerThreshold":  0,
                                             "suppressionDuration":  "PT5H",
                                             "suppressionEnabled":  false,
                                             "startTimeUtc":  null,
                                             "tactics":  [
                                                             "Collection"
                                                         ],
                                             "techniques":  [

                                                            ],
                                             "subTechniques":  [

                                                               ],
                                             "alertRuleTemplateName":  null,
                                             "incidentConfiguration":  {
                                                                           "createIncident":  true,
                                                                           "groupingConfiguration":  {
                                                                                                         "enabled":  true,
                                                                                                         "reopenClosedIncident":  false,
                                                                                                         "lookbackDuration":  "PT5H",
                                                                                                         "matchingMethod":  "AllEntities",
                                                                                                         "groupByEntities":  [

                                                                                                                             ],
                                                                                                         "groupByAlertDetails":  [

                                                                                                                                 ],
                                                                                                         "groupByCustomDetails":  [

                                                                                                                                  ]
                                                                                                     }
                                                                       },
                                             "eventGroupingSettings":  {
                                                                           "aggregationKind":  "SingleAlert"
                                                                       },
                                             "alertDetailsOverride":  {
                                                                          "alertDisplayNameFormat":  "Suspicious Clipboard Access via PowerShell",
                                                                          "alertDynamicProperties":  [

                                                                                                     ]
                                                                      },
                                             "customDetails":  null,
                                             "entityMappings":  null,
                                             "sentinelEntitiesMappings":  null,
                                             "templateVersion":  null
                                         }
                      }
                  ],
    "parameters":  {
                       "workspace":  {
                                         "type":  "String"
                                     }
                   }
}