{
    "AlertDetailOverrideAlertDescriptionFormat":  null,
    "AlertDetailOverrideAlertDisplayNameFormat":  null,
    "AlertDetailOverrideAlertSeverityColumnName":  null,
    "AlertDetailOverrideAlertTacticsColumnName":  null,
    "AlertRuleTemplateName":  null,
    "CustomDetail":  {

                     },
    "Description":  "T1566.002 Made by Ahmad Altrabsheh and Mohamad Al-Shahwan",
    "DisplayName":  "T1566.002 Phishing: Spearphishing Link",
    "Enabled":  true,
    "EntityMapping":  [
                          {
                              "EntityType":  {

                                             },
                              "FieldMapping":  [
                                                   {
                                                       "ColumnName":  "RecipientEmailAddress",
                                                       "Identifier":  "Name"
                                                   }
                                               ]
                          },
                          {
                              "EntityType":  {

                                             },
                              "FieldMapping":  [
                                                   {
                                                       "ColumnName":  "SenderFromAddress",
                                                       "Identifier":  "Name"
                                                   }
                                               ]
                          },
                          {
                              "EntityType":  {

                                             },
                              "FieldMapping":  [
                                                   {
                                                       "ColumnName":  "Url",
                                                       "Identifier":  "Url"
                                                   }
                                               ]
                          },
                          {
                              "EntityType":  {

                                             },
                              "FieldMapping":  [
                                                   {
                                                       "ColumnName":  "SenderIPv4",
                                                       "Identifier":  "Address"
                                                   }
                                               ]
                          }
                      ],
    "Etag":  "\"7f00fb94-0000-1100-0000-6866206f0000\"",
    "EventGroupingSettingAggregationKind":  {

                                            },
    "GroupingConfigurationEnabled":  false,
    "GroupingConfigurationGroupByAlertDetail":  [

                                                ],
    "GroupingConfigurationGroupByCustomDetail":  [

                                                 ],
    "GroupingConfigurationGroupByEntity":  [

                                           ],
    "GroupingConfigurationLookbackDuration":  {
                                                  "Ticks":  180000000000,
                                                  "Days":  0,
                                                  "Hours":  5,
                                                  "Milliseconds":  0,
                                                  "Minutes":  0,
                                                  "Seconds":  0,
                                                  "TotalDays":  0.20833333333333331,
                                                  "TotalHours":  5,
                                                  "TotalMilliseconds":  18000000,
                                                  "TotalMinutes":  300,
                                                  "TotalSeconds":  18000
                                              },
    "GroupingConfigurationMatchingMethod":  {

                                            },
    "GroupingConfigurationReopenClosedIncident":  false,
    "Id":  "/subscriptions/5cfeafdb-fc6b-4d09-971d-3320c5ec14a0/resourceGroups/training_jordan/providers/Microsoft.OperationalInsights/workspaces/acmesentinel/providers/Microsoft.SecurityInsights/alertRules/9e33359a-dc4c-4131-bb92-9645ce3569cf",
    "IncidentConfigurationCreateIncident":  true,
    "Kind":  {

             },
    "LastModifiedUtc":  "\/Date(1751523437556)\/",
    "Name":  "9e33359a-dc4c-4131-bb92-9645ce3569cf",
    "Query":  "let MaliciousDomainTable = externaldata(RawData:string)\r\n[\u0027https://raw.githubusercontent.com/romainmarcoux/malicious-domains/main/full-domains-aa.txt\u0027]\r\n| parse RawData with MaliciousDomain:string;\r\nlet EmailRegexMatches = EmailUrlInfo\r\n| where TimeGenerated \u003e ago(1d)\r\n| where Url matches regex @\"pub-[0-9a-fA-F]{32}\\.r2\\.dev\\/[a-zA-Z0-9_-]+\\.(exe|html)\"\r\n| join kind=inner EmailEvents on NetworkMessageId\r\n| where DeliveryAction != \"Blocked\";\r\nlet EmailListMatches = EmailUrlInfo\r\n| where TimeGenerated \u003e ago(1d)\r\n| extend UrlDomain = tostring(parse_url(Url).Host)\r\n| join kind=inner MaliciousDomainTable on $left.UrlDomain == $right.MaliciousDomain\r\n| join kind=inner EmailEvents on NetworkMessageId\r\n| where DeliveryAction != \"Blocked\";\r\nlet DeviceListMatches = DeviceNetworkEvents\r\n| where TimeGenerated \u003e ago(1d)\r\n| where ActionType == \"HttpConnectionInspected\"\r\n| extend Host = tostring(parse_json(AdditionalFields)[\"host\"])\r\n| extend R2Host = tostring(split(Host, \":\")[0])\r\n| extend Direction = tostring(parse_json(AdditionalFields)[\"direction\"])\r\n| where Direction == \"Out\" and Host has \".r2.dev\"\r\n| join kind=inner MaliciousDomainTable on $left.R2Host == $right.MaliciousDomain;\r\nlet DeviceRegexMatches = DeviceNetworkEvents\r\n| where TimeGenerated \u003e ago(1d)\r\n| where ActionType == \"HttpConnectionInspected\"\r\n| extend Url = tostring(parse_json(AdditionalFields)[\"requestUrl\"])\r\n| where Url matches regex @\"pub-[0-9a-fA-F]{32}\\.r2\\.dev\\/[a-zA-Z0-9_-]+\\.(exe|html)\";\r\nEmailRegexMatches\r\n| union EmailListMatches\r\n| union DeviceListMatches\r\n| union DeviceRegexMatches\r\n| project RecivedTime=TimeGenerated, ClickTime=TimeGenerated1, NetworkMessageId , SenderFromAddress ,RecipientEmailAddress , SenderIPv4 , Url , DeliveryLocation , AuthenticationDetails ,ConfidenceLevel \r\n",
    "QueryFrequency":  {
                           "Ticks":  3000000000,
                           "Days":  0,
                           "Hours":  0,
                           "Milliseconds":  0,
                           "Minutes":  5,
                           "Seconds":  0,
                           "TotalDays":  0.003472222222222222,
                           "TotalHours":  0.083333333333333329,
                           "TotalMilliseconds":  300000,
                           "TotalMinutes":  5,
                           "TotalSeconds":  300
                       },
    "QueryPeriod":  {
                        "Ticks":  36000000000,
                        "Days":  0,
                        "Hours":  1,
                        "Milliseconds":  0,
                        "Minutes":  0,
                        "Seconds":  0,
                        "TotalDays":  0.041666666666666664,
                        "TotalHours":  1,
                        "TotalMilliseconds":  3600000,
                        "TotalMinutes":  60,
                        "TotalSeconds":  3600
                    },
    "Severity":  {

                 },
    "SuppressionDuration":  {
                                "Ticks":  180000000000,
                                "Days":  0,
                                "Hours":  5,
                                "Milliseconds":  0,
                                "Minutes":  0,
                                "Seconds":  0,
                                "TotalDays":  0.20833333333333331,
                                "TotalHours":  5,
                                "TotalMilliseconds":  18000000,
                                "TotalMinutes":  300,
                                "TotalSeconds":  18000
                            },
    "SuppressionEnabled":  false,
    "SystemData":  {
                       "CreatedAt":  null,
                       "CreatedBy":  null,
                       "CreatedByType":  null,
                       "LastModifiedAt":  null,
                       "LastModifiedBy":  null,
                       "LastModifiedByType":  null
                   },
    "SystemDataCreatedAt":  null,
    "SystemDataCreatedBy":  null,
    "SystemDataCreatedByType":  null,
    "SystemDataLastModifiedAt":  null,
    "SystemDataLastModifiedBy":  null,
    "SystemDataLastModifiedByType":  null,
    "Tactic":  [

               ],
    "TemplateVersion":  null,
    "TriggerOperator":  {

                        },
    "TriggerThreshold":  0,
    "Type":  "Microsoft.SecurityInsights/alertRules"
}