{
    "AlertDetailOverrideAlertDescriptionFormat":  null,
    "AlertDetailOverrideAlertDisplayNameFormat":  null,
    "AlertDetailOverrideAlertSeverityColumnName":  null,
    "AlertDetailOverrideAlertTacticsColumnName":  null,
    "AlertRuleTemplateName":  null,
    "CustomDetail":  {

                     },
    "Description":  "",
    "DisplayName":  "Test-Offboarding_H",
    "Enabled":  false,
    "EntityMapping":  [
                          {
                              "EntityType":  {

                                             },
                              "FieldMapping":  [
                                                   {
                                                       "ColumnName":  "UserId",
                                                       "Identifier":  "FullName"
                                                   }
                                               ]
                          }
                      ],
    "Etag":  "\"70002789-0000-1100-0000-683192490000\"",
    "EventGroupingSettingAggregationKind":  {

                                            },
    "GroupingConfigurationEnabled":  false,
    "GroupingConfigurationGroupByAlertDetail":  [

                                                ],
    "GroupingConfigurationGroupByCustomDetail":  [

                                                 ],
    "GroupingConfigurationGroupByEntity":  [

                                           ],
    "GroupingConfigurationLookbackDuration":  {
                                                  "Ticks":  180000000000,
                                                  "Days":  0,
                                                  "Hours":  5,
                                                  "Milliseconds":  0,
                                                  "Minutes":  0,
                                                  "Seconds":  0,
                                                  "TotalDays":  0.20833333333333331,
                                                  "TotalHours":  5,
                                                  "TotalMilliseconds":  18000000,
                                                  "TotalMinutes":  300,
                                                  "TotalSeconds":  18000
                                              },
    "GroupingConfigurationMatchingMethod":  {

                                            },
    "GroupingConfigurationReopenClosedIncident":  false,
    "Id":  "/subscriptions/5cfeafdb-fc6b-4d09-971d-3320c5ec14a0/resourceGroups/training_jordan/providers/Microsoft.OperationalInsights/workspaces/acmesentinel/providers/Microsoft.SecurityInsights/alertRules/7c84c9ae-0936-43fe-9e13-2450b9050710",
    "IncidentConfigurationCreateIncident":  true,
    "Kind":  {

             },
    "LastModifiedUtc":  "\/Date(1748079177238)\/",
    "Name":  "7c84c9ae-0936-43fe-9e13-2450b9050710",
    "Query":  "let terminated_users = _GetWatchlist(\"HalaWatchlist\") \r\n| project User = SearchKey;\r\nlet file_downloads = OfficeActivity \r\n| where (RecordType == \"SharePointFileOperation\" or RecordType == \"OneDriveFileOperation\") \r\n| where Operation == \"FileDownloaded\" \r\n| where UserId in (terminated_users) \r\n| summarize DownloadedFiles = make_set(SourceFileName) by UserId \r\n| extend Action = \"Downloaded files from SharePoint/OneDrive\";\r\nlet secure_link_creation = OfficeActivity \r\n| where UserId in (terminated_users) \r\n| where Operation == \"SecureLinkCreated\" \r\n| summarize LinksCreated = make_set(SourceFileName) by UserId \r\n| extend Action = \"Created secure links\";\r\nlet added_users_to_links = OfficeActivity \r\n| where UserId in (terminated_users) \r\n| where Operation == \"AddedToSecureLink\" \r\n| summarize AddedUsers = make_set(TargetUserOrGroupName) by UserId \r\n| extend Action = \"Added users to secure links\";\r\nlet guest_added = OfficeActivity \r\n| where Operation == \"AddedToSecureLink\" \r\n| where TargetUserOrGroupType == \"Guest\" \r\n| where UserId in (terminated_users) \r\n| summarize GuestsAdded = make_set(TargetUserOrGroupName) by UserId \r\n| extend Action = \"Added guest user to secure link\";\r\nlet cloud_file_sharing_sites = dynamic([\r\n    \"box.com\", \"drive.google.com\", \"dropbox.com\", \"mega.io\", \"mediafire.com\", \r\n    \"pCloud.com\", \"sync.com\", \"zoho.com\", \"Tresorit.com\", \"nextcloud.com\", \r\n    \"spideroak.com\", \"onedrive.com\", \"we.tl\", \"sendspace.com\", \"hightail.com\", \r\n    \"icloud.com\", \"4shared.com\", \"rapidshare.com\", \"zippyshare.com\", \r\n    \"filefactory.com\", \"sugarsync.com\", \"transfernow.net\", \"sendgb.com\", \r\n    \"files.fm\", \"smash.com\", \"sharefile.com\", \"gofile.io\", \"uploadfiles.io\", \r\n    \"filemail.com\", \"transfer.pcloud.com\"\r\n]);\r\nlet cloud_access = DeviceNetworkEvents \r\n| where RemoteUrl in (cloud_file_sharing_sites) \r\n| where InitiatingProcessAccountUpn in (terminated_users) \r\n| summarize AccessedSites = make_set(RemoteUrl) by InitiatingProcessAccountUpn \r\n| extend Action = \"Accessed cloud file-sharing sites\";\r\nlet external_emails = EmailEvents \r\n| where SenderFromAddress  in (terminated_users) \r\n| where RecipientEmailAddress !contains \"synergyhousing.com\" and RecipientEmailAddress !contains \"synergyglobalhousing\" \r\n| summarize RecipientEmails = make_set(RecipientEmailAddress), EmailSubjects = make_set(Subject), EmailCount = count() by SenderFromAddress \r\n| extend Action = \"Sent emails to external recipients\";\r\nlet specific_apps = dynamic([\"notion.so\", \"wetransfer.com\", \"discord.com\"]);\r\nlet app_usage = DeviceNetworkEvents \r\n| where RemoteUrl in (specific_apps) \r\n| where InitiatingProcessAccountUpn in (terminated_users) \r\n| summarize AccessedApps = make_set(RemoteUrl) by InitiatingProcessAccountUpn \r\n| extend Action = \"Accessed Notion, WeTransfer, or Discord\";\r\nlet recent_signins = SigninLogs \r\n| where UserPrincipalName in (terminated_users) \r\n| summarize RecentSignins = make_list(pack(\"TimeGenerated\", TimeGenerated, \"IPAddress\", IPAddress, \"AppDisplayName\", AppDisplayName, \"Status\", Status), 3) by UserPrincipalName \r\n| extend Action = \"Recent sign-ins\";\r\nlet actions_summary = file_downloads \r\n| union secure_link_creation \r\n| union added_users_to_links \r\n| union guest_added \r\n| union cloud_access \r\n| union external_emails \r\n| union app_usage \r\n| union recent_signins \r\n| summarize Actions = make_set(Action), DownloadedFiles = make_set(DownloadedFiles), LinksCreated = make_set(LinksCreated), AddedUsers = make_set(AddedUsers), GuestsAdded = make_set(GuestsAdded), AccessedSites = make_set(AccessedSites), RecipientEmails = make_set(RecipientEmails), EmailSubjects = make_set(EmailSubjects), AccessedApps = make_set(AccessedApps), RecentSignins = make_set(RecentSignins) by UserId = coalesce(UserId, InitiatingProcessAccountUpn, SenderFromAddress, UserPrincipalName);\r\nactions_summary \r\n| extend Summary = strcat(\"User: \", UserId, \"\\nActions: \\n - \", Actions, \"\\nDetails:\\n - Downloaded Files: \", tostring(DownloadedFiles), \"\\n - Links Created: \", tostring(LinksCreated), \"\\n - Added Users to Links: \", tostring(AddedUsers), \"\\n - Guests Added: \", tostring(GuestsAdded), \"\\n - Accessed Cloud Sites: \", tostring(AccessedSites), \"\\n - Sent Emails: \", tostring(RecipientEmails), \"\\n - Email Subjects: \", tostring(EmailSubjects), \"\\n - Accessed Apps: \", tostring(AccessedApps), \"\\n - Recent Sign-ins: \", tostring(RecentSignins)) \r\n| project UserId, Summary",
    "QueryFrequency":  {
                           "Ticks":  36000000000,
                           "Days":  0,
                           "Hours":  1,
                           "Milliseconds":  0,
                           "Minutes":  0,
                           "Seconds":  0,
                           "TotalDays":  0.041666666666666664,
                           "TotalHours":  1,
                           "TotalMilliseconds":  3600000,
                           "TotalMinutes":  60,
                           "TotalSeconds":  3600
                       },
    "QueryPeriod":  {
                        "Ticks":  864000000000,
                        "Days":  1,
                        "Hours":  0,
                        "Milliseconds":  0,
                        "Minutes":  0,
                        "Seconds":  0,
                        "TotalDays":  1,
                        "TotalHours":  24,
                        "TotalMilliseconds":  86400000,
                        "TotalMinutes":  1440,
                        "TotalSeconds":  86400
                    },
    "Severity":  {

                 },
    "SuppressionDuration":  {
                                "Ticks":  180000000000,
                                "Days":  0,
                                "Hours":  5,
                                "Milliseconds":  0,
                                "Minutes":  0,
                                "Seconds":  0,
                                "TotalDays":  0.20833333333333331,
                                "TotalHours":  5,
                                "TotalMilliseconds":  18000000,
                                "TotalMinutes":  300,
                                "TotalSeconds":  18000
                            },
    "SuppressionEnabled":  false,
    "SystemData":  {
                       "CreatedAt":  null,
                       "CreatedBy":  null,
                       "CreatedByType":  null,
                       "LastModifiedAt":  null,
                       "LastModifiedBy":  null,
                       "LastModifiedByType":  null
                   },
    "SystemDataCreatedAt":  null,
    "SystemDataCreatedBy":  null,
    "SystemDataCreatedByType":  null,
    "SystemDataLastModifiedAt":  null,
    "SystemDataLastModifiedBy":  null,
    "SystemDataLastModifiedByType":  null,
    "Tactic":  [
                   {

                   }
               ],
    "TemplateVersion":  null,
    "TriggerOperator":  {

                        },
    "TriggerThreshold":  0,
    "Type":  "Microsoft.SecurityInsights/alertRules"
}