{
    "AlertDetailOverrideAlertDescriptionFormat":  null,
    "AlertDetailOverrideAlertDisplayNameFormat":  null,
    "AlertDetailOverrideAlertSeverityColumnName":  null,
    "AlertDetailOverrideAlertTacticsColumnName":  null,
    "AlertRuleTemplateName":  "5e45930c-09b1-4430-b2d1-cc75ada0dc0f",
    "CustomDetail":  {

                     },
    "Description":  "This query maps any IP indicators of compromise (IOCs) from threat intelligence (TI), by searching for matches in Cisco Meraki Logs.",
    "DisplayName":  "TI Map IP Entity to Cisco Meraki - [WC-BASE]",
    "Enabled":  false,
    "EntityMapping":  [
                          {
                              "EntityType":  {

                                             },
                              "FieldMapping":  [
                                                   {
                                                       "ColumnName":  "DeviceName",
                                                       "Identifier":  "HostName"
                                                   }
                                               ]
                          },
                          {
                              "EntityType":  {

                                             },
                              "FieldMapping":  [
                                                   {
                                                       "ColumnName":  "DstIpAddr",
                                                       "Identifier":  "Address"
                                                   }
                                               ]
                          },
                          {
                              "EntityType":  {

                                             },
                              "FieldMapping":  [
                                                   {
                                                       "ColumnName":  "SrcIpAddr",
                                                       "Identifier":  "Address"
                                                   }
                                               ]
                          },
                          {
                              "EntityType":  {

                                             },
                              "FieldMapping":  [
                                                   {
                                                       "ColumnName":  "Url",
                                                       "Identifier":  "Url"
                                                   }
                                               ]
                          }
                      ],
    "Etag":  "\"17009fba-0000-1100-0000-682da2fb0000\"",
    "EventGroupingSettingAggregationKind":  {

                                            },
    "GroupingConfigurationEnabled":  false,
    "GroupingConfigurationGroupByAlertDetail":  [

                                                ],
    "GroupingConfigurationGroupByCustomDetail":  [

                                                 ],
    "GroupingConfigurationGroupByEntity":  [

                                           ],
    "GroupingConfigurationLookbackDuration":  {
                                                  "Ticks":  288000000000,
                                                  "Days":  0,
                                                  "Hours":  8,
                                                  "Milliseconds":  0,
                                                  "Minutes":  0,
                                                  "Seconds":  0,
                                                  "TotalDays":  0.33333333333333331,
                                                  "TotalHours":  8,
                                                  "TotalMilliseconds":  28800000,
                                                  "TotalMinutes":  480,
                                                  "TotalSeconds":  28800
                                              },
    "GroupingConfigurationMatchingMethod":  {

                                            },
    "GroupingConfigurationReopenClosedIncident":  false,
    "Id":  "/subscriptions/5cfeafdb-fc6b-4d09-971d-3320c5ec14a0/resourceGroups/training_jordan/providers/Microsoft.OperationalInsights/workspaces/AcmeSentinel/providers/Microsoft.SecurityInsights/alertRules/9823cecb-1929-4b43-a8cb-c5188171ee16",
    "IncidentConfigurationCreateIncident":  true,
    "Kind":  {

             },
    "LastModifiedUtc":  "\/Date(1747821307393)\/",
    "Name":  "9823cecb-1929-4b43-a8cb-c5188171ee16",
    "Query":  "let dt_lookBack = 1h;\nlet ioc_lookBack = 14d; // Look back 14 days for threat intelligence indicators\n// Fetch threat intelligence indicators related to IP addresses\nlet IP_Indicators = ThreatIntelIndicators\n| where TimeGenerated \u003e ago(14d)\n| distinct TIEntity = ObservableValue\n| where isnotempty(TIEntity)\n| where ipv4_is_private(TIEntity) == false and TIEntity !startswith \"fe80\" and TIEntity !startswith \"::\" and TIEntity !startswith \"127.\";\n// Perform a join between IP indicators and Cisco Meraki events\nIP_Indicators\n  // Use innerunique to keep performance fast and result set low, as we only need one match to indicate potential malicious activity that needs investigation\n  | join kind=innerunique (\n      CiscoMeraki\n      | where TimeGenerated \u003e= ago(dt_lookBack)\n      | where isnotempty(DstIpAddr)\n      | where ipv4_is_private(DstIpAddr) == false and DstIpAddr !startswith \"fe80\" and DstIpAddr !startswith \"::\" and DstIpAddr !startswith \"127.\"\n      | extend CiscoMeraki_TimeGenerated = TimeGenerated\n  )\n  on $left.TIEntity == $right.DstIpAddr\n  // Group the results by DstIpAddr and keep the Cisco Meraki event with the latest timestamp\n  | summarize CiscoMeraki_TimeGenerated = arg_max(CiscoMeraki_TimeGenerated, *) by DstIpAddr\n  // Select the desired output fields\n  | project timestamp = CiscoMeraki_TimeGenerated,TIEntity, DeviceName, SrcIpAddr, DstIpAddr, DstPortNumber, SrcPortNumber, HttpRequestMethod, SrcMacAddr, NetworkProtocol, LogType\n| where DstPortNumber != 443 //Safe Port",
    "QueryFrequency":  {
                           "Ticks":  36000000000,
                           "Days":  0,
                           "Hours":  1,
                           "Milliseconds":  0,
                           "Minutes":  0,
                           "Seconds":  0,
                           "TotalDays":  0.041666666666666664,
                           "TotalHours":  1,
                           "TotalMilliseconds":  3600000,
                           "TotalMinutes":  60,
                           "TotalSeconds":  3600
                       },
    "QueryPeriod":  {
                        "Ticks":  12096000000000,
                        "Days":  14,
                        "Hours":  0,
                        "Milliseconds":  0,
                        "Minutes":  0,
                        "Seconds":  0,
                        "TotalDays":  14,
                        "TotalHours":  336,
                        "TotalMilliseconds":  1209600000,
                        "TotalMinutes":  20160,
                        "TotalSeconds":  1209600
                    },
    "Severity":  {

                 },
    "SuppressionDuration":  {
                                "Ticks":  36000000000,
                                "Days":  0,
                                "Hours":  1,
                                "Milliseconds":  0,
                                "Minutes":  0,
                                "Seconds":  0,
                                "TotalDays":  0.041666666666666664,
                                "TotalHours":  1,
                                "TotalMilliseconds":  3600000,
                                "TotalMinutes":  60,
                                "TotalSeconds":  3600
                            },
    "SuppressionEnabled":  false,
    "SystemData":  {
                       "CreatedAt":  null,
                       "CreatedBy":  null,
                       "CreatedByType":  null,
                       "LastModifiedAt":  null,
                       "LastModifiedBy":  null,
                       "LastModifiedByType":  null
                   },
    "SystemDataCreatedAt":  null,
    "SystemDataCreatedBy":  null,
    "SystemDataCreatedByType":  null,
    "SystemDataLastModifiedAt":  null,
    "SystemDataLastModifiedBy":  null,
    "SystemDataLastModifiedByType":  null,
    "Tactic":  [
                   {

                   }
               ],
    "TemplateVersion":  "1.4.1",
    "TriggerOperator":  {

                        },
    "TriggerThreshold":  0,
    "Type":  "Microsoft.SecurityInsights/alertRules"
}