{
    "contentVersion":  "1.0.0.0",
    "$schema":  "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "resources":  [
                      {
                          "id":  "[concat(resourceId(\u0027Microsoft.OperationalInsights/workspaces/providers\u0027, parameters(\u0027workspace\u0027), \u0027Microsoft.SecurityInsights\u0027),\u0027/alertRules/6d49de52-c476-458c-97d3-a91418a88cdd\u0027)]",
                          "name":  "[concat(parameters(\u0027workspace\u0027),\u0027/Microsoft.SecurityInsights/6d49de52-c476-458c-97d3-a91418a88cdd\u0027)]",
                          "type":  "Microsoft.OperationalInsights/workspaces/providers/alertRules",
                          "kind":  "Scheduled",
                          "apiVersion":  "2023-12-01-preview",
                          "properties":  {
                                             "displayName":  "Suspicious Screen Capture - Omar",
                                             "description":  "",
                                             "severity":  "Informational",
                                             "enabled":  true,
                                             "query":  "let ScreenCaptureAlerts = \r\n    SecurityAlert\r\n    | where Type == \"SecurityAlert\"\r\n    | where Tactics has \"Collection\"\r\n    | where AlertName == \"Suspicious screen capture activity\"\r\n    | project \r\n        TimeGenerated,\r\n        DeviceName = CompromisedEntity,\r\n        AlertName,\r\n        AlertLink,\r\n        AccountName = \"\",\r\n        FileName = \"\",\r\n        ProcessCommandLine = \"\",\r\n        SourceTable = \"SecurityAlert\";\r\nlet ScreenCaptureProcesses = \r\n    DeviceProcessEvents\r\n    | where ActionType == \"ProcessCreated\"\r\n    | where ProcessCommandLine has_any (\"Drawing\", \"CopyFromScreen\", \"VirtualScreen\", \"xwd\", \"screencapture\")\r\n    | project \r\n        TimeGenerated,\r\n        DeviceName = AccountDomain,\r\n        AlertName = \"\",\r\n        AlertLink = \"\",\r\n        AccountName,\r\n        FileName,\r\n        ProcessCommandLine,\r\n        SourceTable = \"DeviceProcessEvents\";\r\nScreenCaptureAlerts\r\n| union ScreenCaptureProcesses\r\n| sort by TimeGenerated desc",
                                             "queryFrequency":  "PT5M",
                                             "queryPeriod":  "PT5H",
                                             "triggerOperator":  "GreaterThan",
                                             "triggerThreshold":  0,
                                             "suppressionDuration":  "PT5H",
                                             "suppressionEnabled":  false,
                                             "startTimeUtc":  null,
                                             "tactics":  [
                                                             "Collection"
                                                         ],
                                             "techniques":  [
                                                                "T1113",
                                                                "T0852",
                                                                "T1513"
                                                            ],
                                             "subTechniques":  [

                                                               ],
                                             "alertRuleTemplateName":  null,
                                             "incidentConfiguration":  {
                                                                           "createIncident":  true,
                                                                           "groupingConfiguration":  {
                                                                                                         "enabled":  false,
                                                                                                         "reopenClosedIncident":  false,
                                                                                                         "lookbackDuration":  "PT5H",
                                                                                                         "matchingMethod":  "AllEntities",
                                                                                                         "groupByEntities":  [

                                                                                                                             ],
                                                                                                         "groupByAlertDetails":  [

                                                                                                                                 ],
                                                                                                         "groupByCustomDetails":  [

                                                                                                                                  ]
                                                                                                     }
                                                                       },
                                             "eventGroupingSettings":  {
                                                                           "aggregationKind":  "SingleAlert"
                                                                       },
                                             "alertDetailsOverride":  null,
                                             "customDetails":  null,
                                             "entityMappings":  null,
                                             "sentinelEntitiesMappings":  null,
                                             "templateVersion":  null
                                         }
                      }
                  ],
    "parameters":  {
                       "workspace":  {
                                         "type":  "String"
                                     }
                   }
}