{
    "contentVersion":  "1.0.0.0",
    "$schema":  "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "resources":  [
                      {
                          "id":  "[concat(resourceId(\u0027Microsoft.OperationalInsights/workspaces/providers\u0027, parameters(\u0027workspace\u0027), \u0027Microsoft.SecurityInsights\u0027),\u0027/alertRules/9e33359a-dc4c-4131-bb92-9645ce3569cf\u0027)]",
                          "name":  "[concat(parameters(\u0027workspace\u0027),\u0027/Microsoft.SecurityInsights/9e33359a-dc4c-4131-bb92-9645ce3569cf\u0027)]",
                          "type":  "Microsoft.OperationalInsights/workspaces/providers/alertRules",
                          "kind":  "Scheduled",
                          "apiVersion":  "2023-12-01-preview",
                          "properties":  {
                                             "displayName":  "T1566.002 Phishing: Spearphishing Link",
                                             "description":  "T1566.002 Made by Ahmad Altrabsheh and Mohamad Al-Shahwan",
                                             "severity":  "Medium",
                                             "enabled":  true,
                                             "query":  "let MaliciousDomainTable = externaldata(RawData:string)\r\n[\u0027https://raw.githubusercontent.com/romainmarcoux/malicious-domains/main/full-domains-aa.txt\u0027]\r\n| parse RawData with MaliciousDomain:string;\r\nlet EmailRegexMatches = EmailUrlInfo\r\n| where TimeGenerated \u003e ago(1d)\r\n| where Url matches regex @\"pub-[0-9a-fA-F]{32}\\.r2\\.dev\\/[a-zA-Z0-9_-]+\\.(exe|html)\"\r\n| join kind=inner EmailEvents on NetworkMessageId\r\n| where DeliveryAction != \"Blocked\";\r\nlet EmailListMatches = EmailUrlInfo\r\n| where TimeGenerated \u003e ago(1d)\r\n| extend UrlDomain = tostring(parse_url(Url).Host)\r\n| join kind=inner MaliciousDomainTable on $left.UrlDomain == $right.MaliciousDomain\r\n| join kind=inner EmailEvents on NetworkMessageId\r\n| where DeliveryAction != \"Blocked\";\r\nlet DeviceListMatches = DeviceNetworkEvents\r\n| where TimeGenerated \u003e ago(1d)\r\n| where ActionType == \"HttpConnectionInspected\"\r\n| extend Host = tostring(parse_json(AdditionalFields)[\"host\"])\r\n| extend R2Host = tostring(split(Host, \":\")[0])\r\n| extend Direction = tostring(parse_json(AdditionalFields)[\"direction\"])\r\n| where Direction == \"Out\" and Host has \".r2.dev\"\r\n| join kind=inner MaliciousDomainTable on $left.R2Host == $right.MaliciousDomain;\r\nlet DeviceRegexMatches = DeviceNetworkEvents\r\n| where TimeGenerated \u003e ago(1d)\r\n| where ActionType == \"HttpConnectionInspected\"\r\n| extend Url = tostring(parse_json(AdditionalFields)[\"requestUrl\"])\r\n| where Url matches regex @\"pub-[0-9a-fA-F]{32}\\.r2\\.dev\\/[a-zA-Z0-9_-]+\\.(exe|html)\";\r\nEmailRegexMatches\r\n| union EmailListMatches\r\n| union DeviceListMatches\r\n| union DeviceRegexMatches\r\n| project RecivedTime=TimeGenerated, ClickTime=TimeGenerated1, NetworkMessageId , SenderFromAddress ,RecipientEmailAddress , SenderIPv4 , Url , DeliveryLocation , AuthenticationDetails ,ConfidenceLevel \r\n",
                                             "queryFrequency":  "PT5M",
                                             "queryPeriod":  "PT1H",
                                             "triggerOperator":  "GreaterThan",
                                             "triggerThreshold":  0,
                                             "suppressionDuration":  "PT5H",
                                             "suppressionEnabled":  false,
                                             "startTimeUtc":  null,
                                             "tactics":  [

                                                         ],
                                             "techniques":  [

                                                            ],
                                             "subTechniques":  [

                                                               ],
                                             "alertRuleTemplateName":  null,
                                             "incidentConfiguration":  {
                                                                           "createIncident":  true,
                                                                           "groupingConfiguration":  {
                                                                                                         "enabled":  false,
                                                                                                         "reopenClosedIncident":  false,
                                                                                                         "lookbackDuration":  "PT5H",
                                                                                                         "matchingMethod":  "AllEntities",
                                                                                                         "groupByEntities":  [

                                                                                                                             ],
                                                                                                         "groupByAlertDetails":  [

                                                                                                                                 ],
                                                                                                         "groupByCustomDetails":  [

                                                                                                                                  ]
                                                                                                     }
                                                                       },
                                             "eventGroupingSettings":  {
                                                                           "aggregationKind":  "SingleAlert"
                                                                       },
                                             "alertDetailsOverride":  null,
                                             "customDetails":  null,
                                             "entityMappings":  [
                                                                    {
                                                                        "entityType":  "Account",
                                                                        "fieldMappings":  [
                                                                                              {
                                                                                                  "identifier":  "Name",
                                                                                                  "columnName":  "RecipientEmailAddress"
                                                                                              }
                                                                                          ]
                                                                    },
                                                                    {
                                                                        "entityType":  "Account",
                                                                        "fieldMappings":  [
                                                                                              {
                                                                                                  "identifier":  "Name",
                                                                                                  "columnName":  "SenderFromAddress"
                                                                                              }
                                                                                          ]
                                                                    },
                                                                    {
                                                                        "entityType":  "URL",
                                                                        "fieldMappings":  [
                                                                                              {
                                                                                                  "identifier":  "Url",
                                                                                                  "columnName":  "Url"
                                                                                              }
                                                                                          ]
                                                                    },
                                                                    {
                                                                        "entityType":  "IP",
                                                                        "fieldMappings":  [
                                                                                              {
                                                                                                  "identifier":  "Address",
                                                                                                  "columnName":  "SenderIPv4"
                                                                                              }
                                                                                          ]
                                                                    }
                                                                ],
                                             "sentinelEntitiesMappings":  null,
                                             "templateVersion":  null
                                         }
                      }
                  ],
    "parameters":  {
                       "workspace":  {
                                         "type":  "String"
                                     }
                   }
}