{
    "contentVersion":  "1.0.0.0",
    "$schema":  "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "resources":  [
                      {
                          "id":  "[concat(resourceId(\u0027Microsoft.OperationalInsights/workspaces/providers\u0027, parameters(\u0027workspace\u0027), \u0027Microsoft.SecurityInsights\u0027),\u0027/alertRules/6cd6df64-eb55-4bef-80b7-2e8d57c48276\u0027)]",
                          "name":  "[concat(parameters(\u0027workspace\u0027),\u0027/Microsoft.SecurityInsights/6cd6df64-eb55-4bef-80b7-2e8d57c48276\u0027)]",
                          "type":  "Microsoft.OperationalInsights/workspaces/providers/alertRules",
                          "kind":  "NRT",
                          "apiVersion":  "2023-12-01-preview",
                          "properties":  {
                                             "displayName":  "Suspicious Registry Key - [WC-BASE]",
                                             "description":  "This detection identifies suspicious registry key modifications that may indicate attempts to achieve persistence or evade security controls.",
                                             "severity":  "Low",
                                             "enabled":  true,
                                             "query":  "DeviceRegistryEvents\r\n| where RegistryKey has_any (\"Windows Defender\", \"Run\", \"Disable\", \"add\", \"del\") \r\n| where ActionType in (\"RegistryValueSet\", \"RegistryValueDeleted\", \"RegistryKeyCreated\", \"RegistryKeyDeleted\", \"RegistryKeyRenamed\")\r\n| where InitiatingProcessFileName !in~ (\"explorer.exe\", \"svchost.exe\", \"msiexec.exe\", \"services.exe\", \"system\")\r\n| where InitiatingProcessFileName in~ (\"reg.exe\", \"regedit.exe\", \"powershell.exe\", \"cmd.exe\", \"wscript.exe\", \"cscript.exe\")\r\n// | where InitiatingProcessAccountName !in~ (\"SYSTEM\", \"LOCAL SERVICE\", \"NETWORK SERVICE\")\r\n// | where RegistryValueData has_any (\".exe\", \"TEMP\", \"Downloads\", \"Startup\", \"AppData\")\r\n| project TimeGenerated, ActionType, DeviceName, RegistryKey, RegistryValueName, RegistryValueData,\r\n          InitiatingProcessFileName, InitiatingProcessCommandLine,\r\n          InitiatingProcessAccountName, InitiatingProcessAccountSid, DeviceId, ReportId",
                                             "suppressionDuration":  "PT5H",
                                             "suppressionEnabled":  false,
                                             "tactics":  [
                                                             "DefenseEvasion"
                                                         ],
                                             "techniques":  [
                                                                "T1112"
                                                            ],
                                             "subTechniques":  [

                                                               ],
                                             "alertRuleTemplateName":  null,
                                             "incidentConfiguration":  {
                                                                           "createIncident":  true,
                                                                           "groupingConfiguration":  {
                                                                                                         "enabled":  false,
                                                                                                         "reopenClosedIncident":  false,
                                                                                                         "lookbackDuration":  "PT5H",
                                                                                                         "matchingMethod":  "AllEntities",
                                                                                                         "groupByEntities":  [

                                                                                                                             ],
                                                                                                         "groupByAlertDetails":  [

                                                                                                                                 ],
                                                                                                         "groupByCustomDetails":  [

                                                                                                                                  ]
                                                                                                     }
                                                                       },
                                             "eventGroupingSettings":  {
                                                                           "aggregationKind":  "AlertPerResult"
                                                                       },
                                             "alertDetailsOverride":  null,
                                             "customDetails":  null,
                                             "entityMappings":  null,
                                             "sentinelEntitiesMappings":  null,
                                             "templateVersion":  null
                                         }
                      }
                  ],
    "parameters":  {
                       "workspace":  {
                                         "type":  "String"
                                     }
                   }

}











