{
    "AlertDetailOverrideAlertDescriptionFormat":  null,
    "AlertDetailOverrideAlertDisplayNameFormat":  null,
    "AlertDetailOverrideAlertSeverityColumnName":  null,
    "AlertDetailOverrideAlertTacticsColumnName":  null,
    "AlertRuleTemplateName":  null,
    "CustomDetail":  {

                     },
    "Description":  "Detects successful sign-ins using single/multi factor authentication where the device, location, and ASN are abnormal.\nMulti factor authentications pose an opportunity to access compromised accounts, investigate these for anomalous occurrencess.\nRef: https://docs.microsoft.com/azure/active-directory/fundamentals/security-operations-devices#non-compliant-device-sign-in",
    "DisplayName":  "Anomalous Sign-in Detected - [WC-AZURE]",
    "Enabled":  true,
    "EntityMapping":  [
                          {
                              "EntityType":  {

                                             },
                              "FieldMapping":  [
                                                   {
                                                       "ColumnName":  "UserPrincipalName",
                                                       "Identifier":  "Name"
                                                   }
                                               ]
                          },
                          {
                              "EntityType":  {

                                             },
                              "FieldMapping":  [
                                                   {
                                                       "ColumnName":  "IPAddress",
                                                       "Identifier":  "Address"
                                                   }
                                               ]
                          },
                          {
                              "EntityType":  {

                                             },
                              "FieldMapping":  [
                                                   {
                                                       "ColumnName":  "AnomalousLocationDetail",
                                                       "Identifier":  "Name"
                                                   }
                                               ]
                          }
                      ],
    "Etag":  "\"ed004e43-0000-1100-0000-66ba03e60000\"",
    "EventGroupingSettingAggregationKind":  {

                                            },
    "GroupingConfigurationEnabled":  true,
    "GroupingConfigurationGroupByAlertDetail":  [

                                                ],
    "GroupingConfigurationGroupByCustomDetail":  [

                                                 ],
    "GroupingConfigurationGroupByEntity":  [

                                           ],
    "GroupingConfigurationLookbackDuration":  {
                                                  "Ticks":  180000000000,
                                                  "Days":  0,
                                                  "Hours":  5,
                                                  "Milliseconds":  0,
                                                  "Minutes":  0,
                                                  "Seconds":  0,
                                                  "TotalDays":  0.20833333333333331,
                                                  "TotalHours":  5,
                                                  "TotalMilliseconds":  18000000,
                                                  "TotalMinutes":  300,
                                                  "TotalSeconds":  18000
                                              },
    "GroupingConfigurationMatchingMethod":  {

                                            },
    "GroupingConfigurationReopenClosedIncident":  false,
    "Id":  "/subscriptions/5cfeafdb-fc6b-4d09-971d-3320c5ec14a0/resourceGroups/Training_Jordan/providers/Microsoft.OperationalInsights/workspaces/AcmeSentinel/providers/Microsoft.SecurityInsights/alertRules/3ad8db0f-9208-42f8-a0ed-1de8f50b0d04",
    "IncidentConfigurationCreateIncident":  true,
    "Kind":  {

             },
    "LastModifiedUtc":  "\/Date(1723466723696)\/",
    "Name":  "3ad8db0f-9208-42f8-a0ed-1de8f50b0d04",
    "Query":  "let known_locations = (SigninLogs\r\n    | where TimeGenerated between(ago(14d) .. ago(1h))\r\n    | where ResultType == 0\r\n    | extend LocationDetail = strcat(Location, \"-\", LocationDetails.state)\r\n    | summarize by LocationDetail);\r\nlet AnomalousSignIn = SigninLogs\r\n| where TimeGenerated \u003e ago(1h) // CHANGE IT DEPENDING ON RULE FREQUENCY\r\n| where ResultType != 50126 and ResultType != 50053\r\n| where isnotempty(Location) and isnotempty(LocationDetails.state)\r\n| extend AnomalousLocationDetail = strcat(Location, \"-\", LocationDetails.state)\r\n| where AnomalousLocationDetail !in (known_locations);\r\nlet ManagedAttempts = SigninLogs\r\n| union AADNonInteractiveUserSignInLogs\r\n| where TimeGenerated \u003e ago(14d)\r\n| where (tostring( parse_json(DeviceDetail_dynamic).trustType) != \"\" or tostring( parse_json(DeviceDetail_string).trustType) != \"\") or (DeviceDetail_dynamic or DeviceDetail_string contains \"PII Removed\")\r\n| distinct IPAddress;\r\nlet UserKnownLocations = SigninLogs\r\n| where TimeGenerated between(ago(14d) .. ago(1h))\r\n| where ResultType == 0\r\n| extend LocationState = strcat(Location, \"-\", LocationDetails.state)\r\n| summarize UserKnownStates = make_set(LocationState), UserKnownCountries = make_set(Location) by UserPrincipalName;\r\nAnomalousSignIn\r\n| join kind=leftouter UserKnownLocations on UserPrincipalName\r\n| summarize Device = make_set(DeviceDetail),ClientApp =make_set(ClientAppUsed),Set_Result = make_set(ResultType),Set_Status = make_set(Status),Applications = make_set(AppDisplayName),RiskType = make_set(RiskEventTypes),RiskTypeV2 = make_set(RiskEventTypes_V2),UserAgent = make_set(UserAgent),TimeGenerated = min(TimeGenerated),NormalStatesfrom2weeks = make_set(UserKnownStates),NormalCountriesfrom2weeks = make_set(UserKnownCountries) ,AuthDetails = make_set(AuthenticationDetails) by UserPrincipalName,IPAddress,AnomalousLocationDetail,Location\r\n| join kind=leftanti ManagedAttempts on IPAddress\r\n| project-reorder\r\n    TimeGenerated,\r\n    UserPrincipalName,\r\n    IPAddress,\r\n    AnomalousLocationDetail,\r\n    Location,\r\n    NormalStatesfrom2weeks,\r\n    NormalCountriesfrom2weeks,\r\n    Set_Result,\r\n    Set_Status,\r\n    AuthDetails,\r\n    Applications,\r\n    Device,\r\n    ClientApp,\r\n    UserAgent,\r\n    RiskType,\r\n    RiskTypeV2\r\n| where NormalCountriesfrom2weeks has Location",
    "QueryFrequency":  {
                           "Ticks":  36000000000,
                           "Days":  0,
                           "Hours":  1,
                           "Milliseconds":  0,
                           "Minutes":  0,
                           "Seconds":  0,
                           "TotalDays":  0.041666666666666664,
                           "TotalHours":  1,
                           "TotalMilliseconds":  3600000,
                           "TotalMinutes":  60,
                           "TotalSeconds":  3600
                       },
    "QueryPeriod":  {
                        "Ticks":  12096000000000,
                        "Days":  14,
                        "Hours":  0,
                        "Milliseconds":  0,
                        "Minutes":  0,
                        "Seconds":  0,
                        "TotalDays":  14,
                        "TotalHours":  336,
                        "TotalMilliseconds":  1209600000,
                        "TotalMinutes":  20160,
                        "TotalSeconds":  1209600
                    },
    "Severity":  {

                 },
    "SuppressionDuration":  {
                                "Ticks":  180000000000,
                                "Days":  0,
                                "Hours":  5,
                                "Milliseconds":  0,
                                "Minutes":  0,
                                "Seconds":  0,
                                "TotalDays":  0.20833333333333331,
                                "TotalHours":  5,
                                "TotalMilliseconds":  18000000,
                                "TotalMinutes":  300,
                                "TotalSeconds":  18000
                            },
    "SuppressionEnabled":  false,
    "SystemData":  {
                       "CreatedAt":  null,
                       "CreatedBy":  null,
                       "CreatedByType":  null,
                       "LastModifiedAt":  null,
                       "LastModifiedBy":  null,
                       "LastModifiedByType":  null
                   },
    "SystemDataCreatedAt":  null,
    "SystemDataCreatedBy":  null,
    "SystemDataCreatedByType":  null,
    "SystemDataLastModifiedAt":  null,
    "SystemDataLastModifiedBy":  null,
    "SystemDataLastModifiedByType":  null,
    "Tactic":  [
                   {

                   },
                   {

                   }
               ],
    "TemplateVersion":  null,
    "TriggerOperator":  {

                        },
    "TriggerThreshold":  0,
    "Type":  "Microsoft.SecurityInsights/alertRules"
}