{
    "contentVersion":  "1.0.0.0",
    "$schema":  "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "resources":  [
                      {
                          "id":  "[concat(resourceId(\u0027Microsoft.OperationalInsights/workspaces/providers\u0027, parameters(\u0027workspace\u0027), \u0027Microsoft.SecurityInsights\u0027),\u0027/alertRules/cf0472dc-f3ca-47bc-87ae-0f0ee8301da5\u0027)]",
                          "name":  "[concat(parameters(\u0027workspace\u0027),\u0027/Microsoft.SecurityInsights/cf0472dc-f3ca-47bc-87ae-0f0ee8301da5\u0027)]",
                          "type":  "Microsoft.OperationalInsights/workspaces/providers/alertRules",
                          "kind":  "Scheduled",
                          "apiVersion":  "2023-12-01-preview",
                          "properties":  {
                                             "displayName":  "Authentication Methods Changed for an Account Followed by a Password Reset",
                                             "description":  "Detects a new authentication method followed by a password reset",
                                             "severity":  "Low",
                                             "enabled":  true,
                                             "query":  "let registernewmethod = AuditLogs\r\n| where ActivityDisplayName contains \"User registered\"\r\n| where ResultReason in (\"User registered Outlook mobile with Code\",\"User registered Mobile Phone SMS\",\"User registered Authenticator App with Code\")\r\n| extend userUPN = tostring(TargetResources[0].userPrincipalName)\r\n| extend registermethodtime = TimeGenerated;\r\nlet passwordreset = AuditLogs\r\n| where ActivityDisplayName contains \"Change user password\"\r\n| extend userUPN = tostring(TargetResources[0].userPrincipalName)\r\n| extend pswdchangetime = TimeGenerated;\r\nregisternewmethod\r\n| join kind=inner passwordreset on userUPN\r\n| where pswdchangetime \u003e registermethodtime\r\n| project TimeGenerated,userUPN,registermethodtime,pswdchangetime,OperationName,ResultReason,InitiatedBy,Result,OperationName1,InitiatedBy1,Result1\r\n",
                                             "queryFrequency":  "PT3H",
                                             "queryPeriod":  "PT3H",
                                             "triggerOperator":  "GreaterThan",
                                             "triggerThreshold":  0,
                                             "suppressionDuration":  "PT5H",
                                             "suppressionEnabled":  false,
                                             "startTimeUtc":  null,
                                             "tactics":  [
                                                             "InitialAccess"
                                                         ],
                                             "techniques":  [

                                                            ],
                                             "subTechniques":  [

                                                               ],
                                             "alertRuleTemplateName":  null,
                                             "incidentConfiguration":  {
                                                                           "createIncident":  true,
                                                                           "groupingConfiguration":  {
                                                                                                         "enabled":  true,
                                                                                                         "reopenClosedIncident":  false,
                                                                                                         "lookbackDuration":  "PT5H",
                                                                                                         "matchingMethod":  "AllEntities",
                                                                                                         "groupByEntities":  [

                                                                                                                             ],
                                                                                                         "groupByAlertDetails":  [

                                                                                                                                 ],
                                                                                                         "groupByCustomDetails":  [

                                                                                                                                  ]
                                                                                                     }
                                                                       },
                                             "eventGroupingSettings":  {
                                                                           "aggregationKind":  "SingleAlert"
                                                                       },
                                             "alertDetailsOverride":  null,
                                             "customDetails":  null,
                                             "entityMappings":  [
                                                                    {
                                                                        "entityType":  "Account",
                                                                        "fieldMappings":  [
                                                                                              {
                                                                                                  "identifier":  "FullName",
                                                                                                  "columnName":  "userUPN"
                                                                                              }
                                                                                          ]
                                                                    }
                                                                ],
                                             "sentinelEntitiesMappings":  null,
                                             "templateVersion":  null
                                         }
                      }
                  ],
    "parameters":  {
                       "workspace":  {
                                         "type":  "String"
                                     }
                   }
}