{
    "AlertDetailOverrideAlertDescriptionFormat":  null,
    "AlertDetailOverrideAlertDisplayNameFormat":  "Failed Brute Force Attacks from {{{UserPrincipalName}} ",
    "AlertDetailOverrideAlertSeverityColumnName":  null,
    "AlertDetailOverrideAlertTacticsColumnName":  null,
    "AlertRuleTemplateName":  null,
    "CustomDetail":  {

                     },
    "Description":  "Brute Force Attempt for failed logins",
    "DisplayName":  "Kylene Naiomi Bondoc Brute Force Attack",
    "Enabled":  true,
    "EntityMapping":  null,
    "Etag":  "\"3c00395a-0000-1100-0000-67a022240000\"",
    "EventGroupingSettingAggregationKind":  {

                                            },
    "GroupingConfigurationEnabled":  false,
    "GroupingConfigurationGroupByAlertDetail":  [

                                                ],
    "GroupingConfigurationGroupByCustomDetail":  [

                                                 ],
    "GroupingConfigurationGroupByEntity":  [

                                           ],
    "GroupingConfigurationLookbackDuration":  {
                                                  "Ticks":  180000000000,
                                                  "Days":  0,
                                                  "Hours":  5,
                                                  "Milliseconds":  0,
                                                  "Minutes":  0,
                                                  "Seconds":  0,
                                                  "TotalDays":  0.20833333333333331,
                                                  "TotalHours":  5,
                                                  "TotalMilliseconds":  18000000,
                                                  "TotalMinutes":  300,
                                                  "TotalSeconds":  18000
                                              },
    "GroupingConfigurationMatchingMethod":  {

                                            },
    "GroupingConfigurationReopenClosedIncident":  false,
    "Id":  "/subscriptions/5cfeafdb-fc6b-4d09-971d-3320c5ec14a0/resourceGroups/training_jordan/providers/Microsoft.OperationalInsights/workspaces/acmesentinel/providers/Microsoft.SecurityInsights/alertRules/a4767908-4f55-438e-a017-9eeb128ac4a4",
    "IncidentConfigurationCreateIncident":  true,
    "Kind":  {

             },
    "LastModifiedUtc":  "\/Date(1738547747612)\/",
    "Name":  "a4767908-4f55-438e-a017-9eeb128ac4a4",
    "Query":  "SigninLogs\r\n| where ResultType == \"50053\"\r\n| summarize MinTime = min(TimeGenerated), MaxTime = max(TimeGenerated), IPAddresses = make_set(IPAddress),\r\n        Locations = make_set(Location), Results = make_set(ResultDescription) by UserPrincipalName\r\n| union SigninLogs\r\n| join kind=inner (SigninLogs\r\n| where ResultType == \"50126\"\r\n| summarize UserCount = count() by UserPrincipalName\r\n| where UserCount \u003e= 2) on UserPrincipalName\r\n| where ResultType == \"50126\"\r\n| summarize MinTime = min(TimeGenerated), MaxTime = max(TimeGenerated), IPAddresses = make_set(IPAddress),\r\n        Locations = make_set(Location), Results = make_set(ResultDescription) by UserPrincipalName",
    "QueryFrequency":  {
                           "Ticks":  180000000000,
                           "Days":  0,
                           "Hours":  5,
                           "Milliseconds":  0,
                           "Minutes":  0,
                           "Seconds":  0,
                           "TotalDays":  0.20833333333333331,
                           "TotalHours":  5,
                           "TotalMilliseconds":  18000000,
                           "TotalMinutes":  300,
                           "TotalSeconds":  18000
                       },
    "QueryPeriod":  {
                        "Ticks":  180000000000,
                        "Days":  0,
                        "Hours":  5,
                        "Milliseconds":  0,
                        "Minutes":  0,
                        "Seconds":  0,
                        "TotalDays":  0.20833333333333331,
                        "TotalHours":  5,
                        "TotalMilliseconds":  18000000,
                        "TotalMinutes":  300,
                        "TotalSeconds":  18000
                    },
    "Severity":  {

                 },
    "SuppressionDuration":  {
                                "Ticks":  180000000000,
                                "Days":  0,
                                "Hours":  5,
                                "Milliseconds":  0,
                                "Minutes":  0,
                                "Seconds":  0,
                                "TotalDays":  0.20833333333333331,
                                "TotalHours":  5,
                                "TotalMilliseconds":  18000000,
                                "TotalMinutes":  300,
                                "TotalSeconds":  18000
                            },
    "SuppressionEnabled":  false,
    "SystemData":  {
                       "CreatedAt":  null,
                       "CreatedBy":  null,
                       "CreatedByType":  null,
                       "LastModifiedAt":  null,
                       "LastModifiedBy":  null,
                       "LastModifiedByType":  null
                   },
    "SystemDataCreatedAt":  null,
    "SystemDataCreatedBy":  null,
    "SystemDataCreatedByType":  null,
    "SystemDataLastModifiedAt":  null,
    "SystemDataLastModifiedBy":  null,
    "SystemDataLastModifiedByType":  null,
    "Tactic":  [
                   {

                   }
               ],
    "TemplateVersion":  null,
    "TriggerOperator":  {

                        },
    "TriggerThreshold":  0,
    "Type":  "Microsoft.SecurityInsights/alertRules"
}