{
    "contentVersion":  "1.0.0.0",
    "$schema":  "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "resources":  [
                      {
                          "id":  "[concat(resourceId(\u0027Microsoft.OperationalInsights/workspaces/providers\u0027, parameters(\u0027workspace\u0027), \u0027Microsoft.SecurityInsights\u0027),\u0027/alertRules/695811b8-2136-4445-a3b2-0254c182d3ff\u0027)]",
                          "name":  "[concat(parameters(\u0027workspace\u0027),\u0027/Microsoft.SecurityInsights/695811b8-2136-4445-a3b2-0254c182d3ff\u0027)]",
                          "type":  "Microsoft.OperationalInsights/workspaces/providers/alertRules",
                          "kind":  "Scheduled",
                          "apiVersion":  "2023-12-01-preview",
                          "properties":  {
                                             "displayName":  "MFA registration followed by Password Reset ",
                                             "description":  "Detects when a user registers MFA details on their account and then completes self service password reset with a short timeframe",
                                             "severity":  "Medium",
                                             "enabled":  true,
                                             "query":  "//Detects when a user registers MFA details on their account and then completes self service password reset with a short timeframe\r\n//Data connector required for this query - Azure Active Directory - Signin Logs\r\n//Data connector required for this query - Azure Active Directory - Audit Logs\r\nlet timeframe=4h;\r\nAuditLogs\r\n| where TimeGenerated \u003e ago(1d)\r\n| where OperationName in (\"User changed default security info\", \"User registered all required security info\", \"User registered security info\")\r\n| extend User = tostring(TargetResources[0].userPrincipalName)\r\n| project SecurityInfoTime=TimeGenerated, User, OperationName\r\n| join kind=inner (\r\n    AuditLogs\r\n    | where TimeGenerated \u003e ago(1d)\r\n    | where OperationName in (\"Reset password (self-service)\", \"Change password (self-service)\")\r\n    | where Result == \"success\"\r\n    | extend User = tostring(TargetResources[0].userPrincipalName)\r\n    | project PasswordResetTime=TimeGenerated, OperationName, User)\r\n    on User\r\n| where (PasswordResetTime - SecurityInfoTime) between (0min .. timeframe)",
                                             "queryFrequency":  "PT15M",
                                             "queryPeriod":  "PT15M",
                                             "triggerOperator":  "GreaterThan",
                                             "triggerThreshold":  0,
                                             "suppressionDuration":  "PT5H",
                                             "suppressionEnabled":  false,
                                             "startTimeUtc":  null,
                                             "tactics":  [
                                                             "InitialAccess",
                                                             "Persistence"
                                                         ],
                                             "techniques":  [

                                                            ],
                                             "subTechniques":  [

                                                               ],
                                             "alertRuleTemplateName":  null,
                                             "incidentConfiguration":  {
                                                                           "createIncident":  true,
                                                                           "groupingConfiguration":  {
                                                                                                         "enabled":  false,
                                                                                                         "reopenClosedIncident":  false,
                                                                                                         "lookbackDuration":  "PT5H",
                                                                                                         "matchingMethod":  "AllEntities",
                                                                                                         "groupByEntities":  [

                                                                                                                             ],
                                                                                                         "groupByAlertDetails":  [

                                                                                                                                 ],
                                                                                                         "groupByCustomDetails":  [

                                                                                                                                  ]
                                                                                                     }
                                                                       },
                                             "eventGroupingSettings":  {
                                                                           "aggregationKind":  "SingleAlert"
                                                                       },
                                             "alertDetailsOverride":  null,
                                             "customDetails":  null,
                                             "entityMappings":  [
                                                                    {
                                                                        "entityType":  "Account",
                                                                        "fieldMappings":  [
                                                                                              {
                                                                                                  "identifier":  "FullName",
                                                                                                  "columnName":  "User"
                                                                                              }
                                                                                          ]
                                                                    },
                                                                    {
                                                                        "entityType":  "Host",
                                                                        "fieldMappings":  [
                                                                                              {
                                                                                                  "identifier":  "HostName",
                                                                                                  "columnName":  "User"
                                                                                              }
                                                                                          ]
                                                                    }
                                                                ],
                                             "sentinelEntitiesMappings":  null,
                                             "templateVersion":  null
                                         }
                      }
                  ],
    "parameters":  {
                       "workspace":  {
                                         "type":  "String"
                                     }
                   }
}