{
    "contentVersion":  "1.0.0.0",
    "$schema":  "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "resources":  [
                      {
                          "id":  "[concat(resourceId(\u0027Microsoft.OperationalInsights/workspaces/providers\u0027, parameters(\u0027workspace\u0027), \u0027Microsoft.SecurityInsights\u0027),\u0027/alertRules/ca8a4d77-e0da-4ba2-a453-72235a5dd33d\u0027)]",
                          "name":  "[concat(parameters(\u0027workspace\u0027),\u0027/Microsoft.SecurityInsights/ca8a4d77-e0da-4ba2-a453-72235a5dd33d\u0027)]",
                          "type":  "Microsoft.OperationalInsights/workspaces/providers/alertRules",
                          "kind":  "Scheduled",
                          "apiVersion":  "2023-12-01-preview",
                          "properties":  {
                                             "displayName":  "MFA Repeated Requests",
                                             "description":  "This rule checks for MFA abuse to a user where an attacker may have compromised/phished the credentials and will then keep sending MFA requests, hoping the user accepts. ",
                                             "severity":  "High",
                                             "enabled":  true,
                                             "query":  "let timeRange = 1h;\r\nlet MaxAllowedTimes = 25;\r\nlet TargetUser = SigninLogs\r\n| where TimeGenerated \u003e ago(timeRange)\r\n| where ResultType == 500121\r\n| summarize FailedLogonCounter=count() by UserPrincipalName,IPAddress\r\n| where FailedLogonCounter \u003e= MaxAllowedTimes;\r\nlet ManagedAttempts = SigninLogs\r\n| union AADNonInteractiveUserSignInLogs\r\n| where TimeGenerated \u003e ago(14d)\r\n| where (tostring( parse_json(DeviceDetail_dynamic).trustType) != \"\" or tostring( parse_json(DeviceDetail_string).trustType) != \"\") or (DeviceDetail_dynamic or DeviceDetail_string contains \"PII Removed\")\r\n| summarize IPManagedAttempts = count() by IPAddress;\r\nSigninLogs\r\n| join kind=inner TargetUser on UserPrincipalName,IPAddress\r\n| project-away UserPrincipalName1,IPAddress1\r\n| summarize Device = make_set(DeviceDetail),ClientApp =make_set(ClientAppUsed),Set_Result = make_set(ResultType),Set_Status = make_set(Status),Applications = make_set(AppDisplayName),RiskType = make_set(RiskEventTypes),RiskTypeV2 = make_set(RiskEventTypes_V2),UserAgent = make_set(UserAgent),Time = make_set(TimeGenerated,1),AccessedLocation = make_set(LocationDetails), AuthDetails = make_set(AuthenticationDetails) by UserPrincipalName,IPAddress\r\n| join kind=leftouter ManagedAttempts on IPAddress\r\n| extend IPManagedAttempts = coalesce(IPManagedAttempts,0)\r\n| project-reorder Time,UserPrincipalName,IPAddress,AccessedLocation,Set_Result,Set_Status,AuthDetails,Applications,Device,ClientApp,UserAgent,RiskType,RiskTypeV2,IPManagedAttempts\r\n| where IPManagedAttempts == 0",
                                             "queryFrequency":  "PT1H",
                                             "queryPeriod":  "P14D",
                                             "triggerOperator":  "GreaterThan",
                                             "triggerThreshold":  0,
                                             "suppressionDuration":  "PT5H",
                                             "suppressionEnabled":  false,
                                             "startTimeUtc":  null,
                                             "tactics":  [
                                                             "CredentialAccess"
                                                         ],
                                             "techniques":  [
                                                                "T1110"
                                                            ],
                                             "subTechniques":  [

                                                               ],
                                             "alertRuleTemplateName":  null,
                                             "incidentConfiguration":  {
                                                                           "createIncident":  true,
                                                                           "groupingConfiguration":  {
                                                                                                         "enabled":  true,
                                                                                                         "reopenClosedIncident":  false,
                                                                                                         "lookbackDuration":  "PT5H",
                                                                                                         "matchingMethod":  "AllEntities",
                                                                                                         "groupByEntities":  [

                                                                                                                             ],
                                                                                                         "groupByAlertDetails":  [

                                                                                                                                 ],
                                                                                                         "groupByCustomDetails":  [

                                                                                                                                  ]
                                                                                                     }
                                                                       },
                                             "eventGroupingSettings":  {
                                                                           "aggregationKind":  "SingleAlert"
                                                                       },
                                             "alertDetailsOverride":  null,
                                             "customDetails":  null,
                                             "entityMappings":  [
                                                                    {
                                                                        "entityType":  "Account",
                                                                        "fieldMappings":  [
                                                                                              {
                                                                                                  "identifier":  "FullName",
                                                                                                  "columnName":  "UserPrincipalName"
                                                                                              }
                                                                                          ]
                                                                    },
                                                                    {
                                                                        "entityType":  "IP",
                                                                        "fieldMappings":  [
                                                                                              {
                                                                                                  "identifier":  "Address",
                                                                                                  "columnName":  "IPAddress"
                                                                                              }
                                                                                          ]
                                                                    }
                                                                ],
                                             "sentinelEntitiesMappings":  null,
                                             "templateVersion":  null
                                         }
                      }
                  ],
    "parameters":  {
                       "workspace":  {
                                         "type":  "String"
                                     }
                   }
}