{
    "AlertDetailOverrideAlertDescriptionFormat":  null,
    "AlertDetailOverrideAlertDisplayNameFormat":  null,
    "AlertDetailOverrideAlertSeverityColumnName":  null,
    "AlertDetailOverrideAlertTacticsColumnName":  null,
    "AlertRuleTemplateName":  null,
    "CustomDetail":  {

                     },
    "Description":  "This rule detects when a user has reported MFA fraud (saying that they did not initiate this MFA prompt).\nIf this rule triggers, please make sure to escalate the alert to the customer.",
    "DisplayName":  "MFA Fraud Alert generated by User [WC- Azure]",
    "Enabled":  true,
    "EntityMapping":  [
                          {
                              "EntityType":  {

                                             },
                              "FieldMapping":  [
                                                   {
                                                       "ColumnName":  "UserPrincipalName",
                                                       "Identifier":  "Name"
                                                   }
                                               ]
                          }
                      ],
    "Etag":  "\"9c0476f6-0000-1100-0000-66caed0d0000\"",
    "EventGroupingSettingAggregationKind":  {

                                            },
    "GroupingConfigurationEnabled":  true,
    "GroupingConfigurationGroupByAlertDetail":  [

                                                ],
    "GroupingConfigurationGroupByCustomDetail":  [

                                                 ],
    "GroupingConfigurationGroupByEntity":  [

                                           ],
    "GroupingConfigurationLookbackDuration":  {
                                                  "Ticks":  9000000000,
                                                  "Days":  0,
                                                  "Hours":  0,
                                                  "Milliseconds":  0,
                                                  "Minutes":  15,
                                                  "Seconds":  0,
                                                  "TotalDays":  0.010416666666666666,
                                                  "TotalHours":  0.25,
                                                  "TotalMilliseconds":  900000,
                                                  "TotalMinutes":  15,
                                                  "TotalSeconds":  900
                                              },
    "GroupingConfigurationMatchingMethod":  {

                                            },
    "GroupingConfigurationReopenClosedIncident":  false,
    "Id":  "/subscriptions/5cfeafdb-fc6b-4d09-971d-3320c5ec14a0/resourceGroups/training_jordan/providers/Microsoft.OperationalInsights/workspaces/acmesentinel/providers/Microsoft.SecurityInsights/alertRules/f48aeb03-b7a4-4d5c-9485-d174b2551d70",
    "IncidentConfigurationCreateIncident":  true,
    "Kind":  {

             },
    "LastModifiedUtc":  "\/Date(1724574986873)\/",
    "Name":  "f48aeb03-b7a4-4d5c-9485-d174b2551d70",
    "Query":  "let fraudAlertsFromAuditLogs = AuditLogs\r\n| where ActivityDisplayName contains  \"Fraud Reported\"\r\n| project TimeGenerated, UserPrincipalName = tostring(parse_json(InitiatedBy.user).userPrincipalName), AuthenticationMethod = tostring(parse_json(AdditionalDetails[0]).value),Activity = ActivityDisplayName;\r\nlet fraudAlertsFromSignInLogs = SigninLogs\r\n| where ResultType == 500121 and Status contains \"Fraud\"\r\n| project TimeGenerated, UserPrincipalName, IPAddress, Location, AppDisplayName, DeviceDetail, FraudStatus = Status;\r\nlet allFraudAlerts = union fraudAlertsFromAuditLogs, fraudAlertsFromSignInLogs;\r\nlet UserInfo = SigninLogs\r\n| project TimeGenerated, UserPrincipalName, IPAddress, Location, AppDisplayName, ClientAppUsed, DeviceDetail\r\n| summarize IPAddresses = make_set(IPAddress), AppsUsed = make_set(AppDisplayName), Locations = make_set(Location), Devices = make_set(DeviceDetail) by TimeGenerated, UserPrincipalName;\r\nallFraudAlerts\r\n| join kind=leftouter (UserInfo) on $left.UserPrincipalName == $right.UserPrincipalName\r\n| extend Time = format_datetime(TimeGenerated, \u0027yyyy-MM-dd HH\u0027)\r\n| summarize TimeGenerated = arg_max(TimeGenerated, *) , AuthenticationMethod = arg_max(AuthenticationMethod, *), IPAddresses = make_set(IPAddresses), AppsUsed = make_set(AppsUsed), Locations = make_set(Locations), Devices = make_set(Devices), AuditActivity = make_set(Activity), SigninActivity = make_set(FraudStatus) by UserPrincipalName, Time\r\n| project TimeGenerated,UserPrincipalName,AuditActivity,SigninActivity,AuthenticationMethod, IPAddresses, AppsUsed, Locations, Devices\r\n",
    "QueryFrequency":  {
                           "Ticks":  9000000000,
                           "Days":  0,
                           "Hours":  0,
                           "Milliseconds":  0,
                           "Minutes":  15,
                           "Seconds":  0,
                           "TotalDays":  0.010416666666666666,
                           "TotalHours":  0.25,
                           "TotalMilliseconds":  900000,
                           "TotalMinutes":  15,
                           "TotalSeconds":  900
                       },
    "QueryPeriod":  {
                        "Ticks":  9000000000,
                        "Days":  0,
                        "Hours":  0,
                        "Milliseconds":  0,
                        "Minutes":  15,
                        "Seconds":  0,
                        "TotalDays":  0.010416666666666666,
                        "TotalHours":  0.25,
                        "TotalMilliseconds":  900000,
                        "TotalMinutes":  15,
                        "TotalSeconds":  900
                    },
    "Severity":  {

                 },
    "SuppressionDuration":  {
                                "Ticks":  180000000000,
                                "Days":  0,
                                "Hours":  5,
                                "Milliseconds":  0,
                                "Minutes":  0,
                                "Seconds":  0,
                                "TotalDays":  0.20833333333333331,
                                "TotalHours":  5,
                                "TotalMilliseconds":  18000000,
                                "TotalMinutes":  300,
                                "TotalSeconds":  18000
                            },
    "SuppressionEnabled":  false,
    "SystemData":  {
                       "CreatedAt":  null,
                       "CreatedBy":  null,
                       "CreatedByType":  null,
                       "LastModifiedAt":  null,
                       "LastModifiedBy":  null,
                       "LastModifiedByType":  null
                   },
    "SystemDataCreatedAt":  null,
    "SystemDataCreatedBy":  null,
    "SystemDataCreatedByType":  null,
    "SystemDataLastModifiedAt":  null,
    "SystemDataLastModifiedBy":  null,
    "SystemDataLastModifiedByType":  null,
    "Tactic":  [
                   {

                   },
                   {

                   }
               ],
    "TemplateVersion":  null,
    "TriggerOperator":  {

                        },
    "TriggerThreshold":  0,
    "Type":  "Microsoft.SecurityInsights/alertRules"
}