{
    "AlertDetailOverrideAlertDescriptionFormat":  null,
    "AlertDetailOverrideAlertDisplayNameFormat":  null,
    "AlertDetailOverrideAlertSeverityColumnName":  null,
    "AlertDetailOverrideAlertTacticsColumnName":  null,
    "AlertRuleTemplateName":  null,
    "CustomDetail":  {

                     },
    "Description":  "A new device (excluding iOS devices) has been added into the Azure Active Directory environment and is required for confirmation as such devices may be considered rogue if not authorised for enrolment.",
    "DisplayName":  "New Device Added - [WC-AZURE]",
    "Enabled":  true,
    "EntityMapping":  [
                          {
                              "EntityType":  {

                                             },
                              "FieldMapping":  [
                                                   {
                                                       "ColumnName":  "DeviceName",
                                                       "Identifier":  "FullName"
                                                   }
                                               ]
                          }
                      ],
    "Etag":  "\"9d046c0d-0000-1100-0000-66caed5f0000\"",
    "EventGroupingSettingAggregationKind":  {

                                            },
    "GroupingConfigurationEnabled":  true,
    "GroupingConfigurationGroupByAlertDetail":  [

                                                ],
    "GroupingConfigurationGroupByCustomDetail":  [

                                                 ],
    "GroupingConfigurationGroupByEntity":  [

                                           ],
    "GroupingConfigurationLookbackDuration":  {
                                                  "Ticks":  180000000000,
                                                  "Days":  0,
                                                  "Hours":  5,
                                                  "Milliseconds":  0,
                                                  "Minutes":  0,
                                                  "Seconds":  0,
                                                  "TotalDays":  0.20833333333333331,
                                                  "TotalHours":  5,
                                                  "TotalMilliseconds":  18000000,
                                                  "TotalMinutes":  300,
                                                  "TotalSeconds":  18000
                                              },
    "GroupingConfigurationMatchingMethod":  {

                                            },
    "GroupingConfigurationReopenClosedIncident":  false,
    "Id":  "/subscriptions/5cfeafdb-fc6b-4d09-971d-3320c5ec14a0/resourceGroups/training_jordan/providers/Microsoft.OperationalInsights/workspaces/acmesentinel/providers/Microsoft.SecurityInsights/alertRules/f472b0b4-ee4b-4008-8378-c73df66b36af",
    "IncidentConfigurationCreateIncident":  true,
    "Kind":  {

             },
    "LastModifiedUtc":  "\/Date(1724575069878)\/",
    "Name":  "f472b0b4-ee4b-4008-8378-c73df66b36af",
    "Query":  "AuditLogs\r\n| where OperationName contains \"Add device\"\r\n| extend DeviceID = tostring(parse_json(tostring(parse_json(tostring(TargetResources[0].modifiedProperties))[6].newValue))[0])\r\n| extend DeviceName = tostring(parse_json(tostring(parse_json(tostring(TargetResources[0].modifiedProperties))[10].newValue))[0])\r\n| extend DisplayName = tostring(TargetResources[0].displayName)\r\n| extend TimestampAddDevice = TimeGenerated\r\n// | project DeviceID, OperationVersion, DeviceName, DisplayName, TimestampAddDevice\r\n| join kind=inner\r\n    (\r\n    AuditLogs\r\n    | where OperationName contains \"Register device\"\r\n    | extend UPN = tostring(parse_json(tostring(InitiatedBy.user)).userPrincipalName)\r\n    | extend DeviceID = tostring(AdditionalDetails[4].value)\r\n    | extend TimestampRegisterDevice = TimeGenerated\r\n    | extend IPAddress = tostring(parse_json(tostring(InitiatedBy.user)).ipAddress)\r\n    | extend OS = tostring(AdditionalDetails[3].value)\r\n    | extend AdditionalInfo = tostring(AdditionalDetails[0].value)\r\n    // | project DeviceID, OperationVersion, UPN, TimestampRegisterDevice, IPAddress, OS, AdditionalInfo\r\n    ) on DeviceID\r\n// | project TimestampAddDevice, TimestampRegisterDevice, DeviceName, DeviceID, UPN, DisplayName, IPAddress, OS, AdditionalInfo\r\n| extend CustomEntity = strcat(\r\n    \"Device Added on: \", format_datetime(TimestampAddDevice, \u0027dd-MM-yyyy hh:mm:ss\u0027),\r\n    \"\\n Device Addition Result: \", Result,\r\n    \"\\nDevice Registered on: \", format_datetime(TimestampRegisterDevice, \u0027dd-MM-yyyy hh:mm:ss\u0027),\r\n    \"\\n Device Registration Result: \", Result1,\r\n    \"\\nDevice Name/User: \", DeviceName,\r\n    \"\\nDevice Display Name: \", DisplayName,\r\n    \"\\nDevice Operating System: \", OS,\r\n    \"\\nInitiated By: \", UPN\r\n    )",
    "QueryFrequency":  {
                           "Ticks":  540000000000,
                           "Days":  0,
                           "Hours":  15,
                           "Milliseconds":  0,
                           "Minutes":  0,
                           "Seconds":  0,
                           "TotalDays":  0.625,
                           "TotalHours":  15,
                           "TotalMilliseconds":  54000000,
                           "TotalMinutes":  900,
                           "TotalSeconds":  54000
                       },
    "QueryPeriod":  {
                        "Ticks":  540000000000,
                        "Days":  0,
                        "Hours":  15,
                        "Milliseconds":  0,
                        "Minutes":  0,
                        "Seconds":  0,
                        "TotalDays":  0.625,
                        "TotalHours":  15,
                        "TotalMilliseconds":  54000000,
                        "TotalMinutes":  900,
                        "TotalSeconds":  54000
                    },
    "Severity":  {

                 },
    "SuppressionDuration":  {
                                "Ticks":  180000000000,
                                "Days":  0,
                                "Hours":  5,
                                "Milliseconds":  0,
                                "Minutes":  0,
                                "Seconds":  0,
                                "TotalDays":  0.20833333333333331,
                                "TotalHours":  5,
                                "TotalMilliseconds":  18000000,
                                "TotalMinutes":  300,
                                "TotalSeconds":  18000
                            },
    "SuppressionEnabled":  false,
    "SystemData":  {
                       "CreatedAt":  null,
                       "CreatedBy":  null,
                       "CreatedByType":  null,
                       "LastModifiedAt":  null,
                       "LastModifiedBy":  null,
                       "LastModifiedByType":  null
                   },
    "SystemDataCreatedAt":  null,
    "SystemDataCreatedBy":  null,
    "SystemDataCreatedByType":  null,
    "SystemDataLastModifiedAt":  null,
    "SystemDataLastModifiedBy":  null,
    "SystemDataLastModifiedByType":  null,
    "Tactic":  [
                   {

                   }
               ],
    "TemplateVersion":  null,
    "TriggerOperator":  {

                        },
    "TriggerThreshold":  0,
    "Type":  "Microsoft.SecurityInsights/alertRules"
}