{
    "AlertDetailOverrideAlertDescriptionFormat":  null,
    "AlertDetailOverrideAlertDisplayNameFormat":  null,
    "AlertDetailOverrideAlertSeverityColumnName":  null,
    "AlertDetailOverrideAlertTacticsColumnName":  null,
    "AlertRuleTemplateName":  null,
    "CustomDetail":  {

                     },
    "Description":  "This rule detects when a user declines the MFA in NRT.",
    "DisplayName":  "NRT MFA Rejected by User - [WC-AZURE]",
    "Enabled":  true,
    "EntityMapping":  [
                          {
                              "EntityType":  {

                                             },
                              "FieldMapping":  [
                                                   {
                                                       "ColumnName":  "UserPrincipalName",
                                                       "Identifier":  "FullName"
                                                   }
                                               ]
                          },
                          {
                              "EntityType":  {

                                             },
                              "FieldMapping":  [
                                                   {
                                                       "ColumnName":  "IPAddress",
                                                       "Identifier":  "Address"
                                                   }
                                               ]
                          },
                          {
                              "EntityType":  {

                                             },
                              "FieldMapping":  [
                                                   {
                                                       "ColumnName":  "Location",
                                                       "Identifier":  "Name"
                                                   }
                                               ]
                          }
                      ],
    "Etag":  "\"9c049bf6-0000-1100-0000-66caed0e0000\"",
    "EventGroupingSettingAggregationKind":  {

                                            },
    "GroupingConfigurationEnabled":  false,
    "GroupingConfigurationGroupByAlertDetail":  [

                                                ],
    "GroupingConfigurationGroupByCustomDetail":  [

                                                 ],
    "GroupingConfigurationGroupByEntity":  [

                                           ],
    "GroupingConfigurationLookbackDuration":  {
                                                  "Ticks":  180000000000,
                                                  "Days":  0,
                                                  "Hours":  5,
                                                  "Milliseconds":  0,
                                                  "Minutes":  0,
                                                  "Seconds":  0,
                                                  "TotalDays":  0.20833333333333331,
                                                  "TotalHours":  5,
                                                  "TotalMilliseconds":  18000000,
                                                  "TotalMinutes":  300,
                                                  "TotalSeconds":  18000
                                              },
    "GroupingConfigurationMatchingMethod":  {

                                            },
    "GroupingConfigurationReopenClosedIncident":  false,
    "Id":  "/subscriptions/5cfeafdb-fc6b-4d09-971d-3320c5ec14a0/resourceGroups/training_jordan/providers/Microsoft.OperationalInsights/workspaces/acmesentinel/providers/Microsoft.SecurityInsights/alertRules/1bf39bb5-2d21-4f2a-8dce-22c9312d7b9e",
    "IncidentConfigurationCreateIncident":  true,
    "Kind":  {

             },
    "LastModifiedUtc":  "\/Date(1724574986816)\/",
    "Name":  "1bf39bb5-2d21-4f2a-8dce-22c9312d7b9e",
    "Query":  "let ManagedAttempts = SigninLogs\r\n| union AADNonInteractiveUserSignInLogs\r\n| where TimeGenerated \u003e ago(47h)\r\n| where (tostring( parse_json(DeviceDetail_dynamic).trustType) != \"\" or tostring( parse_json(DeviceDetail_string).trustType) != \"\") or (DeviceDetail_dynamic or DeviceDetail_string contains \"PII Removed\")\r\n| distinct IPAddress;\r\nSigninLogs\r\n| where TimeGenerated \u003e ago(5m)\r\n| where ResultType == 500121\r\n| where tostring( parse_json(DeviceDetail).trustType) == \"\"\r\n| extend additionalDetails_ = tostring(Status.additionalDetails)\r\n| where additionalDetails_ =~ \"MFA denied; user declined the authentication\"\r\n| join kind=leftanti ManagedAttempts on IPAddress",
    "QueryFrequency":  {
                           "Ticks":  3000000000,
                           "Days":  0,
                           "Hours":  0,
                           "Milliseconds":  0,
                           "Minutes":  5,
                           "Seconds":  0,
                           "TotalDays":  0.003472222222222222,
                           "TotalHours":  0.083333333333333329,
                           "TotalMilliseconds":  300000,
                           "TotalMinutes":  5,
                           "TotalSeconds":  300
                       },
    "QueryPeriod":  {
                        "Ticks":  1692000000000,
                        "Days":  1,
                        "Hours":  23,
                        "Milliseconds":  0,
                        "Minutes":  0,
                        "Seconds":  0,
                        "TotalDays":  1.9583333333333333,
                        "TotalHours":  47,
                        "TotalMilliseconds":  169200000,
                        "TotalMinutes":  2820,
                        "TotalSeconds":  169200
                    },
    "Severity":  {

                 },
    "SuppressionDuration":  {
                                "Ticks":  180000000000,
                                "Days":  0,
                                "Hours":  5,
                                "Milliseconds":  0,
                                "Minutes":  0,
                                "Seconds":  0,
                                "TotalDays":  0.20833333333333331,
                                "TotalHours":  5,
                                "TotalMilliseconds":  18000000,
                                "TotalMinutes":  300,
                                "TotalSeconds":  18000
                            },
    "SuppressionEnabled":  false,
    "SystemData":  {
                       "CreatedAt":  null,
                       "CreatedBy":  null,
                       "CreatedByType":  null,
                       "LastModifiedAt":  null,
                       "LastModifiedBy":  null,
                       "LastModifiedByType":  null
                   },
    "SystemDataCreatedAt":  null,
    "SystemDataCreatedBy":  null,
    "SystemDataCreatedByType":  null,
    "SystemDataLastModifiedAt":  null,
    "SystemDataLastModifiedBy":  null,
    "SystemDataLastModifiedByType":  null,
    "Tactic":  [
                   {

                   }
               ],
    "TemplateVersion":  null,
    "TriggerOperator":  {

                        },
    "TriggerThreshold":  0,
    "Type":  "Microsoft.SecurityInsights/alertRules"
}