{
    "AlertDetailOverrideAlertDescriptionFormat":  null,
    "AlertDetailOverrideAlertDisplayNameFormat":  null,
    "AlertDetailOverrideAlertSeverityColumnName":  null,
    "AlertDetailOverrideAlertTacticsColumnName":  null,
    "AlertRuleTemplateName":  null,
    "CustomDetail":  {

                     },
    "Description":  "Detects potential port scanning activity from a host.",
    "DisplayName":  "Port Scanning",
    "Enabled":  true,
    "EntityMapping":  null,
    "Etag":  "\"190015e8-0000-1100-0000-685aa2080000\"",
    "GroupingConfigurationEnabled":  false,
    "GroupingConfigurationGroupByAlertDetail":  [

                                                ],
    "GroupingConfigurationGroupByCustomDetail":  [

                                                 ],
    "GroupingConfigurationGroupByEntity":  [

                                           ],
    "GroupingConfigurationLookbackDuration":  {
                                                  "Ticks":  180000000000,
                                                  "Days":  0,
                                                  "Hours":  5,
                                                  "Milliseconds":  0,
                                                  "Minutes":  0,
                                                  "Seconds":  0,
                                                  "TotalDays":  0.20833333333333331,
                                                  "TotalHours":  5,
                                                  "TotalMilliseconds":  18000000,
                                                  "TotalMinutes":  300,
                                                  "TotalSeconds":  18000
                                              },
    "GroupingConfigurationMatchingMethod":  {

                                            },
    "GroupingConfigurationReopenClosedIncident":  false,
    "Id":  "/subscriptions/5cfeafdb-fc6b-4d09-971d-3320c5ec14a0/resourceGroups/training_jordan/providers/Microsoft.OperationalInsights/workspaces/acmesentinel/providers/Microsoft.SecurityInsights/alertRules/a80563f9-c67c-4c1b-9f5c-8c1af87fc20c",
    "IncidentConfigurationCreateIncident":  true,
    "Kind":  {

             },
    "LastModifiedUtc":  "\/Date(1750770181918)\/",
    "Name":  "a80563f9-c67c-4c1b-9f5c-8c1af87fc20c",
    "Query":  "DeviceNetworkEvents\r\n| where ActionType == \"ConnectionAttempt\"\r\n| where isnotempty(RemoteIP) \r\n| summarize \r\n    DistinctPorts = dcount(LocalPort), \r\n    StartTime = min(TimeGenerated), \r\n    EndTime = max(TimeGenerated), \r\n    AttemptCount = count(),\r\n    arg_max(TimeGenerated, DeviceId, DeviceName)\r\n    by RemoteIP, bin(TimeGenerated, 5m)\r\n| where DistinctPorts \u003e= 5\r\n| extend ReportId = strcat(\"PortScan_\", DeviceId, \"_\", RemoteIP, \"_\", format_datetime(StartTime, \"yyyyMMddHHmm\"))\r\n| project \r\n    TimeGenerated,DeviceName,RemoteIP,DistinctPorts,StartTime,EndTime,AttemptCount, DeviceId,ReportId\r\n| sort by DistinctPorts desc",
    "Severity":  {

                 },
    "SuppressionDuration":  {
                                "Ticks":  180000000000,
                                "Days":  0,
                                "Hours":  5,
                                "Milliseconds":  0,
                                "Minutes":  0,
                                "Seconds":  0,
                                "TotalDays":  0.20833333333333331,
                                "TotalHours":  5,
                                "TotalMilliseconds":  18000000,
                                "TotalMinutes":  300,
                                "TotalSeconds":  18000
                            },
    "SuppressionEnabled":  false,
    "SystemData":  {
                       "CreatedAt":  null,
                       "CreatedBy":  null,
                       "CreatedByType":  null,
                       "LastModifiedAt":  null,
                       "LastModifiedBy":  null,
                       "LastModifiedByType":  null
                   },
    "SystemDataCreatedAt":  null,
    "SystemDataCreatedBy":  null,
    "SystemDataCreatedByType":  null,
    "SystemDataLastModifiedAt":  null,
    "SystemDataLastModifiedBy":  null,
    "SystemDataLastModifiedByType":  null,
    "Tactic":  [
                   {

                   }
               ],
    "TemplateVersion":  null,
    "Type":  "Microsoft.SecurityInsights/alertRules"
}