{
    "AlertDetailOverrideAlertDescriptionFormat":  null,
    "AlertDetailOverrideAlertDisplayNameFormat":  null,
    "AlertDetailOverrideAlertSeverityColumnName":  null,
    "AlertDetailOverrideAlertTacticsColumnName":  null,
    "AlertRuleTemplateName":  null,
    "CustomDetail":  {

                     },
    "Description":  "This detection identifies potential brute force SSH login attempts by monitoring for more than 10 failed inbound SSH connections from a single IP address within a 5-minute window. Repeated failed login attempts may indicate unauthorized access attempts or credential stuffing.",
    "DisplayName":  "Possible SSH Brute Force",
    "Enabled":  true,
    "EntityMapping":  null,
    "Etag":  "\"8600972a-0000-1100-0000-686688ef0000\"",
    "GroupingConfigurationEnabled":  false,
    "GroupingConfigurationGroupByAlertDetail":  [

                                                ],
    "GroupingConfigurationGroupByCustomDetail":  [

                                                 ],
    "GroupingConfigurationGroupByEntity":  [

                                           ],
    "GroupingConfigurationLookbackDuration":  {
                                                  "Ticks":  180000000000,
                                                  "Days":  0,
                                                  "Hours":  5,
                                                  "Milliseconds":  0,
                                                  "Minutes":  0,
                                                  "Seconds":  0,
                                                  "TotalDays":  0.20833333333333331,
                                                  "TotalHours":  5,
                                                  "TotalMilliseconds":  18000000,
                                                  "TotalMinutes":  300,
                                                  "TotalSeconds":  18000
                                              },
    "GroupingConfigurationMatchingMethod":  {

                                            },
    "GroupingConfigurationReopenClosedIncident":  false,
    "Id":  "/subscriptions/5cfeafdb-fc6b-4d09-971d-3320c5ec14a0/resourceGroups/training_jordan/providers/Microsoft.OperationalInsights/workspaces/acmesentinel/providers/Microsoft.SecurityInsights/alertRules/43b3f545-ce72-43ed-a9df-86f6e544e3fc",
    "IncidentConfigurationCreateIncident":  true,
    "Kind":  {

             },
    "LastModifiedUtc":  "\/Date(1751550190961)\/",
    "Name":  "43b3f545-ce72-43ed-a9df-86f6e544e3fc",
    "Query":  "DeviceNetworkEvents\r\n| where ActionType == \"SshConnectionInspected\" and RemotePort == 22\r\n| extend fields = parse_json(AdditionalFields)\r\n| extend \r\n    direction = tostring(fields.direction),\r\n    auth_attempts = toint(fields.auth_attempts),\r\n    auth_success = tostring(fields.auth_success)\r\n| where direction == \"In\"\r\n| extend TimeWindow = bin(TimeGenerated, 5m)\r\n| summarize\r\n    FailedAttempts = countif(auth_success == \"false\"),\r\n    SuccessfulAttempts = countif(auth_success == \"true\"),\r\n    FirstSeen = min(TimeGenerated),\r\n    LastSeen = max(TimeGenerated),\r\n    TimeGenerated = arg_max(TimeGenerated, DeviceId, ReportId)\r\n    by TimeWindow, RemoteIP, LocalIP, DeviceName\r\n| where FailedAttempts \u003e 10\r\n| extend AttackOutcome = case(SuccessfulAttempts \u003e 0, \"Success\", \"Failure\")\r\n| project TimeGenerated, RemoteIP, LocalIP, DeviceName, FailedAttempts, SuccessfulAttempts, AttackOutcome, FirstSeen, LastSeen, DeviceId, ReportId",
    "Severity":  {

                 },
    "SuppressionDuration":  {
                                "Ticks":  180000000000,
                                "Days":  0,
                                "Hours":  5,
                                "Milliseconds":  0,
                                "Minutes":  0,
                                "Seconds":  0,
                                "TotalDays":  0.20833333333333331,
                                "TotalHours":  5,
                                "TotalMilliseconds":  18000000,
                                "TotalMinutes":  300,
                                "TotalSeconds":  18000
                            },
    "SuppressionEnabled":  false,
    "SystemData":  {
                       "CreatedAt":  null,
                       "CreatedBy":  null,
                       "CreatedByType":  null,
                       "LastModifiedAt":  null,
                       "LastModifiedBy":  null,
                       "LastModifiedByType":  null
                   },
    "SystemDataCreatedAt":  null,
    "SystemDataCreatedBy":  null,
    "SystemDataCreatedByType":  null,
    "SystemDataLastModifiedAt":  null,
    "SystemDataLastModifiedBy":  null,
    "SystemDataLastModifiedByType":  null,
    "Tactic":  [
                   {

                   }
               ],
    "TemplateVersion":  null,
    "Type":  "Microsoft.SecurityInsights/alertRules"
}