{
    "AlertDetailOverrideAlertDescriptionFormat":  null,
    "AlertDetailOverrideAlertDisplayNameFormat":  null,
    "AlertDetailOverrideAlertSeverityColumnName":  null,
    "AlertDetailOverrideAlertTacticsColumnName":  null,
    "AlertRuleTemplateName":  null,
    "CustomDetail":  {

                     },
    "Description":  "Identifies when a user has clicked on a URL from an email that was classified as a phishing email.",
    "DisplayName":  "Potentially Malicious URL Click Detected",
    "Enabled":  true,
    "EntityMapping":  [
                          {
                              "EntityType":  {

                                             },
                              "FieldMapping":  [
                                                   {
                                                       "ColumnName":  "RecipientEmailAddress",
                                                       "Identifier":  "Name"
                                                   }
                                               ]
                          },
                          {
                              "EntityType":  {

                                             },
                              "FieldMapping":  [
                                                   {
                                                       "ColumnName":  "ClickedURL",
                                                       "Identifier":  "Url"
                                                   }
                                               ]
                          }
                      ],
    "Etag":  "\"9c04daf6-0000-1100-0000-66caed0e0000\"",
    "EventGroupingSettingAggregationKind":  {

                                            },
    "GroupingConfigurationEnabled":  true,
    "GroupingConfigurationGroupByAlertDetail":  [

                                                ],
    "GroupingConfigurationGroupByCustomDetail":  [

                                                 ],
    "GroupingConfigurationGroupByEntity":  [

                                           ],
    "GroupingConfigurationLookbackDuration":  {
                                                  "Ticks":  2592000000000,
                                                  "Days":  3,
                                                  "Hours":  0,
                                                  "Milliseconds":  0,
                                                  "Minutes":  0,
                                                  "Seconds":  0,
                                                  "TotalDays":  3,
                                                  "TotalHours":  72,
                                                  "TotalMilliseconds":  259200000,
                                                  "TotalMinutes":  4320,
                                                  "TotalSeconds":  259200
                                              },
    "GroupingConfigurationMatchingMethod":  {

                                            },
    "GroupingConfigurationReopenClosedIncident":  false,
    "Id":  "/subscriptions/5cfeafdb-fc6b-4d09-971d-3320c5ec14a0/resourceGroups/training_jordan/providers/Microsoft.OperationalInsights/workspaces/acmesentinel/providers/Microsoft.SecurityInsights/alertRules/28810579-a6d6-4e13-aecb-396941cfa5dd",
    "IncidentConfigurationCreateIncident":  true,
    "Kind":  {

             },
    "LastModifiedUtc":  "\/Date(1724574986881)\/",
    "Name":  "28810579-a6d6-4e13-aecb-396941cfa5dd",
    "Query":  "let LateFlag =  EmailPostDeliveryEvents\r\n| where TimeGenerated \u003e ago(1h)\r\n| where ActionType == \"Phish ZAP\"\r\n| distinct NetworkMessageId;\r\nlet TooLate = UrlClickEvents\r\n| where TimeGenerated \u003e ago(14d)\r\n| join kind=inner LateFlag on NetworkMessageId\r\n| join kind=inner EmailEvents on  NetworkMessageId\r\n| where not (OrgLevelPolicy contains \"Phishing Simulation\" or OrgLevelPolicy contains \"Sender address list (Safe sender / Blocked sender)\")\r\n| where not(UserLevelPolicy contains \"Sender address list (Safe sender / Blocked sender)\")\r\n| where not(SenderFromAddress contains \"knowbe4\")\r\n| where not(SenderFromDomain contains \"knowbe4\")\r\n| where not(InternetMessageId contains \"knowbe4\")\r\n| distinct \r\n    TimeGenerated,\r\n    SenderFromAddress,\r\n    RecipientEmailAddress,\r\n    Subject,\r\n    ClickedURL = Url,\r\n    NetworkMessageId,\r\n    AuthenticationDetails,\r\n    SenderIPv4,\r\n    SenderIPv6,\r\n    SenderFromDomain,\r\n    UrlCount,\r\n    AttachmentCount,\r\n    ConfidenceLevel,\r\n    DetectionMethods,\r\n    DeliveryAction,\r\n    DeliveryLocation;\r\nlet URLClick = UrlClickEvents\r\n| where TimeGenerated \u003e ago(1h) // DEPENDS ON RULE FREQUENCY\r\n| project AccountUpn,NetworkMessageId,Url;\r\nlet QuarantineRelease = EmailPostDeliveryEvents\r\n| where Action == \"Quarantine release\" and ActionType == \"Manual Remediation\"\r\n| project NetworkMessageId;\r\nEmailEvents\r\n| where TimeGenerated \u003e ago(14d)\r\n| join kind=leftouter EmailPostDeliveryEvents on NetworkMessageId\r\n| where ThreatTypes == \"Phish\" or ActionType == \"Phish ZAP\"\r\n| where not (OrgLevelPolicy contains \"Phishing Simulation\" or OrgLevelPolicy contains \"Sender address list (Safe sender / Blocked sender)\")\r\n| where not( UserLevelPolicy contains \"Sender address list (Safe sender / Blocked sender)\")\r\n| where not( SenderFromAddress contains \"knowbe4\")\r\n| where not( SenderFromDomain contains \"knowbe4\")\r\n| where not( InternetMessageId contains \"knowbe4\")\r\n| join kind=inner URLClick on NetworkMessageId, $left.RecipientEmailAddress == $right.AccountUpn\r\n| project TimeGenerated, SenderFromAddress,RecipientEmailAddress,Subject,ClickedURL = Url,NetworkMessageId,AuthenticationDetails,SenderIPv4,SenderIPv6,SenderFromDomain,UrlCount,AttachmentCount,ConfidenceLevel,DetectionMethods,DeliveryAction,DeliveryLocation\r\n| join kind=leftanti QuarantineRelease on NetworkMessageId\r\n| union TooLate\r\n| where SenderFromAddress !in (\"dse@eumail.docusign.net\",\"dse_na2@docusign.net\",\"dse_na3@docusign.net\")",
    "QueryFrequency":  {
                           "Ticks":  36000000000,
                           "Days":  0,
                           "Hours":  1,
                           "Milliseconds":  0,
                           "Minutes":  0,
                           "Seconds":  0,
                           "TotalDays":  0.041666666666666664,
                           "TotalHours":  1,
                           "TotalMilliseconds":  3600000,
                           "TotalMinutes":  60,
                           "TotalSeconds":  3600
                       },
    "QueryPeriod":  {
                        "Ticks":  12096000000000,
                        "Days":  14,
                        "Hours":  0,
                        "Milliseconds":  0,
                        "Minutes":  0,
                        "Seconds":  0,
                        "TotalDays":  14,
                        "TotalHours":  336,
                        "TotalMilliseconds":  1209600000,
                        "TotalMinutes":  20160,
                        "TotalSeconds":  1209600
                    },
    "Severity":  {

                 },
    "SuppressionDuration":  {
                                "Ticks":  180000000000,
                                "Days":  0,
                                "Hours":  5,
                                "Milliseconds":  0,
                                "Minutes":  0,
                                "Seconds":  0,
                                "TotalDays":  0.20833333333333331,
                                "TotalHours":  5,
                                "TotalMilliseconds":  18000000,
                                "TotalMinutes":  300,
                                "TotalSeconds":  18000
                            },
    "SuppressionEnabled":  false,
    "SystemData":  {
                       "CreatedAt":  null,
                       "CreatedBy":  null,
                       "CreatedByType":  null,
                       "LastModifiedAt":  null,
                       "LastModifiedBy":  null,
                       "LastModifiedByType":  null
                   },
    "SystemDataCreatedAt":  null,
    "SystemDataCreatedBy":  null,
    "SystemDataCreatedByType":  null,
    "SystemDataLastModifiedAt":  null,
    "SystemDataLastModifiedBy":  null,
    "SystemDataLastModifiedByType":  null,
    "Tactic":  [
                   {

                   },
                   {

                   }
               ],
    "TemplateVersion":  null,
    "TriggerOperator":  {

                        },
    "TriggerThreshold":  0,
    "Type":  "Microsoft.SecurityInsights/alertRules"
}