{
    "AlertDetailOverrideAlertDescriptionFormat":  null,
    "AlertDetailOverrideAlertDisplayNameFormat":  null,
    "AlertDetailOverrideAlertSeverityColumnName":  null,
    "AlertDetailOverrideAlertTacticsColumnName":  null,
    "AlertRuleTemplateName":  null,
    "CustomDetail":  {

                     },
    "Description":  "Identifies potential instances of abuse involving the Cloudflare tunnel by correlating data from device registry events and process events. It specifically looks for activities related to the execution or configuration of the Cloudflared tunnel.",
    "DisplayName":  "Potential Cloudflare Tunnel Abuse Detection",
    "Enabled":  true,
    "EntityMapping":  null,
    "Etag":  "\"9d04850d-0000-1100-0000-66caed5f0000\"",
    "EventGroupingSettingAggregationKind":  {

                                            },
    "GroupingConfigurationEnabled":  false,
    "GroupingConfigurationGroupByAlertDetail":  [

                                                ],
    "GroupingConfigurationGroupByCustomDetail":  [

                                                 ],
    "GroupingConfigurationGroupByEntity":  [

                                           ],
    "GroupingConfigurationLookbackDuration":  {
                                                  "Ticks":  180000000000,
                                                  "Days":  0,
                                                  "Hours":  5,
                                                  "Milliseconds":  0,
                                                  "Minutes":  0,
                                                  "Seconds":  0,
                                                  "TotalDays":  0.20833333333333331,
                                                  "TotalHours":  5,
                                                  "TotalMilliseconds":  18000000,
                                                  "TotalMinutes":  300,
                                                  "TotalSeconds":  18000
                                              },
    "GroupingConfigurationMatchingMethod":  {

                                            },
    "GroupingConfigurationReopenClosedIncident":  false,
    "Id":  "/subscriptions/5cfeafdb-fc6b-4d09-971d-3320c5ec14a0/resourceGroups/training_jordan/providers/Microsoft.OperationalInsights/workspaces/acmesentinel/providers/Microsoft.SecurityInsights/alertRules/1c3831de-2276-4101-bded-aeda6f9e9c92",
    "IncidentConfigurationCreateIncident":  true,
    "Kind":  {

             },
    "LastModifiedUtc":  "\/Date(1724575070196)\/",
    "Name":  "1c3831de-2276-4101-bded-aeda6f9e9c92",
    "Query":  "let signture_cloudfalred = \"tunnel run\";\r\nlet cloudflaredRegistryQuery =\r\n    DeviceRegistryEvents\r\n    | where ActionType contains \"RegistryValueSet\"\r\n    | where RegistryKey contains @\"HKEY_LOCAL_MACHINE\\SYSTEM\\ControlSet001\\Services\\Cloudflared\"\r\n    | where RegistryValueData contains signture_cloudfalred\r\n    | project DeviceId, TimeGenerated, ActionType, RegistryKey, RegistryValueData, DeviceName, MachineGroup, PreviousRegistryValueName;\r\nlet cloudflaredProcessQuery =\r\n    DeviceProcessEvents\r\n   // | where FolderPath contains \"cloudflared\"\r\n    | where ProcessCommandLine contains signture_cloudfalred\r\n    | extend Query2_ActionType = ActionType\r\n    | project DeviceId, TimeGenerated, ActionType, InitiatingProcessCommandLine, FolderPath, AccountName, AccountUpn, FileName, InitiatingProcessFolderPath, ProcessCommandLine;\r\n cloudflaredRegistryQuery\r\n| join kind=inner cloudflaredProcessQuery on DeviceId",
    "QueryFrequency":  {
                           "Ticks":  180000000000,
                           "Days":  0,
                           "Hours":  5,
                           "Milliseconds":  0,
                           "Minutes":  0,
                           "Seconds":  0,
                           "TotalDays":  0.20833333333333331,
                           "TotalHours":  5,
                           "TotalMilliseconds":  18000000,
                           "TotalMinutes":  300,
                           "TotalSeconds":  18000
                       },
    "QueryPeriod":  {
                        "Ticks":  180000000000,
                        "Days":  0,
                        "Hours":  5,
                        "Milliseconds":  0,
                        "Minutes":  0,
                        "Seconds":  0,
                        "TotalDays":  0.20833333333333331,
                        "TotalHours":  5,
                        "TotalMilliseconds":  18000000,
                        "TotalMinutes":  300,
                        "TotalSeconds":  18000
                    },
    "Severity":  {

                 },
    "SuppressionDuration":  {
                                "Ticks":  180000000000,
                                "Days":  0,
                                "Hours":  5,
                                "Milliseconds":  0,
                                "Minutes":  0,
                                "Seconds":  0,
                                "TotalDays":  0.20833333333333331,
                                "TotalHours":  5,
                                "TotalMilliseconds":  18000000,
                                "TotalMinutes":  300,
                                "TotalSeconds":  18000
                            },
    "SuppressionEnabled":  false,
    "SystemData":  {
                       "CreatedAt":  null,
                       "CreatedBy":  null,
                       "CreatedByType":  null,
                       "LastModifiedAt":  null,
                       "LastModifiedBy":  null,
                       "LastModifiedByType":  null
                   },
    "SystemDataCreatedAt":  null,
    "SystemDataCreatedBy":  null,
    "SystemDataCreatedByType":  null,
    "SystemDataLastModifiedAt":  null,
    "SystemDataLastModifiedBy":  null,
    "SystemDataLastModifiedByType":  null,
    "Tactic":  [
                   {

                   }
               ],
    "TemplateVersion":  null,
    "TriggerOperator":  {

                        },
    "TriggerThreshold":  0,
    "Type":  "Microsoft.SecurityInsights/alertRules"
}