{
    "AlertDetailOverrideAlertDescriptionFormat":  null,
    "AlertDetailOverrideAlertDisplayNameFormat":  null,
    "AlertDetailOverrideAlertSeverityColumnName":  null,
    "AlertDetailOverrideAlertTacticsColumnName":  null,
    "AlertRuleTemplateName":  null,
    "CustomDetail":  {

                     },
    "Description":  "",
    "DisplayName":  "Processes Used for Discovery - Omar",
    "Enabled":  true,
    "EntityMapping":  null,
    "Etag":  "\"4500009c-0000-1100-0000-686223bc0000\"",
    "EventGroupingSettingAggregationKind":  {

                                            },
    "GroupingConfigurationEnabled":  false,
    "GroupingConfigurationGroupByAlertDetail":  [

                                                ],
    "GroupingConfigurationGroupByCustomDetail":  [

                                                 ],
    "GroupingConfigurationGroupByEntity":  [

                                           ],
    "GroupingConfigurationLookbackDuration":  {
                                                  "Ticks":  180000000000,
                                                  "Days":  0,
                                                  "Hours":  5,
                                                  "Milliseconds":  0,
                                                  "Minutes":  0,
                                                  "Seconds":  0,
                                                  "TotalDays":  0.20833333333333331,
                                                  "TotalHours":  5,
                                                  "TotalMilliseconds":  18000000,
                                                  "TotalMinutes":  300,
                                                  "TotalSeconds":  18000
                                              },
    "GroupingConfigurationMatchingMethod":  {

                                            },
    "GroupingConfigurationReopenClosedIncident":  false,
    "Id":  "/subscriptions/5cfeafdb-fc6b-4d09-971d-3320c5ec14a0/resourceGroups/training_jordan/providers/Microsoft.OperationalInsights/workspaces/acmesentinel/providers/Microsoft.SecurityInsights/alertRules/6def9d61-3bb8-4135-b9e4-fa845e238f6c",
    "IncidentConfigurationCreateIncident":  true,
    "Kind":  {

             },
    "LastModifiedUtc":  "\/Date(1751262138850)\/",
    "Name":  "6def9d61-3bb8-4135-b9e4-fa845e238f6c",
    "Query":  "DeviceProcessEvents\r\n| where ActionType == \"ProcessCreated\"\r\n| where ProcessCommandLine has_any (\r\n    \"tasklist\", \"Get-Process\", \"wmic process list\", \"gwmi win32_process\",\r\n    \"Get-WmiObject\", \"sc query\", \"sc queryex\", \"sc qc\", \"systeminfo\",\r\n    \"hostname\", \"ipconfig\", \"net\", \"dsquery\", \"quser\", \"qwinsta\", \"whoami\"\r\n)\r\n| where InitiatingProcessFileName !in~ (\r\n    \"explorer.exe\", \"cmd.exe\", \"powershell.exe\", \"powershell_ise.exe\", \r\n    \"wmiprvse.exe\", \"services.exe\", \"msedge.exe\", \"chrome.exe\"\r\n)\r\n| where AccountName !in~ (\"SYSTEM\", \"LOCAL SERVICE\", \"NETWORK SERVICE\", \"svc_backup\", \"domain\\\\itadmin\")\r\n| where not(ProcessCommandLine has_any (\r\n    \"Get-Process | Where-Object\", \r\n    \"tasklist /v\", \r\n    \"sc query type=\", \r\n    \"wmic process list brief\"\r\n))\r\n| project \r\n    TimeGenerated,\r\n    DeviceName,\r\n    AccountName,\r\n    AccountDomain,\r\n    FileName,\r\n    ProcessCommandLine,\r\n    InitiatingProcessFileName,\r\n    InitiatingProcessCommandLine,\r\n    Technique = \"T1057 - Process Discovery\",\r\n    SourceTable = \"DeviceProcessEvents\"\r\n| sort by TimeGenerated desc\r\n",
    "QueryFrequency":  {
                           "Ticks":  36000000000,
                           "Days":  0,
                           "Hours":  1,
                           "Milliseconds":  0,
                           "Minutes":  0,
                           "Seconds":  0,
                           "TotalDays":  0.041666666666666664,
                           "TotalHours":  1,
                           "TotalMilliseconds":  3600000,
                           "TotalMinutes":  60,
                           "TotalSeconds":  3600
                       },
    "QueryPeriod":  {
                        "Ticks":  1728000000000,
                        "Days":  2,
                        "Hours":  0,
                        "Milliseconds":  0,
                        "Minutes":  0,
                        "Seconds":  0,
                        "TotalDays":  2,
                        "TotalHours":  48,
                        "TotalMilliseconds":  172800000,
                        "TotalMinutes":  2880,
                        "TotalSeconds":  172800
                    },
    "Severity":  {

                 },
    "SuppressionDuration":  {
                                "Ticks":  180000000000,
                                "Days":  0,
                                "Hours":  5,
                                "Milliseconds":  0,
                                "Minutes":  0,
                                "Seconds":  0,
                                "TotalDays":  0.20833333333333331,
                                "TotalHours":  5,
                                "TotalMilliseconds":  18000000,
                                "TotalMinutes":  300,
                                "TotalSeconds":  18000
                            },
    "SuppressionEnabled":  false,
    "SystemData":  {
                       "CreatedAt":  null,
                       "CreatedBy":  null,
                       "CreatedByType":  null,
                       "LastModifiedAt":  null,
                       "LastModifiedBy":  null,
                       "LastModifiedByType":  null
                   },
    "SystemDataCreatedAt":  null,
    "SystemDataCreatedBy":  null,
    "SystemDataCreatedByType":  null,
    "SystemDataLastModifiedAt":  null,
    "SystemDataLastModifiedBy":  null,
    "SystemDataLastModifiedByType":  null,
    "Tactic":  [
                   {

                   }
               ],
    "TemplateVersion":  null,
    "TriggerOperator":  {

                        },
    "TriggerThreshold":  0,
    "Type":  "Microsoft.SecurityInsights/alertRules"
}