{
    "AlertDetailOverrideAlertDescriptionFormat":  null,
    "AlertDetailOverrideAlertDisplayNameFormat":  null,
    "AlertDetailOverrideAlertSeverityColumnName":  null,
    "AlertDetailOverrideAlertTacticsColumnName":  null,
    "AlertRuleTemplateName":  null,
    "CustomDetail":  {

                     },
    "Description":  "This rule detects instances when emails either sent to or received from the SOC are quarantined. In the event of detection, immediate actions are recommended, including releasing the email from quarantine or initiating a resend process.",
    "DisplayName":  "SOC Email Quarantine Detection",
    "Enabled":  true,
    "EntityMapping":  [
                          {
                              "EntityType":  {

                                             },
                              "FieldMapping":  [
                                                   {
                                                       "ColumnName":  "RecipientEmailAddress",
                                                       "Identifier":  "Recipient"
                                                   },
                                                   {
                                                       "ColumnName":  "NetworkMessageId",
                                                       "Identifier":  "NetworkMessageId"
                                                   },
                                                   {
                                                       "ColumnName":  "Subject",
                                                       "Identifier":  "Subject"
                                                   }
                                               ]
                          }
                      ],
    "Etag":  "\"9d04fd0d-0000-1100-0000-66caed610000\"",
    "GroupingConfigurationEnabled":  false,
    "GroupingConfigurationGroupByAlertDetail":  [

                                                ],
    "GroupingConfigurationGroupByCustomDetail":  [

                                                 ],
    "GroupingConfigurationGroupByEntity":  [

                                           ],
    "GroupingConfigurationLookbackDuration":  {
                                                  "Ticks":  180000000000,
                                                  "Days":  0,
                                                  "Hours":  5,
                                                  "Milliseconds":  0,
                                                  "Minutes":  0,
                                                  "Seconds":  0,
                                                  "TotalDays":  0.20833333333333331,
                                                  "TotalHours":  5,
                                                  "TotalMilliseconds":  18000000,
                                                  "TotalMinutes":  300,
                                                  "TotalSeconds":  18000
                                              },
    "GroupingConfigurationMatchingMethod":  {

                                            },
    "GroupingConfigurationReopenClosedIncident":  false,
    "Id":  "/subscriptions/5cfeafdb-fc6b-4d09-971d-3320c5ec14a0/resourceGroups/training_jordan/providers/Microsoft.OperationalInsights/workspaces/acmesentinel/providers/Microsoft.SecurityInsights/alertRules/c2b6b916-ffb1-4e65-ad59-a0f73185ae28",
    "IncidentConfigurationCreateIncident":  true,
    "Kind":  {

             },
    "LastModifiedUtc":  "\/Date(1724575069986)\/",
    "Name":  "c2b6b916-ffb1-4e65-ad59-a0f73185ae28",
    "Query":  "EmailEvents\r\n| where DeliveryLocation contains \"Quarantine\" or EmailAction contains \"Send to quarantine\"\r\n| where SenderFromAddress contains \"soc@wizardcyber.com\" or RecipientEmailAddress contains \"soc@wizardcyber.com\"\r\n| project TimeGenerated, DeliveryLocation, EmailAction, Subject, NetworkMessageId,SenderDisplayName, SenderFromAddress, RecipientEmailAddress, InternetMessageId",
    "Severity":  {

                 },
    "SuppressionDuration":  {
                                "Ticks":  180000000000,
                                "Days":  0,
                                "Hours":  5,
                                "Milliseconds":  0,
                                "Minutes":  0,
                                "Seconds":  0,
                                "TotalDays":  0.20833333333333331,
                                "TotalHours":  5,
                                "TotalMilliseconds":  18000000,
                                "TotalMinutes":  300,
                                "TotalSeconds":  18000
                            },
    "SuppressionEnabled":  false,
    "SystemData":  {
                       "CreatedAt":  null,
                       "CreatedBy":  null,
                       "CreatedByType":  null,
                       "LastModifiedAt":  null,
                       "LastModifiedBy":  null,
                       "LastModifiedByType":  null
                   },
    "SystemDataCreatedAt":  null,
    "SystemDataCreatedBy":  null,
    "SystemDataCreatedByType":  null,
    "SystemDataLastModifiedAt":  null,
    "SystemDataLastModifiedBy":  null,
    "SystemDataLastModifiedByType":  null,
    "Tactic":  [

               ],
    "TemplateVersion":  null,
    "Type":  "Microsoft.SecurityInsights/alertRules"
}