{
    "AlertDetailOverrideAlertDescriptionFormat":  null,
    "AlertDetailOverrideAlertDisplayNameFormat":  null,
    "AlertDetailOverrideAlertSeverityColumnName":  null,
    "AlertDetailOverrideAlertTacticsColumnName":  null,
    "AlertRuleTemplateName":  "02ef8d7e-fc3a-4d86-a457-650fa571d8d2",
    "CustomDetail":  {

                     },
    "Description":  "Identifies when a user account successfully logs onto an Azure App from one IP and within 10 mins failed to logon to the same App via a different IP.\nThis may indicate a malicious attempt at password guessing based on knowledge of the users account.",
    "DisplayName":  "Successful logon from IP and failure from a different IP - [WC-AZURE]",
    "Enabled":  true,
    "EntityMapping":  [
                          {
                              "EntityType":  {

                                             },
                              "FieldMapping":  [
                                                   {
                                                       "ColumnName":  "UserPrincipalName",
                                                       "Identifier":  "FullName"
                                                   }
                                               ]
                          },
                          {
                              "EntityType":  {

                                             },
                              "FieldMapping":  [
                                                   {
                                                       "ColumnName":  "SuccessIPAddress",
                                                       "Identifier":  "Address"
                                                   }
                                               ]
                          },
                          {
                              "EntityType":  {

                                             },
                              "FieldMapping":  [
                                                   {
                                                       "ColumnName":  "FailedIPAddress",
                                                       "Identifier":  "Address"
                                                   }
                                               ]
                          }
                      ],
    "Etag":  "\"9c04b9f5-0000-1100-0000-66caed0b0000\"",
    "EventGroupingSettingAggregationKind":  {

                                            },
    "GroupingConfigurationEnabled":  true,
    "GroupingConfigurationGroupByAlertDetail":  [

                                                ],
    "GroupingConfigurationGroupByCustomDetail":  [

                                                 ],
    "GroupingConfigurationGroupByEntity":  [

                                           ],
    "GroupingConfigurationLookbackDuration":  {
                                                  "Ticks":  36000000000,
                                                  "Days":  0,
                                                  "Hours":  1,
                                                  "Milliseconds":  0,
                                                  "Minutes":  0,
                                                  "Seconds":  0,
                                                  "TotalDays":  0.041666666666666664,
                                                  "TotalHours":  1,
                                                  "TotalMilliseconds":  3600000,
                                                  "TotalMinutes":  60,
                                                  "TotalSeconds":  3600
                                              },
    "GroupingConfigurationMatchingMethod":  {

                                            },
    "GroupingConfigurationReopenClosedIncident":  false,
    "Id":  "/subscriptions/5cfeafdb-fc6b-4d09-971d-3320c5ec14a0/resourceGroups/training_jordan/providers/Microsoft.OperationalInsights/workspaces/acmesentinel/providers/Microsoft.SecurityInsights/alertRules/d831837a-a7aa-406e-a438-c527fa4c9b20",
    "IncidentConfigurationCreateIncident":  true,
    "Kind":  {

             },
    "LastModifiedUtc":  "\/Date(1724574986818)\/",
    "Name":  "d831837a-a7aa-406e-a438-c527fa4c9b20",
    "Query":  "let timeFrame = 1h;\nlet logonDiff = 10m;\nlet alerttable = \nSigninLogs \n| where TimeGenerated \u003e= ago(timeFrame) \n| where ResultType == \"0\" \n| where AppDisplayName !in (\"Skype for Business Online\")\n| project\n    SuccessLogonTime = TimeGenerated,\n    UserPrincipalName,\n    SuccessIPAddress = IPAddress,\n    AppDisplayName,\n    SuccessIPBlock = strcat(split(IPAddress, \".\")[0], \".\", split(IPAddress, \".\")[1])\n| join kind= inner (\n    SigninLogs \n    | where TimeGenerated \u003e= ago(timeFrame) \n    | where ResultType !in (\"0\", \"50140\") \n    | where ResultDescription !~ \"Other\"  \n    | where AppDisplayName !in (\"Skype for Business Online\")\n    | project\n        FailedLogonTime = TimeGenerated,\n        UserPrincipalName,\n        FailedIPAddress = IPAddress,\n        AppDisplayName,\n        ResultType,\n        ResultDescription\n    )\n    on UserPrincipalName, AppDisplayName \n| where SuccessLogonTime \u003c FailedLogonTime\n    and FailedLogonTime - SuccessLogonTime \u003c= logonDiff\n    and FailedIPAddress !startswith SuccessIPBlock\n| where FailedIPAddress != \"217.110.76.114\"\n| summarize FailedLogonTime = max(FailedLogonTime), SuccessLogonTime = max(SuccessLogonTime)\n    by\n    UserPrincipalName,\n    SuccessIPAddress,\n    AppDisplayName,\n    FailedIPAddress,\n    ResultType,\n    ResultDescription \n| extend\n    timestamp = SuccessLogonTime,\n    AccountCustomEntity = UserPrincipalName,\n    IPCustomEntity = SuccessIPAddress\n| join kind=anti (\n    SigninLogs \n    | where TimeGenerated \u003e= ago(timeFrame)\n    | where ResultType == \"0\"\n    | project\n        SuccessLogonTime = TimeGenerated,\n        UserPrincipalName,\n        SuccessIPAddress = IPAddress,\n        AppDisplayName\n    )\n    on $left.FailedIPAddress == $right.SuccessIPAddress;\n    let FailedIPManagedAttempts = SigninLogs\n    | where tostring( parse_json(DeviceDetail).trustType) != \"\"\n    | summarize FailedIPManagedAttempts = count() by IPAddress;\n    let SuccessfulIPManagedAttempts = SigninLogs\n    | where tostring( parse_json(DeviceDetail).trustType) != \"\"\n    | summarize SuccessfulIPManagedAttempts = count() by IPAddress;\n    alerttable\n    | join kind=leftouter FailedIPManagedAttempts on $left.FailedIPAddress == $right.IPAddress\n    | join kind=leftouter SuccessfulIPManagedAttempts on $left.SuccessIPAddress == $right.IPAddress\n    | extend FailedIPManagedAttempts = coalesce(FailedIPManagedAttempts,0)\n    | extend SuccessfulIPManagedAttempts = coalesce(SuccessfulIPManagedAttempts, 0)\n    | project-away IPAddress1,IPAddress\n    | where FailedIPManagedAttempts == 0 and SuccessfulIPManagedAttempts == 0\n",
    "QueryFrequency":  {
                           "Ticks":  36000000000,
                           "Days":  0,
                           "Hours":  1,
                           "Milliseconds":  0,
                           "Minutes":  0,
                           "Seconds":  0,
                           "TotalDays":  0.041666666666666664,
                           "TotalHours":  1,
                           "TotalMilliseconds":  3600000,
                           "TotalMinutes":  60,
                           "TotalSeconds":  3600
                       },
    "QueryPeriod":  {
                        "Ticks":  12096000000000,
                        "Days":  14,
                        "Hours":  0,
                        "Milliseconds":  0,
                        "Minutes":  0,
                        "Seconds":  0,
                        "TotalDays":  14,
                        "TotalHours":  336,
                        "TotalMilliseconds":  1209600000,
                        "TotalMinutes":  20160,
                        "TotalSeconds":  1209600
                    },
    "Severity":  {

                 },
    "SuppressionDuration":  {
                                "Ticks":  180000000000,
                                "Days":  0,
                                "Hours":  5,
                                "Milliseconds":  0,
                                "Minutes":  0,
                                "Seconds":  0,
                                "TotalDays":  0.20833333333333331,
                                "TotalHours":  5,
                                "TotalMilliseconds":  18000000,
                                "TotalMinutes":  300,
                                "TotalSeconds":  18000
                            },
    "SuppressionEnabled":  false,
    "SystemData":  {
                       "CreatedAt":  null,
                       "CreatedBy":  null,
                       "CreatedByType":  null,
                       "LastModifiedAt":  null,
                       "LastModifiedBy":  null,
                       "LastModifiedByType":  null
                   },
    "SystemDataCreatedAt":  null,
    "SystemDataCreatedBy":  null,
    "SystemDataCreatedByType":  null,
    "SystemDataLastModifiedAt":  null,
    "SystemDataLastModifiedBy":  null,
    "SystemDataLastModifiedByType":  null,
    "Tactic":  [
                   {

                   },
                   {

                   }
               ],
    "TemplateVersion":  "1.1.0",
    "TriggerOperator":  {

                        },
    "TriggerThreshold":  0,
    "Type":  "Microsoft.SecurityInsights/alertRules"
}