{
    "AlertDetailOverrideAlertDescriptionFormat":  null,
    "AlertDetailOverrideAlertDisplayNameFormat":  null,
    "AlertDetailOverrideAlertSeverityColumnName":  null,
    "AlertDetailOverrideAlertTacticsColumnName":  null,
    "AlertRuleTemplateName":  null,
    "CustomDetail":  {

                     },
    "Description":  "This alert triggers when an Azure Resource group is created by an account that is not listed on the admin account watchlist",
    "DisplayName":  "Suspicious Azure resource group creation- [WC-BASE]",
    "Enabled":  true,
    "EntityMapping":  [
                          {
                              "EntityType":  {

                                             },
                              "FieldMapping":  [
                                                   {
                                                       "ColumnName":  "ResourceGroup",
                                                       "Identifier":  "ResourceId"
                                                   }
                                               ]
                          },
                          {
                              "EntityType":  {

                                             },
                              "FieldMapping":  [
                                                   {
                                                       "ColumnName":  "Caller",
                                                       "Identifier":  "AadUserId"
                                                   }
                                               ]
                          }
                      ],
    "Etag":  "\"1800568b-0000-1100-0000-682dca290000\"",
    "EventGroupingSettingAggregationKind":  {

                                            },
    "GroupingConfigurationEnabled":  false,
    "GroupingConfigurationGroupByAlertDetail":  [

                                                ],
    "GroupingConfigurationGroupByCustomDetail":  [

                                                 ],
    "GroupingConfigurationGroupByEntity":  [

                                           ],
    "GroupingConfigurationLookbackDuration":  {
                                                  "Ticks":  180000000000,
                                                  "Days":  0,
                                                  "Hours":  5,
                                                  "Milliseconds":  0,
                                                  "Minutes":  0,
                                                  "Seconds":  0,
                                                  "TotalDays":  0.20833333333333331,
                                                  "TotalHours":  5,
                                                  "TotalMilliseconds":  18000000,
                                                  "TotalMinutes":  300,
                                                  "TotalSeconds":  18000
                                              },
    "GroupingConfigurationMatchingMethod":  {

                                            },
    "GroupingConfigurationReopenClosedIncident":  false,
    "Id":  "/subscriptions/5cfeafdb-fc6b-4d09-971d-3320c5ec14a0/resourceGroups/training_jordan/providers/Microsoft.OperationalInsights/workspaces/AcmeSentinel/providers/Microsoft.SecurityInsights/alertRules/0f05645c-dcfe-42d8-a2df-c21c1c632eac",
    "IncidentConfigurationCreateIncident":  true,
    "Kind":  {

             },
    "LastModifiedUtc":  "\/Date(1747831336313)\/",
    "Name":  "0f05645c-dcfe-42d8-a2df-c21c1c632eac",
    "Query":  "let ManagedAttempts = SigninLogs\n    | union AADNonInteractiveUserSignInLogs\n    | where TimeGenerated \u003e ago(14d)\n    | where (tostring(parse_json(DeviceDetail_dynamic).trustType) != \"\" or tostring(parse_json(DeviceDetail_string).trustType) != \"\") or (DeviceDetail_dynamic or DeviceDetail_string contains \"PII Removed\")\n    | distinct IPAddress;\nAzureActivity\n| where TimeGenerated \u003e ago(1h)\n| where OperationNameValue == \"MICROSOFT.RESOURCES/DEPLOYMENTS/WRITE\"\n| where ActivityStatusValue == \"Success\"\n| project\n    TimeGenerated,\n    OperationNameValue,\n    ActivityStatus,\n    ResourceGroup,\n    Caller,\n    Type,\n    CallerIpAddress\n| join kind=leftanti ManagedAttempts on $left.CallerIpAddress == $right.IPAddress\n| where Caller contains \"@\"\n// WHITELIST\n| where Caller !contains \"heider.albadawi\" // Wizard\u0027s Detection Team Lead",
    "QueryFrequency":  {
                           "Ticks":  36000000000,
                           "Days":  0,
                           "Hours":  1,
                           "Milliseconds":  0,
                           "Minutes":  0,
                           "Seconds":  0,
                           "TotalDays":  0.041666666666666664,
                           "TotalHours":  1,
                           "TotalMilliseconds":  3600000,
                           "TotalMinutes":  60,
                           "TotalSeconds":  3600
                       },
    "QueryPeriod":  {
                        "Ticks":  12096000000000,
                        "Days":  14,
                        "Hours":  0,
                        "Milliseconds":  0,
                        "Minutes":  0,
                        "Seconds":  0,
                        "TotalDays":  14,
                        "TotalHours":  336,
                        "TotalMilliseconds":  1209600000,
                        "TotalMinutes":  20160,
                        "TotalSeconds":  1209600
                    },
    "Severity":  {

                 },
    "SuppressionDuration":  {
                                "Ticks":  180000000000,
                                "Days":  0,
                                "Hours":  5,
                                "Milliseconds":  0,
                                "Minutes":  0,
                                "Seconds":  0,
                                "TotalDays":  0.20833333333333331,
                                "TotalHours":  5,
                                "TotalMilliseconds":  18000000,
                                "TotalMinutes":  300,
                                "TotalSeconds":  18000
                            },
    "SuppressionEnabled":  false,
    "SystemData":  {
                       "CreatedAt":  null,
                       "CreatedBy":  null,
                       "CreatedByType":  null,
                       "LastModifiedAt":  null,
                       "LastModifiedBy":  null,
                       "LastModifiedByType":  null
                   },
    "SystemDataCreatedAt":  null,
    "SystemDataCreatedBy":  null,
    "SystemDataCreatedByType":  null,
    "SystemDataLastModifiedAt":  null,
    "SystemDataLastModifiedBy":  null,
    "SystemDataLastModifiedByType":  null,
    "Tactic":  [
                   {

                   }
               ],
    "TemplateVersion":  null,
    "TriggerOperator":  {

                        },
    "TriggerThreshold":  0,
    "Type":  "Microsoft.SecurityInsights/alertRules"
}