{
    "AlertDetailOverrideAlertDescriptionFormat":  null,
    "AlertDetailOverrideAlertDisplayNameFormat":  null,
    "AlertDetailOverrideAlertSeverityColumnName":  null,
    "AlertDetailOverrideAlertTacticsColumnName":  null,
    "AlertRuleTemplateName":  null,
    "CustomDetail":  {

                     },
    "Description":  "Detects creation of new local user accounts followed by immediate addition to privileged groups (especially Administrators) within 5 minutes. Attackers use this technique to establish persistence by creating backdoor accounts.",
    "DisplayName":  "Suspicious Local User Creation",
    "Enabled":  true,
    "EntityMapping":  null,
    "Etag":  "\"8600b253-0000-1100-0000-68668c630000\"",
    "GroupingConfigurationEnabled":  false,
    "GroupingConfigurationGroupByAlertDetail":  [

                                                ],
    "GroupingConfigurationGroupByCustomDetail":  [

                                                 ],
    "GroupingConfigurationGroupByEntity":  [

                                           ],
    "GroupingConfigurationLookbackDuration":  {
                                                  "Ticks":  180000000000,
                                                  "Days":  0,
                                                  "Hours":  5,
                                                  "Milliseconds":  0,
                                                  "Minutes":  0,
                                                  "Seconds":  0,
                                                  "TotalDays":  0.20833333333333331,
                                                  "TotalHours":  5,
                                                  "TotalMilliseconds":  18000000,
                                                  "TotalMinutes":  300,
                                                  "TotalSeconds":  18000
                                              },
    "GroupingConfigurationMatchingMethod":  {

                                            },
    "GroupingConfigurationReopenClosedIncident":  false,
    "Id":  "/subscriptions/5cfeafdb-fc6b-4d09-971d-3320c5ec14a0/resourceGroups/training_jordan/providers/Microsoft.OperationalInsights/workspaces/acmesentinel/providers/Microsoft.SecurityInsights/alertRules/153b38ed-c143-41d9-9015-0a597cbb7a7f",
    "IncidentConfigurationCreateIncident":  true,
    "Kind":  {

             },
    "LastModifiedUtc":  "\/Date(1751551074724)\/",
    "Name":  "153b38ed-c143-41d9-9015-0a597cbb7a7f",
    "Query":  "let userCreations = \r\n    DeviceEvents\r\n    | where ActionType == \"UserAccountCreated\"\r\n    | extend NewUserSid = AccountSid\r\n    | project TimeGenerated, DeviceName, NewUser = AccountName, NewUserSid, DeviceId, ReportId;\r\nlet adminAdditions = \r\n    DeviceEvents\r\n    | where ActionType == \"UserAccountAddedToLocalGroup\"\r\n    | extend GroupSid = tostring(parse_json(AdditionalFields).GroupSid),\r\n             GroupName = tostring(parse_json(AdditionalFields).GroupName),\r\n             AddedUserSid = AccountSid\r\n    | where GroupSid == \"S-1-5-32-544\"  \r\n    | project AdminAddTime = TimeGenerated, DeviceName, AddedUserSid, GroupName, GroupSid, ReportId, DeviceId;\r\nuserCreations\r\n| join kind=leftouter (\r\n    adminAdditions\r\n) on $left.NewUserSid == $right.AddedUserSid, $left.DeviceName == $right.DeviceName\r\n| extend TimeDelta = AdminAddTime - TimeGenerated\r\n| where isnull(AdminAddTime) or (AdminAddTime between (TimeGenerated .. (TimeGenerated + 5min)))\r\n| project TimeGenerated, DeviceName,NewUser, NewUserSid, AdminAddTime, GroupName, GroupSid, TimeDelta, WasAddedToAdmins = iif(isnull(AdminAddTime), \"No\", \"Yes\"), DeviceId, ReportId\r\n",
    "Severity":  {

                 },
    "SuppressionDuration":  {
                                "Ticks":  180000000000,
                                "Days":  0,
                                "Hours":  5,
                                "Milliseconds":  0,
                                "Minutes":  0,
                                "Seconds":  0,
                                "TotalDays":  0.20833333333333331,
                                "TotalHours":  5,
                                "TotalMilliseconds":  18000000,
                                "TotalMinutes":  300,
                                "TotalSeconds":  18000
                            },
    "SuppressionEnabled":  false,
    "SystemData":  {
                       "CreatedAt":  null,
                       "CreatedBy":  null,
                       "CreatedByType":  null,
                       "LastModifiedAt":  null,
                       "LastModifiedBy":  null,
                       "LastModifiedByType":  null
                   },
    "SystemDataCreatedAt":  null,
    "SystemDataCreatedBy":  null,
    "SystemDataCreatedByType":  null,
    "SystemDataLastModifiedAt":  null,
    "SystemDataLastModifiedBy":  null,
    "SystemDataLastModifiedByType":  null,
    "Tactic":  [
                   {

                   }
               ],
    "TemplateVersion":  null,
    "Type":  "Microsoft.SecurityInsights/alertRules"
}