{
    "AlertDetailOverrideAlertDescriptionFormat":  null,
    "AlertDetailOverrideAlertDisplayNameFormat":  null,
    "AlertDetailOverrideAlertSeverityColumnName":  null,
    "AlertDetailOverrideAlertTacticsColumnName":  null,
    "AlertRuleTemplateName":  null,
    "CustomDetail":  {

                     },
    "Description":  "This detection identifies potential tampering of the Windows event logs using tools such as wevtutil, Clear-EventLog, PowerShell, or VBScript. Clearing logs is a common technique used by attackers to erase evidence of malicious activity and evade detection.",
    "DisplayName":  "Suspicious Event Log Clearing [Faris]",
    "Enabled":  true,
    "EntityMapping":  null,
    "Etag":  "\"640036db-0000-1100-0000-68628d090000\"",
    "GroupingConfigurationEnabled":  false,
    "GroupingConfigurationGroupByAlertDetail":  [

                                                ],
    "GroupingConfigurationGroupByCustomDetail":  [

                                                 ],
    "GroupingConfigurationGroupByEntity":  [

                                           ],
    "GroupingConfigurationLookbackDuration":  {
                                                  "Ticks":  180000000000,
                                                  "Days":  0,
                                                  "Hours":  5,
                                                  "Milliseconds":  0,
                                                  "Minutes":  0,
                                                  "Seconds":  0,
                                                  "TotalDays":  0.20833333333333331,
                                                  "TotalHours":  5,
                                                  "TotalMilliseconds":  18000000,
                                                  "TotalMinutes":  300,
                                                  "TotalSeconds":  18000
                                              },
    "GroupingConfigurationMatchingMethod":  {

                                            },
    "GroupingConfigurationReopenClosedIncident":  false,
    "Id":  "/subscriptions/5cfeafdb-fc6b-4d09-971d-3320c5ec14a0/resourceGroups/training_jordan/providers/Microsoft.OperationalInsights/workspaces/acmesentinel/providers/Microsoft.SecurityInsights/alertRules/ada594b1-b53e-41f7-8ce8-5cb309c71e91",
    "IncidentConfigurationCreateIncident":  true,
    "Kind":  {

             },
    "LastModifiedUtc":  "\/Date(1751289097341)\/",
    "Name":  "ada594b1-b53e-41f7-8ce8-5cb309c71e91",
    "Query":  "let WevtutilEvents = DeviceProcessEvents\r\n| where InitiatingProcessAccountName !in~ (\"SYSTEM\", \"LOCAL SERVICE\", \"NETWORK SERVICE\")\r\n| where FileName in~ (\"wevtutil.exe\", \"powershell.exe\", \"cmd.exe\", \"wscript.exe\", \"cscript.exe\")\r\n| where (\r\n    ProcessCommandLine has_any (\"wevtutil cl\", \"Remove-Item\", \".evtx\", \"clear-log\", \"cl System\", \"cl Security\", \"cl Application\")\r\n    or ProcessCommandLine matches regex @\"(?i)(wevtutil|clear\\-log|Clear\\-EventLog|cl)\\s+(Security|System|Application)\"\r\n)\r\n| where ProcessCommandLine !contains \"cl /?\"\r\n| project TimeGenerated, DeviceName, InitiatingProcessAccountName, InitiatingProcessParentFileName, ProcessCommandLine,InitiatingProcessCommandLine, Source = \"DeviceProcessEvents\", ReportId, DeviceId;\r\nlet ClearEventLogEvents = DeviceEvents\r\n| where ActionType == \"PowerShellCommand\"\r\n| where InitiatingProcessAccountName !in~ (\"SYSTEM\", \"LOCAL SERVICE\", \"NETWORK SERVICE\")\r\n| where tostring(parse_json(AdditionalFields).Command) has \"Clear-EventLog\"\r\n| project TimeGenerated, DeviceName, InitiatingProcessAccountName, InitiatingProcessParentFileName,ProcessCommandLine = tostring(parse_json(AdditionalFields).Command),InitiatingProcessCommandLine, Source = \"DeviceEvents\", ReportId, DeviceId;\r\nWevtutilEvents\r\n| union ClearEventLogEvents\r\n| order by TimeGenerated desc\r\n",
    "Severity":  {

                 },
    "SuppressionDuration":  {
                                "Ticks":  180000000000,
                                "Days":  0,
                                "Hours":  5,
                                "Milliseconds":  0,
                                "Minutes":  0,
                                "Seconds":  0,
                                "TotalDays":  0.20833333333333331,
                                "TotalHours":  5,
                                "TotalMilliseconds":  18000000,
                                "TotalMinutes":  300,
                                "TotalSeconds":  18000
                            },
    "SuppressionEnabled":  false,
    "SystemData":  {
                       "CreatedAt":  null,
                       "CreatedBy":  null,
                       "CreatedByType":  null,
                       "LastModifiedAt":  null,
                       "LastModifiedBy":  null,
                       "LastModifiedByType":  null
                   },
    "SystemDataCreatedAt":  null,
    "SystemDataCreatedBy":  null,
    "SystemDataCreatedByType":  null,
    "SystemDataLastModifiedAt":  null,
    "SystemDataLastModifiedBy":  null,
    "SystemDataLastModifiedByType":  null,
    "Tactic":  [
                   {

                   }
               ],
    "TemplateVersion":  null,
    "Type":  "Microsoft.SecurityInsights/alertRules"
}