{
    "AlertDetailOverrideAlertDescriptionFormat":  null,
    "AlertDetailOverrideAlertDisplayNameFormat":  "Suspicious Browser Connection on Non-Standard Port",
    "AlertDetailOverrideAlertSeverityColumnName":  null,
    "AlertDetailOverrideAlertTacticsColumnName":  null,
    "AlertRuleTemplateName":  null,
    "CustomDetail":  {

                     },
    "Description":  "",
    "DisplayName":  "T1176 - Dina",
    "Enabled":  true,
    "EntityMapping":  null,
    "Etag":  "\"5000ee00-0000-1100-0000-68624a250000\"",
    "EventGroupingSettingAggregationKind":  {

                                            },
    "GroupingConfigurationEnabled":  true,
    "GroupingConfigurationGroupByAlertDetail":  [

                                                ],
    "GroupingConfigurationGroupByCustomDetail":  [

                                                 ],
    "GroupingConfigurationGroupByEntity":  [

                                           ],
    "GroupingConfigurationLookbackDuration":  {
                                                  "Ticks":  6048000000000,
                                                  "Days":  7,
                                                  "Hours":  0,
                                                  "Milliseconds":  0,
                                                  "Minutes":  0,
                                                  "Seconds":  0,
                                                  "TotalDays":  7,
                                                  "TotalHours":  168,
                                                  "TotalMilliseconds":  604800000,
                                                  "TotalMinutes":  10080,
                                                  "TotalSeconds":  604800
                                              },
    "GroupingConfigurationMatchingMethod":  {

                                            },
    "GroupingConfigurationReopenClosedIncident":  false,
    "Id":  "/subscriptions/5cfeafdb-fc6b-4d09-971d-3320c5ec14a0/resourceGroups/training_jordan/providers/Microsoft.OperationalInsights/workspaces/acmesentinel/providers/Microsoft.SecurityInsights/alertRules/bbed09ac-0045-4b00-af0f-4064b63bd51b",
    "IncidentConfigurationCreateIncident":  true,
    "Kind":  {

             },
    "LastModifiedUtc":  "\/Date(1751271972727)\/",
    "Name":  "bbed09ac-0045-4b00-af0f-4064b63bd51b",
    "Query":  "DeviceNetworkEvents\r\n| where InitiatingProcessFileName contains \"chrome\" or InitiatingProcessFileName contains \"edge\"\r\n| where RemotePort !in (80, 443, 53)\r\n| where RemoteIP !in (\"127.0.0.1\", \"::1\")\r\n| where ActionType == \"ConnectionSuccess\"\r\n| project TimeGenerated, DeviceName, InitiatingProcessFileName, RemoteIP, RemotePort, RemoteUrl\r\n| join kind=inner (\r\n    DeviceProcessEvents\r\n    | where FileName in (\"chrome.exe\", \"msedge.exe\", \"firefox.exe\")\r\n    | where ProcessCommandLine has_any (\"--load-extension\", \"extensions\", \"extension\")\r\n    | where InitiatingProcessCommandLine contains \"installer\"\r\n    | project TimeGenerated, DeviceName, InitiatingProcessFileName, FileName, ProcessCommandLine, ReportId, InitiatingProcessCommandLine, InitiatingProcessParentFileName\r\n) on DeviceName\r\n| order by TimeGenerated desc\r\n",
    "QueryFrequency":  {
                           "Ticks":  180000000000,
                           "Days":  0,
                           "Hours":  5,
                           "Milliseconds":  0,
                           "Minutes":  0,
                           "Seconds":  0,
                           "TotalDays":  0.20833333333333331,
                           "TotalHours":  5,
                           "TotalMilliseconds":  18000000,
                           "TotalMinutes":  300,
                           "TotalSeconds":  18000
                       },
    "QueryPeriod":  {
                        "Ticks":  180000000000,
                        "Days":  0,
                        "Hours":  5,
                        "Milliseconds":  0,
                        "Minutes":  0,
                        "Seconds":  0,
                        "TotalDays":  0.20833333333333331,
                        "TotalHours":  5,
                        "TotalMilliseconds":  18000000,
                        "TotalMinutes":  300,
                        "TotalSeconds":  18000
                    },
    "Severity":  {

                 },
    "SuppressionDuration":  {
                                "Ticks":  180000000000,
                                "Days":  0,
                                "Hours":  5,
                                "Milliseconds":  0,
                                "Minutes":  0,
                                "Seconds":  0,
                                "TotalDays":  0.20833333333333331,
                                "TotalHours":  5,
                                "TotalMilliseconds":  18000000,
                                "TotalMinutes":  300,
                                "TotalSeconds":  18000
                            },
    "SuppressionEnabled":  false,
    "SystemData":  {
                       "CreatedAt":  null,
                       "CreatedBy":  null,
                       "CreatedByType":  null,
                       "LastModifiedAt":  null,
                       "LastModifiedBy":  null,
                       "LastModifiedByType":  null
                   },
    "SystemDataCreatedAt":  null,
    "SystemDataCreatedBy":  null,
    "SystemDataCreatedByType":  null,
    "SystemDataLastModifiedAt":  null,
    "SystemDataLastModifiedBy":  null,
    "SystemDataLastModifiedByType":  null,
    "Tactic":  [
                   {

                   },
                   {

                   },
                   {

                   }
               ],
    "TemplateVersion":  null,
    "TriggerOperator":  {

                        },
    "TriggerThreshold":  0,
    "Type":  "Microsoft.SecurityInsights/alertRules"
}