{
    "AlertDetailOverrideAlertDescriptionFormat":  null,
    "AlertDetailOverrideAlertDisplayNameFormat":  null,
    "AlertDetailOverrideAlertSeverityColumnName":  null,
    "AlertDetailOverrideAlertTacticsColumnName":  null,
    "AlertRuleTemplateName":  null,
    "CustomDetail":  {

                     },
    "Description":  "Detects successful user logins from different countries within 3 hours, where at least one state hasn\u0027t been logged in from before in the last 2 weeks.",
    "DisplayName":  "User Login from Different Countries Within 3 Hours",
    "Enabled":  true,
    "EntityMapping":  [
                          {
                              "EntityType":  {

                                             },
                              "FieldMapping":  [
                                                   {
                                                       "ColumnName":  "UserPrincipalName",
                                                       "Identifier":  "Name"
                                                   }
                                               ]
                          },
                          {
                              "EntityType":  {

                                             },
                              "FieldMapping":  [
                                                   {
                                                       "ColumnName":  "IPAddress",
                                                       "Identifier":  "Address"
                                                   }
                                               ]
                          },
                          {
                              "EntityType":  {

                                             },
                              "FieldMapping":  [
                                                   {
                                                       "ColumnName":  "LocationDetail",
                                                       "Identifier":  "Name"
                                                   }
                                               ]
                          }
                      ],
    "Etag":  "\"9c043bf6-0000-1100-0000-66caed0c0000\"",
    "EventGroupingSettingAggregationKind":  {

                                            },
    "GroupingConfigurationEnabled":  true,
    "GroupingConfigurationGroupByAlertDetail":  [

                                                ],
    "GroupingConfigurationGroupByCustomDetail":  [

                                                 ],
    "GroupingConfigurationGroupByEntity":  [

                                           ],
    "GroupingConfigurationLookbackDuration":  {
                                                  "Ticks":  180000000000,
                                                  "Days":  0,
                                                  "Hours":  5,
                                                  "Milliseconds":  0,
                                                  "Minutes":  0,
                                                  "Seconds":  0,
                                                  "TotalDays":  0.20833333333333331,
                                                  "TotalHours":  5,
                                                  "TotalMilliseconds":  18000000,
                                                  "TotalMinutes":  300,
                                                  "TotalSeconds":  18000
                                              },
    "GroupingConfigurationMatchingMethod":  {

                                            },
    "GroupingConfigurationReopenClosedIncident":  false,
    "Id":  "/subscriptions/5cfeafdb-fc6b-4d09-971d-3320c5ec14a0/resourceGroups/training_jordan/providers/Microsoft.OperationalInsights/workspaces/acmesentinel/providers/Microsoft.SecurityInsights/alertRules/42718c04-51b3-4b7f-8511-0c19252ea44b",
    "IncidentConfigurationCreateIncident":  true,
    "Kind":  {

             },
    "LastModifiedUtc":  "\/Date(1724574986855)\/",
    "Name":  "42718c04-51b3-4b7f-8511-0c19252ea44b",
    "Query":  "let timeframe = ago(3h);\r\nlet threshold = 2;\r\nlet alerttable =\r\n    SigninLogs\r\n    | where ResultType == 0\r\n    | where TimeGenerated \u003e timeframe\r\n    | summarize\r\n        StartTime = min(TimeGenerated),\r\n        EndTime = max(TimeGenerated),\r\n        Countries = make_set(Location)\r\n        by UserPrincipalName\r\n    | extend NumOfCountries = array_length(Countries)\r\n    | where NumOfCountries \u003e= threshold;\r\nlet LocationDetails = SigninLogs\r\n    | where ResultType == 0\r\n    | where TimeGenerated \u003e timeframe\r\n    | where isnotempty( LocationDetails.state)\r\n    | join kind=inner alerttable on $left.UserPrincipalName == $right.UserPrincipalName\r\n    | extend LocationDetail = tostring(LocationDetails.state)\r\n    | summarize\r\n        Applications = make_set(AppDisplayName),\r\n        AuthenticationType = make_set(AuthenticationRequirement),\r\n        Device = make_set(DeviceDetail),\r\n        RiskEvent= make_set(RiskEventTypes),\r\n        RiskEventV2 = make_set(RiskEventTypes_V2)\r\n        by UserPrincipalName, IPAddress, LocationDetail, Location;\r\nlet IPManagedAttempts = SigninLogs\r\n    | union AADNonInteractiveUserSignInLogs\r\n    | where TimeGenerated \u003e ago(14d)\r\n    | where (tostring(parse_json(DeviceDetail_dynamic).trustType) != \"\" or tostring(parse_json(DeviceDetail_string).trustType) != \"\") or (DeviceDetail_dynamic or DeviceDetail_string contains \"PII Removed\")\r\n    | distinct IPAddress;\r\nlet KnownLocations = SigninLogs\r\n    | where TimeGenerated between (ago(14d) .. ago(3h))\r\n    | where isnotempty(Location)\r\n    | where isnotempty(LocationDetails.state)\r\n    | where ResultType == 0\r\n    | summarize UserKnownLocations = make_set(Location), UserKnownStates = make_set(LocationDetails.state) by UserPrincipalName;\r\nalerttable\r\n| join kind=inner LocationDetails on UserPrincipalName\r\n| join kind=leftouter KnownLocations on UserPrincipalName\r\n| project-reorder\r\n    StartTime,\r\n    EndTime,\r\n    UserPrincipalName,\r\n    NumOfCountries,\r\n    Countries,\r\n    Location,\r\n    LocationDetail,\r\n    UserKnownLocations,\r\n    UserKnownStates,\r\n    IPAddress,\r\n    Applications,\r\n    AuthenticationType,\r\n    Device,\r\n    RiskEvent,\r\n    RiskEventV2\r\n| project-away UserPrincipalName1,UserPrincipalName2\r\n| where (UserKnownLocations has Location) and (UserKnownStates !has LocationDetail)\r\n| join kind=leftanti IPManagedAttempts on IPAddress",
    "QueryFrequency":  {
                           "Ticks":  108000000000,
                           "Days":  0,
                           "Hours":  3,
                           "Milliseconds":  0,
                           "Minutes":  0,
                           "Seconds":  0,
                           "TotalDays":  0.125,
                           "TotalHours":  3,
                           "TotalMilliseconds":  10800000,
                           "TotalMinutes":  180,
                           "TotalSeconds":  10800
                       },
    "QueryPeriod":  {
                        "Ticks":  12096000000000,
                        "Days":  14,
                        "Hours":  0,
                        "Milliseconds":  0,
                        "Minutes":  0,
                        "Seconds":  0,
                        "TotalDays":  14,
                        "TotalHours":  336,
                        "TotalMilliseconds":  1209600000,
                        "TotalMinutes":  20160,
                        "TotalSeconds":  1209600
                    },
    "Severity":  {

                 },
    "SuppressionDuration":  {
                                "Ticks":  180000000000,
                                "Days":  0,
                                "Hours":  5,
                                "Milliseconds":  0,
                                "Minutes":  0,
                                "Seconds":  0,
                                "TotalDays":  0.20833333333333331,
                                "TotalHours":  5,
                                "TotalMilliseconds":  18000000,
                                "TotalMinutes":  300,
                                "TotalSeconds":  18000
                            },
    "SuppressionEnabled":  false,
    "SystemData":  {
                       "CreatedAt":  null,
                       "CreatedBy":  null,
                       "CreatedByType":  null,
                       "LastModifiedAt":  null,
                       "LastModifiedBy":  null,
                       "LastModifiedByType":  null
                   },
    "SystemDataCreatedAt":  null,
    "SystemDataCreatedBy":  null,
    "SystemDataCreatedByType":  null,
    "SystemDataLastModifiedAt":  null,
    "SystemDataLastModifiedBy":  null,
    "SystemDataLastModifiedByType":  null,
    "Tactic":  [
                   {

                   }
               ],
    "TemplateVersion":  null,
    "TriggerOperator":  {

                        },
    "TriggerThreshold":  0,
    "Type":  "Microsoft.SecurityInsights/alertRules"
}