{
    "AlertDetailOverrideAlertDescriptionFormat":  null,
    "AlertDetailOverrideAlertDisplayNameFormat":  null,
    "AlertDetailOverrideAlertSeverityColumnName":  null,
    "AlertDetailOverrideAlertTacticsColumnName":  null,
    "AlertRuleTemplateName":  null,
    "CustomDetail":  {

                     },
    "Description":  "Detects scenarios where an attacker attempts to delete existing VSS backup via WMI.\n",
    "DisplayName":  "VSS backup deletion via WMI (Powershell) - [WC-DFE]",
    "Enabled":  true,
    "EntityMapping":  [
                          {
                              "EntityType":  {

                                             },
                              "FieldMapping":  [
                                                   {
                                                       "ColumnName":  "DeviceName",
                                                       "Identifier":  "FullName"
                                                   }
                                               ]
                          }
                      ],
    "Etag":  "\"9d04260d-0000-1100-0000-66caed5e0000\"",
    "EventGroupingSettingAggregationKind":  {

                                            },
    "GroupingConfigurationEnabled":  true,
    "GroupingConfigurationGroupByAlertDetail":  [

                                                ],
    "GroupingConfigurationGroupByCustomDetail":  [

                                                 ],
    "GroupingConfigurationGroupByEntity":  [

                                           ],
    "GroupingConfigurationLookbackDuration":  {
                                                  "Ticks":  180000000000,
                                                  "Days":  0,
                                                  "Hours":  5,
                                                  "Milliseconds":  0,
                                                  "Minutes":  0,
                                                  "Seconds":  0,
                                                  "TotalDays":  0.20833333333333331,
                                                  "TotalHours":  5,
                                                  "TotalMilliseconds":  18000000,
                                                  "TotalMinutes":  300,
                                                  "TotalSeconds":  18000
                                              },
    "GroupingConfigurationMatchingMethod":  {

                                            },
    "GroupingConfigurationReopenClosedIncident":  false,
    "Id":  "/subscriptions/5cfeafdb-fc6b-4d09-971d-3320c5ec14a0/resourceGroups/training_jordan/providers/Microsoft.OperationalInsights/workspaces/acmesentinel/providers/Microsoft.SecurityInsights/alertRules/5041ee68-ef8a-4fbc-b286-3d898d200eec",
    "IncidentConfigurationCreateIncident":  true,
    "Kind":  {

             },
    "LastModifiedUtc":  "\/Date(1724575069869)\/",
    "Name":  "5041ee68-ef8a-4fbc-b286-3d898d200eec",
    "Query":  "DeviceEvents | where ActionType == \"PowerShellCommand\"  | where (((AdditionalFields contains \"Get-WmiObject\" or AdditionalFields contains \"Gwmi\" or AdditionalFields contains \"Get-CimInstance\" or AdditionalFields contains \"Gcim\") or (InitiatingProcessCommandLine contains \"Get-WmiObject\" or InitiatingProcessCommandLine contains \"Gwmi\" or InitiatingProcessCommandLine contains \"Get-CimInstance\" or InitiatingProcessCommandLine contains \"Gcim\")) and (AdditionalFields contains \"Win32_Shadowcopy\" or InitiatingProcessCommandLine contains \"Win32_Shadowcopy\") and ((AdditionalFields contains \"Delete\" or AdditionalFields contains \"Remove-WmiObject\" or AdditionalFields contains \"rwmi\" or AdditionalFields contains \"Remove-CimInstance\" or AdditionalFields contains \"rcim\") or (InitiatingProcessCommandLine contains \"Delete\" or InitiatingProcessCommandLine contains \"Remove-WmiObject\" or InitiatingProcessCommandLine contains \"rwmi\" or InitiatingProcessCommandLine contains \"Remove-CimInstance\" or InitiatingProcessCommandLine contains \"rcim\")))\n",
    "QueryFrequency":  {
                           "Ticks":  9000000000,
                           "Days":  0,
                           "Hours":  0,
                           "Milliseconds":  0,
                           "Minutes":  15,
                           "Seconds":  0,
                           "TotalDays":  0.010416666666666666,
                           "TotalHours":  0.25,
                           "TotalMilliseconds":  900000,
                           "TotalMinutes":  15,
                           "TotalSeconds":  900
                       },
    "QueryPeriod":  {
                        "Ticks":  9000000000,
                        "Days":  0,
                        "Hours":  0,
                        "Milliseconds":  0,
                        "Minutes":  15,
                        "Seconds":  0,
                        "TotalDays":  0.010416666666666666,
                        "TotalHours":  0.25,
                        "TotalMilliseconds":  900000,
                        "TotalMinutes":  15,
                        "TotalSeconds":  900
                    },
    "Severity":  {

                 },
    "SuppressionDuration":  {
                                "Ticks":  180000000000,
                                "Days":  0,
                                "Hours":  5,
                                "Milliseconds":  0,
                                "Minutes":  0,
                                "Seconds":  0,
                                "TotalDays":  0.20833333333333331,
                                "TotalHours":  5,
                                "TotalMilliseconds":  18000000,
                                "TotalMinutes":  300,
                                "TotalSeconds":  18000
                            },
    "SuppressionEnabled":  false,
    "SystemData":  {
                       "CreatedAt":  null,
                       "CreatedBy":  null,
                       "CreatedByType":  null,
                       "LastModifiedAt":  null,
                       "LastModifiedBy":  null,
                       "LastModifiedByType":  null
                   },
    "SystemDataCreatedAt":  null,
    "SystemDataCreatedBy":  null,
    "SystemDataCreatedByType":  null,
    "SystemDataLastModifiedAt":  null,
    "SystemDataLastModifiedBy":  null,
    "SystemDataLastModifiedByType":  null,
    "Tactic":  [
                   {

                   },
                   {

                   }
               ],
    "TemplateVersion":  null,
    "TriggerOperator":  {

                        },
    "TriggerThreshold":  0,
    "Type":  "Microsoft.SecurityInsights/alertRules"
}