{
  "query": "// --- Base email dataset (delivered only)\r\nlet EmailBase = EmailEvents\r\n    | where DeliveryAction has \"Delivered\"\r\n    | where DeliveryLocation has \"Inbox\"\r\n    | extend SenderLength = strlen(SenderFromAddress)\r\n    | where SenderLength > 100\r\n    | project\r\n        TimeGenerated,\r\n        NetworkMessageId,\r\n        SenderFromAddress,\r\n        SenderLength, \r\n        DeliveryAction,\r\n        DeliveryLocation,\r\n        RecipientEmailAddress,\r\n        Subject;\r\n// --- Attachment summary\r\nlet AttachmentSummary = EmailAttachmentInfo\r\n    | summarize \r\n        AttachmentCount = count(),\r\n        FileNames = make_list(FileName),\r\n        SHAs = make_list(SHA256)\r\n        by NetworkMessageId;\r\n// --- URL summary\r\nlet UrlSummary = EmailUrlInfo\r\n    | summarize \r\n        UrlCount = count(),\r\n        Urls = make_list(Url)\r\n        by NetworkMessageId;\r\n// --- URL clicks\r\nlet UrlClickedSummary = UrlClickEvents\r\n    | summarize \r\n        ClickedUrls = make_list(Url)\r\n        by NetworkMessageId;\r\n// --- Post delivery actions\r\nlet PostDelivery = EmailPostDeliveryEvents\r\n    | summarize PostDeliverySummary = make_list(\r\n                                          pack(\r\n    \"Action\",\r\n    Action,\r\n    \"ActionResult\",\r\n    ActionResult,\r\n    \"ActionTrigger\",\r\n    ActionTrigger,\r\n    \"ActionType\",\r\n    ActionType,\r\n    \"DeliveryLocation\",\r\n    DeliveryLocation,\r\n    \"ThreatTypes\",\r\n    ThreatTypes\r\n)\r\n                                      )\r\n        by NetworkMessageId;\r\n// --- Final join\r\nEmailBase\r\n| join kind=leftouter AttachmentSummary on NetworkMessageId\r\n| join kind=leftouter UrlSummary on NetworkMessageId\r\n| join kind=leftouter UrlClickedSummary on NetworkMessageId\r\n| join kind=leftouter PostDelivery on NetworkMessageId\r\n| where isempty(PostDeliverySummary)\r\n| project\r\n    TimeGenerated,\r\n    Sender = SenderFromAddress,\r\n    SenderLength,\r\n    DeliveryAction,\r\n    DeliveryLocation,\r\n    Recipient = RecipientEmailAddress,\r\n    Subject,\r\n    NetworkMessageId,\r\n    UrlCount,\r\n    AttachmentCount,\r\n    FileNames,\r\n    Urls,\r\n    ClickedUrls,\r\n    PostDeliverySummary\r\n| order by TimeGenerated desc"
}