{
"query":  "let lookback = 4h;\r\nlet excluded_senders = dynamic([\r\n    \"funds@eurekahedge.com\",\"data@absoluteucits.com\",\"data@eurohedge.com\",\"data@asiahedge.com\",\r\n    \"data@investhedge.com\",\"Data@hedgefundintelligence.com\",\"fundupdates@eurekahedge.com\",\r\n    \"data.registration@withintelligence.com\",\"devtest@withintelligence.com\",\r\n    \"Andrew.Marquardt@withintelligence.com\",\"hedgefunds@withintelligence.com\",\r\n    \"performance@withintelligence.com\",\"madealreporting@thedeal.com\",\"Riz.Malik@withintelligence.com\",\r\n    \"Claudia.Glover@withintelligence.com\",\"Sam.Mohabadian@withintelligence.com\",\r\n    \"Reception.London@withintelligence.com\",\"Robert.Szeluga@withintelligence.com\",\r\n    \"Brett.Haensel@withintelligence.com\",\"Daniel.McKimm@withintelligence.com\",\r\n    \"Harry.Peterson@withintelligence.com\",\"AccountsReceivable@withintelligence.com\",\r\n    \"support@foliometrics.co.uk\",\"Graham.Hatch@withintelligence.com\",\"manualqa@withintelligence.com\",\r\n    \"operations@withintelligence.com\",\"Chris.Barrett@withintelligence.com\",\r\n    \"socialcommittee@withintelligence.com\",\"Fay.Oborne@withintelligence.com\",\r\n    \"accountspayable@withintelligence.com\",\"BI@withintelligence.com\",\"j.murray@egr.global\",\r\n    \"kristina.pilapil@egr.global\",\"spsresearcheuro@suttonplacestrategies.com\",\r\n    \"Miriana.Vari@withintelligence.com\",\"procurement@withintelligence.com\",\"travel@withintelligence.com\",\r\n    \"pensionbridge@withintelligence.com\",\"spsresearch@suttonplacestrategies.com\",\r\n    \"Christopher.Manser@withintelligence.com\",\"qa-ui-automation@withintelligence.com\",\r\n    \"hello@savvyinvestor.net\",\"Pero.Ositelu@withintelligence.com\",\"Ruby.Oria@withintelligence.com\",\r\n    \"arcopies@withintelligence.com\",\"Adrian.Stringer@withintelligence.com\",\"William.Smith@withintelligence.com\",\r\n    \"EventsTeam@pageantmedia.com\",\"Douglas.Brown@withintelligence.com\",\"datapipeline@realfin.com\",\r\n    \"cancellation@withintelligence.com\",\"publicrecords@withintelligence.com\",\r\n    \"pm-research@pageantmedia.com\",\"Mary.TibbettsWu@withintelligence.com\",\"Sebastian.Black@withintelligence.com\",\r\n    \"hr@withintelligence.com\",\"Riza.Manliguez@egr.global\",\"contactsdata@withintelligence-email.com\",\r\n    \"Joy.Atme@withintelligence.com\",\"Summits@withintelligence.com\",\"max.acker@withintelligence.com\",\r\n    \"Charlie.Scott-Kerr@withintelligence.com\",\"reply@pm-research.com\",\"Solisa.Aarons@withintelligence.com\",\r\n    \"hello@withintelligence.com\",\"hfmbd@pageantmedia.com\",\"michael.cohen@withintelligence.com\",\r\n    \"Jacob.Conley@withintelligence.com\",\"Richard.Kelly@withintelligence.com\",\"Matt.Smith@withintelligence.com\",\r\n    \"customerservice@thedeal.com\",\"wi-devops@withintelligence.com\",\"Mary.Ajibola@withintelligence.com\",\r\n    \"Ricky.Cosgrove@withintelligence.com\",\"speakertravel@withintelligence.com\",\"Catherene.Daguil@egr.global\",\r\n    \"replyHFM@pageantmedia.com\",\"Events-Partnerships@pageantmedia.onmicrosoft.com\"\r\n]);\r\n// 8. Mailbox Delegation\r\nlet AlertMailboxDelegations = \r\n    OfficeActivity\r\n    | where TimeGenerated \u003e ago(lookback)\r\n    | where Operation =~ 'Add-MailboxPermission' \r\n    | extend IPAddress = iff(\r\n                             ClientIP matches regex @'^\\[[0-9a-fA-F:]+\\]:\\d+$',\r\n                             replace(@'^\\[([0-9a-fA-F:]+)\\]:\\d+$', @'\\1', tostring(ClientIP)),\r\n                             iff(\r\n                                ClientIP matches regex @'^\\d{1,3}(\\.\\d{1,3}){3}:\\d+$',\r\n                                replace(@'^(\\d{1,3}(\\.\\d{1,3}){3}):\\d+$', @'\\1', ClientIP),\r\n                                'Invalid IP'\r\n                             )\r\n                         )\r\n    | extend TargetID = tostring(parse_json(Parameters)[1].Value)\r\n    | extend Details = strcat(\r\n                      \"\\nUserUPN: \", tolower(UserId),\r\n                      \"\\nOperation: \", Operation,\r\n                      \"\\nTargetID: \", TargetID,\r\n                      \"\\nIPAddress: \", IPAddress,\r\n                      \"\\nOfficeObjectId: \", OfficeObjectId,\r\n                      \"\\nResultStatus: \", ResultStatus\r\n                  )\r\n    | extend Case = \"Mailbox Delegation\"\r\n    | project TimeGenerated, Case, Details;\r\n// 9. Device Isolation\r\nlet AlertDeviceIsolation = \r\n    CloudAppEvents\r\n    | where TimeGenerated \u003e ago(lookback)\r\n    | where ActionType == \"IsolateDevice\"\r\n    | extend Details = strcat(\r\n                           \"\\nUserUPN: \", RawEventData.UserId,\r\n                           \"\\nDeviceName: \", RawEventData.DeviceName\r\n                       )\r\n    | extend Case = \"Device Isolate\"\r\n    | project TimeGenerated, Case, Details;\r\n// 10. Privileged Role Assignment\r\nlet AlertPrivilegedRoleAssignment = \r\n    AuditLogs\r\n    | where TimeGenerated \u003e ago(lookback)\r\n    | where Category =~ \"RoleManagement\"\r\n    | where AADOperationType in (\"Assign\", \"AssignEligibleRole\")\r\n    | where ActivityDisplayName has_any (\"Add eligible member to role\", \"Add member to role\")\r\n    | mv-apply TargetResource = TargetResources on\r\n        (\r\n        where TargetResource.type in~ (\"User\")\r\n        | extend Target = iff(TargetResource.type =~ \"ServicePrincipal\", tostring(TargetResource.displayName), tostring(TargetResource.userPrincipalName))\r\n        | extend props = TargetResource.modifiedProperties\r\n        )\r\n    | mv-apply Property = props on\r\n        (\r\n        where Property.displayName =~ \"Role.DisplayName\"\r\n        | extend RoleName = trim('\"', tostring(Property.newValue))\r\n        )\r\n    | where RoleName contains \"Admin\" and Result == \"success\"\r\n    | extend InitiatingAppName = tostring(InitiatedBy.app.displayName)\r\n    | extend InitiatingUserPrincipalName = tostring(InitiatedBy.user.userPrincipalName)\r\n    | extend Initiator = iif(isnotempty(InitiatingAppName), InitiatingAppName, InitiatingUserPrincipalName)\r\n    | where Target !startswith \"wc-\"\r\n    | where Initiator != \"MS-PIM\"\r\n    | extend Details = strcat(\r\n                           \"\\nTarget: \", Target,\r\n                           \"\\nRoleName: \", RoleName,\r\n                           \"\\nInitiator: \", Initiator,\r\n                           \"\\nOperation: \", OperationName\r\n                       )\r\n    | extend Case = \"Privileged Role Assignment\"\r\n    | project TimeGenerated, Case, Details;\r\n// 11. Revoke Sessions\r\nlet AlertSessionsRevoke = \r\n    AuditLogs\r\n    | where TimeGenerated \u003e ago(lookback)\r\n    | where OperationName has 'StsRefreshTokenValidFrom'\r\n    | mv-expand TargetResources\r\n    | extend TargetResourcesModProps = TargetResources.modifiedProperties\r\n    | mv-expand TargetResourcesModProps\r\n    | where tostring(TargetResourcesModProps.displayName) =~ 'StsRefreshTokensValidFrom'\r\n    | extend InitiatingUserOrApp = iff(isnotempty(InitiatedBy.user.userPrincipalName), tostring(InitiatedBy.user.userPrincipalName), tostring(InitiatedBy.app.displayName))\r\n    | extend targetUserOrApp = TargetResources.userPrincipalName\r\n    | extend InitiatingIpAddress = iff(isnotempty(InitiatedBy.user.ipAddress), tostring(InitiatedBy.user.ipAddress), tostring(InitiatedBy.app.ipAddress))\r\n    | where InitiatingUserOrApp !contains \"wizard\"\r\n    | extend Details = strcat(\r\n                           \"\\nUserUPN: \", InitiatingUserOrApp,\r\n                           \"\\nTargetUser: \", targetUserOrApp,\r\n                           \"\\nIPAddress: \", InitiatingIpAddress\r\n                       )\r\n    | extend Case = \"Revoke Sessions\"\r\n    | project TimeGenerated, Case, Details;\r\n// 12. MailItem Access of another mailbox\r\nlet AlertMailItemAccess = \r\n   CloudAppEvents\r\n    | where TimeGenerated \u003e ago(lookback)\r\n    | where ActionType contains \"MailItemsAccessed\"\r\n    | extend MailboxOwner = tostring(RawEventData.MailboxOwnerUPN),\r\n             Actor = tostring(RawEventData.UserId)\r\n    | where MailboxOwner != Actor\r\n    | extend InternetMessageId = tostring(parse_json(tostring(parse_json(tostring(RawEventData.Folders))[0].FolderItems))[0].InternetMessageId)\r\n    | where isnotempty(InternetMessageId)\r\n    | join kind=inner (\r\n        EmailEvents\r\n        | project InternetMessageId, Subject, SenderFromAddress, To, Cc, DistributionList\r\n    ) on InternetMessageId\r\n    | where Actor != \"svc-athena-365@pageantmedia.com\"\r\n    | where MailboxOwner !in (excluded_senders)\r\n    | where MailboxOwner !endswith \"@pm-research.com\"\r\n    | where MailboxOwner !endswith \"@egr.global\"\r\n    | extend Details = strcat(\r\n                           \"\\nActor: \", Actor,\r\n                           \"\\nMailboxOwner: \", MailboxOwner,\r\n                           \"\\nSubject: \", Subject,\r\n                           \"\\nSenderFromAddress: \", SenderFromAddress,\r\n                           \"\\nTo: \", tostring(To),\r\n                           \"\\nCc: \", tostring(Cc),\r\n                           \"\\nDistributionList: \", tostring(DistributionList)\r\n                       )\r\n    | extend Case = \"MailItemAccess of another mailbox\"\r\n    | project TimeGenerated, Case, Details;\r\n// 13. Azure Activity\r\nlet AlertAzureActivity = \r\n   AzureActivity\r\n    | where TimeGenerated \u003e ago(lookback)\r\n    | where Caller contains \"@\"\r\n    | where OperationName contains \"delete\"\r\n    | where Caller !contains \"wizard\"\r\n    | where Caller !in (\"brayden.evans@withintelligence.com\", \"Robert.Northam@withintelligence.com\")\r\n    | extend Details = strcat(\r\n                           \"\\nCaller: \", Caller,\r\n                           \"\\nOperationName: \", OperationNameValue,\r\n                           \"\\nActivityStatusValue: \", ActivityStatusValue,\r\n                           \"\\nSubscriptionId: \", SubscriptionId,\r\n                           \"\\nResourceGroup: \", ResourceGroup,\r\n                           \"\\nCallerIpAddress: \", CallerIpAddress,\r\n                           \"\\nProperties: \", tostring(Properties_d)\r\n                       )\r\n    | extend Case = \"Azure Activity\"\r\n    | project TimeGenerated, Case, Details;\r\n// 14. Personal Email Similarity\r\nlet internal_domains = dynamic([\"withintelligence.com\", \"pageantgamingmedia.com\",\"journal.pageantmedia.com\"]);\r\nlet personal_domains = dynamic([\"gmail.com\",\"yahoo.com\",\"outlook.com\",\"hotmail.com\",\"icloud.com\",\"aol.com\",\"proton.me\"]);\r\nlet similarity_threshold = 0.5;\r\nlet AlertPersonalEmails = \r\n    EmailEvents\r\n    | where TimeGenerated \u003e ago(lookback)\r\n    | where SenderFromDomain has_any (internal_domains)\r\n    | where RecipientEmailAddress has_any (personal_domains)\r\n    | extend SenderUser = tostring(split(SenderFromAddress, \"@\")[0]),\r\n             RecipientUser = tostring(split(RecipientEmailAddress, \"@\")[0])\r\n    | extend SenderSet = unicode_codepoints_from_string(SenderUser),\r\n             RecipientSet = unicode_codepoints_from_string(RecipientUser)\r\n    | extend SimilarityScore = jaccard_index(SenderSet, RecipientSet)\r\n    | where SimilarityScore \u003e= similarity_threshold\r\n    | summarize SimilarRecipients = make_set(RecipientEmailAddress),\r\n                CountEmails = count(),\r\n                MaxSimilarity = max(SimilarityScore),\r\n                Subjects = make_set(Subject),\r\n                NID = make_set(NetworkMessageId)\r\n      by SenderFromAddress\r\n    | extend Details = strcat(\r\n        \"\\nSender: \", SenderFromAddress,\r\n        \"\\nSimilarRecipients: \", tostring(SimilarRecipients),\r\n        \"\\nSimiliartyScore: \", tostring(MaxSimilarity),\r\n        \"\\nEmailCount: \", tostring(CountEmails),\r\n        \"\\nEmailSubjects: \", tostring(Subjects),\r\n        \"\\nNID: \", tostring(NID)\r\n    )\r\n    | extend TimeGenerated = now(), Case = \"Personal Email Similarity\"\r\n    | project TimeGenerated, Case, Details;\r\nunion \r\n    AlertMailboxDelegations,\r\n    AlertDeviceIsolation,\r\n    AlertPrivilegedRoleAssignment,\r\n    AlertSessionsRevoke,\r\n    AlertMailItemAccess,\r\n    AlertAzureActivity,\r\n    AlertPersonalEmails\r\n| project-reorder Case, TimeGenerated\r\n"
}
